question,cypher,data_source,instance_id,database_reference_alias
What is the average 'amount' of filings concerning entities that are also originators of other filings?,MATCH (f:Filing)-[:CONCERNS]->(e:Entity) WHERE EXISTS {   (e)-[:ORIGINATOR]->(:Filing) } WITH avg(f.amount) AS average_amount RETURN average_amount,neo4jLabs_synthetic_gemini,instance_id_29068,neo4jlabs_demo_db_fincen
What is the total 'amount' of filings benefited by entities located in countries with 'tld' equal to 'GB'?,MATCH (c:Country {tld: 'GB'})<-[:COUNTRY]-(e:Entity)-[r:BENEFITS]->(f:Filing) WITH sum(f.amount) AS total RETURN total,neo4jLabs_synthetic_gemini,instance_id_29089,neo4jlabs_demo_db_fincen
List the top 5 movies by revenue that were released in the last five years of the schema's data range.,"MATCH (m:Movie) WHERE m.released >= ""2011-01-01"" AND m.released <= ""2016-12-31"" AND m.revenue IS NOT NULL RETURN m ORDER BY m.revenue DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_25286,neo4jlabs_demo_db_recommendations
List the services that are instances of the same software as the service with pid 2586.,MATCH (s:Service {pid: 2586})-[:INSTANCE]->(sw:Software) WITH sw MATCH (s2:Service)-[:INSTANCE]->(sw) RETURN s2.name AS service_name,neo4jLabs_synthetic_gemini,instance_id_31655,neo4jlabs_demo_db_network
Identify the top 3 tweets with links pointing to 'https://twitter.com'.,MATCH (t:Tweet)-[:CONTAINS]->(l:Link) WHERE l.url STARTS WITH 'https://twitter.com' RETURN t ORDER BY t.favorites DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24284,neo4jlabs_demo_db_twitter
What are the names of the top 3 discontinued products?,MATCH (p:Product) WHERE p.discontinued = true RETURN p.productName ORDER BY p.productID LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20467,neo4jlabs_demo_db_northwind
Display tweets that use the source named 'Buffer'.,MATCH (t:Tweet)-[:USING]->(s:Source {name: 'Buffer'}) RETURN t,neo4jLabs_synthetic_gpt4turbo,instance_id_24872,neo4jlabs_demo_db_twitter
Show the top 3 Filings with the latest end dates.,MATCH (f:Filing) RETURN f ORDER BY f.end DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21484,neo4jlabs_demo_db_fincen
Which products have a discounted price of less than $15 in any of their orders?,"MATCH (p:Product)-[o:ORDERS]->(:Order) WHERE toFloat(o.unitPrice) * (1 - toFloat(o.discount)) < 15 RETURN p.productName, p.productID, o.unitPrice, o.discount",neo4jLabs_synthetic_gpt4turbo,instance_id_20558,neo4jlabs_demo_db_northwind
List the first 3 tweets from 'neo4j' that contain links to external websites.,"MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet)-[:CONTAINS]->(l:Link) RETURN t.text, l.url ORDER BY t.created_at ASC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42974,neo4jlabs_demo_db_twitter
Which person has the highest average rating for movies they acted in?,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie)<-[r:REVIEWED]-() WITH p, avg(r.rating) AS average_rating RETURN p.name AS person_name, average_rating ORDER BY average_rating DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32652,neo4jlabs_demo_db_movies
"What is the name of the actor who has the most movies in the ""Action"" genre?","MATCH (g:Genre {name: ""Action""})<-[:IN_GENRE]-(m:Movie) WITH g, m MATCH (a:Actor)-[:ACTED_IN]->(m) WITH g, a, count(DISTINCT m) AS movieCount ORDER BY movieCount DESC RETURN a.name AS actorName, movieCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29517,neo4jlabs_demo_db_recommendations
List the top 3 oldest actors in the database.,"MATCH (p:Person)-[:ACTED_IN]->(:Movie) RETURN p.name AS actor, p.born AS birthYear ORDER BY p.born ASC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_40125,neo4jlabs_demo_db_movies
What are the names of the top 5 most followed streams that have at least one VIP?,MATCH (stream:Stream) WHERE EXISTS ((stream)-[:VIP]->()) WITH stream ORDER BY stream.followers DESC LIMIT 5 RETURN stream.name,neo4jLabs_synthetic_gemini,instance_id_33722,neo4jlabs_demo_db_twitch
Who has produced the most movies?,"MATCH (p:Person)-[:PRODUCED]->(m:Movie) RETURN p.name, count(m) AS movies_produced ORDER BY movies_produced DESC LIMIT 1",neo4jLabs_synthetic_gpt4turbo,instance_id_23380,neo4jlabs_demo_db_movies
Which products have a unit price lower than the average unit price of products supplied by their supplier?,"MATCH (p:Product)-[:SUPPLIES]-(s:Supplier) WITH s, avg(p.unitPrice) AS average_price MATCH (p1:Product)-[:SUPPLIES]-(s1:Supplier) WHERE p1.unitPrice < average_price AND s1 = s RETURN p1.productName",neo4jLabs_synthetic_gemini,instance_id_32293,neo4jlabs_demo_db_northwind
List the top 5 movies that have been rated the lowest by users.,"MATCH (u:User)-[r:RATED]->(m:Movie) RETURN m.title, avg(r.rating) AS average_rating ORDER BY average_rating ASC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_25024,neo4jlabs_demo_db_recommendations
Which 3 suppliers supply products with a unit price less than $10?,MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE p.unitPrice < 10 RETURN s.companyName LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_44628,neo4jlabs_demo_db_northwind
What is the average box office gross of movies based on comic books?,MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WHERE g.name = 'Action' OR g.name = 'Adventure' WITH avg(m.revenue) AS average_revenue RETURN average_revenue,neo4jLabs_synthetic_gemini,instance_id_31982,neo4jlabs_demo_db_eoflix
What is the name of the game that is played by the stream that is VIPed by the user with the least amount of followers?,"MATCH (u:User)-[:VIP]->(s:Stream)-[:PLAYS]->(g:Game) RETURN g.name, u.name AS user_name, u.followers AS user_followers ORDER BY user_followers ASC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_33886,neo4jlabs_demo_db_twitch
How many streams have a total view count that is a multiple of 1000?,MATCH (s:Stream) WHERE s.total_view_count % 1000 = 0 RETURN count(s),neo4jLabs_synthetic_gemini,instance_id_34187,neo4jlabs_demo_db_twitch
List the top 3 actors by the number of roles in movies released after 2010.,"MATCH (a:Actor)-[r:ACTED_IN]->(m:Movie) WHERE m.year > 2010 RETURN a.name, count(r) AS roles ORDER BY roles DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24623,neo4jlabs_demo_db_recommendations
Which 3 users have rated the oldest movies in the database?,"MATCH (u:User)-[r:RATED]->(m:Movie) WITH m, u ORDER BY m.year ASC, r.timestamp ASC RETURN u.userId, u.name, COLLECT(m.title)[..3] AS movies_rated LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_26150,neo4jlabs_demo_db_recommendations
What are the top 3 countries that have the most entities located in them?,"MATCH (e:Entity)-[:COUNTRY]->(c:Country) WITH c.code AS country_code, count(e) AS entity_count ORDER BY entity_count DESC RETURN country_code, entity_count LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_28149,neo4jlabs_demo_db_fincen
What is the title of the movie with the longest tagline?,MATCH (m:Movie) WITH max(size(m.tagline)) AS max_tagline_length MATCH (m:Movie) WHERE size(m.tagline) = max_tagline_length RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_33066,neo4jlabs_demo_db_movies
Who are the first 3 users who are VIPs in the stream with the highest number of moderators?,"MATCH (s:Stream) WITH s, count{(s)-[:MODERATOR]->()} AS moderatorCount ORDER BY moderatorCount DESC LIMIT 1 MATCH (s)-[:VIP]->(u:User) RETURN u LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25614,neo4jlabs_demo_db_twitch
List the first 3 adult films with a tagline containing the word 'sex'.,"MATCH (a:Adult) WHERE a.tagline CONTAINS 'sex' RETURN a.title, a.tagline ORDER BY a.release_date LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44145,neo4jlabs_demo_db_eoflix
Find the `productName` and `supplierID` for the product with the highest difference between its `unitPrice` and the average `unitPrice` of its category.,"MATCH (p:Product)-[:PART_OF]->(c:Category) WITH c, avg(p.unitPrice) AS avgCategoryPrice MATCH (p:Product)-[:PART_OF]->(c) WITH p, avgCategoryPrice, abs(p.unitPrice - avgCategoryPrice) AS priceDifference ORDER BY priceDifference DESC LIMIT 1 RETURN p.productName, p.supplierID",neo4jLabs_synthetic_gemini,instance_id_32246,neo4jlabs_demo_db_northwind
What is the name of the data center that contains the egress router 'DC1-RE'?,MATCH (egress:Egress {name: 'DC1-RE'})<-[:CONTAINS]-(dc:DataCenter) RETURN dc.name,neo4jLabs_synthetic_gemini,instance_id_31671,neo4jlabs_demo_db_network
What is the start time of the OS running on the machine 'DC1-RCK-4-9-M-103'?,MATCH (m:Machine {name: 'DC1-RCK-4-9-M-103'})-[:RUNS]->(os:OS) RETURN os.startTime,neo4jLabs_synthetic_gemini,instance_id_31666,neo4jlabs_demo_db_network
Identify the first 3 tweets posted by 'Me' that reply to another tweet.,MATCH (me:Me)-[:POSTS]->(tweet:Tweet)-[:REPLY_TO]->(:Tweet) RETURN tweet ORDER BY tweet.created_at ASC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24165,neo4jlabs_demo_db_twitter
Which 5 directors have directed the most movies with budgets over 50 million?,"MATCH (d:Director)-[:DIRECTED]->(m:Movie) WHERE m.budget > 50000000 WITH d, count(m) AS moviesDirected ORDER BY moviesDirected DESC LIMIT 5 RETURN d.name, moviesDirected",neo4jLabs_synthetic_gpt4turbo,instance_id_25048,neo4jlabs_demo_db_recommendations
List the names of entities that have the same jurisdiction_description as the entity with name 'KENT DEVELOPMENT LIMITED'.,MATCH (e1:Entity {name: 'KENT DEVELOPMENT LIMITED'}) WITH e1.jurisdiction_description AS targetJurisdiction MATCH (e2:Entity {jurisdiction_description: targetJurisdiction}) WHERE e2.name <> 'KENT DEVELOPMENT LIMITED' RETURN DISTINCT e2.name AS entityName,neo4jLabs_synthetic_gemini,instance_id_30901,neo4jlabs_demo_db_offshoreleaks
"List the first 3 movies with the keyword ""jealousy"" ordered by release date.","MATCH (k:Keyword {name: ""jealousy""})<-[:HAS_KEYWORD]-(m:Movie) RETURN m.title AS movie_title ORDER BY m.release_date LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_34284,neo4jlabs_demo_db_eoflix
List the first 3 categories with products that have been ordered more than 50 times.,"MATCH (c:Category)<-[:PART_OF]-(p:Product)<-[:ORDERS]-(o:Order) WITH c, p, COUNT(o) AS orderCount WHERE orderCount > 50 RETURN c.categoryName ORDER BY orderCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45151,neo4jlabs_demo_db_northwind
List the actors who have directed movies released before 1990.,MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE m.released < 1990 WITH DISTINCT p MATCH (p)-[:DIRECTED]->(m)<-[:ACTED_IN]-(a:Person) RETURN DISTINCT a.name,neo4jLabs_synthetic_gemini,instance_id_33058,neo4jlabs_demo_db_movies
List the customers who have purchased products that are currently discontinued.,MATCH (p:Product {discontinued: true})<-[:ORDERS]-(o:Order)<-[:PURCHASED]-(c:Customer) RETURN DISTINCT c.companyName,neo4jLabs_synthetic_gemini,instance_id_30802,neo4jlabs_demo_db_northwind
Is there a path from the data center 'DC1' to the 'java' service?,"MATCH (dc:DataCenter {name: 'DC1'}), (s:Service {name: 'java'}) RETURN EXISTS((dc)-[:CONTAINS*..10]->(s))",neo4jLabs_synthetic_gemini,instance_id_31710,neo4jlabs_demo_db_network
List the product names of products that have been ordered with a discount greater than 0.1.,MATCH (:Order)-[o:ORDERS]->(p:Product) WHERE toFloat(o.discount) > 0.1 RETURN DISTINCT p.productName,neo4jLabs_synthetic_gemini,instance_id_30870,neo4jlabs_demo_db_northwind
List all persons who have directed and reviewed the same movie.,"MATCH (p:Person)-[:DIRECTED]->(m:Movie)<-[:REVIEWED]-(p) RETURN p.name, m.title",neo4jLabs_synthetic_gpt4turbo,instance_id_23860,neo4jlabs_demo_db_movies
List the first 3 adult films with a budget less than 50000 USD.,"MATCH (a:Adult) WHERE a.budget < 50000 RETURN a.title, a.budget ORDER BY a.budget ASC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44415,neo4jlabs_demo_db_eoflix
What are the titles of the movies that have a runtime greater than 120 minutes?,MATCH (m:Movie) WHERE m.runtime > 120 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32067,neo4jlabs_demo_db_eoflix
Identify the 5 most recently shipped orders.,"MATCH (o:Order) WHERE o.shippedDate IS NOT NULL RETURN o.orderID, o.shippedDate ORDER BY o.shippedDate DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44530,neo4jlabs_demo_db_northwind
List other entities connected to Samoa.,"MATCH (e:Entity {jurisdiction_description: ""Samoa""})-[:connected_to]->(connected:Entity) RETURN connected",neo4jLabs_synthetic_gpt4turbo,instance_id_21218,neo4jlabs_demo_db_offshoreleaks
Which entities have a service provider of 'Mossack Fonseca' and were incorporated in 2006?,"MATCH (e:Entity) WHERE e.service_provider = 'Mossack Fonseca' AND e.incorporation_date CONTAINS '2006' RETURN e.name, e.incorporation_date, e.service_provider",neo4jLabs_synthetic_gpt4o,instance_id_44946,neo4jlabs_demo_db_offshoreleaks
"How many Entities have the same registered address as the entity with the internal_id ""1000914""?","MATCH (e:Entity {internal_id: ""1000914""})-[:registered_address]->(a:Address) WITH a MATCH (a)<-[:registered_address]-(other:Entity) WHERE other.internal_id <> ""1000914"" WITH count(DISTINCT other) AS count RETURN count",neo4jLabs_synthetic_gemini,instance_id_30742,neo4jlabs_demo_db_offshoreleaks
List the movies that have been released in more than 5 countries.,MATCH (m:Movie) WHERE size(m.countries) > 5 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_25352,neo4jlabs_demo_db_recommendations
Identify products that are part of the 'Meat/Poultry' category and have more than 30 units in stock.,"MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Meat/Poultry'}) WHERE p.unitsInStock > 30 RETURN p.productName, p.unitsInStock",neo4jLabs_synthetic_gpt4turbo,instance_id_22082,neo4jlabs_demo_db_northwind
Name the people who have the role of both actor and director in the most movies.,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WITH p, count(m) AS actedInMovies MATCH (p)-[:DIRECTED]->(m:Movie) WITH p, actedInMovies, count(m) AS directedMovies WHERE actedInMovies > 0 AND directedMovies > 0 RETURN p.name, actedInMovies, directedMovies ORDER BY actedInMovies + directedMovies DESC LIMIT 1",neo4jLabs_synthetic_gpt4turbo,instance_id_23895,neo4jlabs_demo_db_movies
Retrieve the first 3 filings where the originator bank country is 'Singapore' and the beneficiary bank country is 'United Kingdom'.,MATCH (f:Filing) WHERE f.originator_bank_country = 'Singapore' AND f.beneficiary_bank_country = 'United Kingdom' RETURN f ORDER BY f.begin LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_41065,neo4jlabs_demo_db_fincen
What is the release date of the video 'Jonah: A VeggieTales Movie'?,MATCH (v:Video {title: 'Jonah: A VeggieTales Movie'}) RETURN v.release_date,neo4jLabs_synthetic_gemini,instance_id_34358,neo4jlabs_demo_db_eoflix
Which actors have the most diverse filmography based on genre?,"MATCH (p:Person)-[:CAST_FOR]->(m:Movie)-[:IN_GENRE]->(g:Genre) WITH p, count(DISTINCT g) AS genreCount RETURN p.name AS actorName, genreCount ORDER BY genreCount DESC LIMIT 10",neo4jLabs_synthetic_gemini,instance_id_31826,neo4jlabs_demo_db_eoflix
List the first 3 production companies that have produced movies with a global gross exceeding 1 billion dollars.,"MATCH (m:Movie)-[:PRODUCED_BY]->(pc:ProductionCompany) WHERE m.revenue > 1000000000 WITH pc, count(DISTINCT m) AS movieCount ORDER BY movieCount DESC LIMIT 3 RETURN pc.name",neo4jLabs_synthetic_gemini,instance_id_34639,neo4jlabs_demo_db_eoflix
Which products are part of the 'Beverages' category?,MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Beverages'}) RETURN p.productName AS productName,neo4jLabs_synthetic_gpt4o,instance_id_44644,neo4jlabs_demo_db_northwind
"Name the movies that have a review summary 'Silly, but fun'.","MATCH (:Person)-[r:REVIEWED]->(m:Movie) WHERE r.summary = 'Silly, but fun' RETURN m.title AS movie_title",neo4jLabs_synthetic_gpt4o,instance_id_40059,neo4jlabs_demo_db_movies
What are the top 5 most recent intermediary connections to entities?,"MATCH (i:Intermediary)-[r:intermediary_of]->(e:Entity) RETURN i.name AS IntermediaryName, e.name AS EntityName, r.start_date AS ConnectionStartDate ORDER BY r.start_date DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44815,neo4jlabs_demo_db_offshoreleaks
Show the top 5 movies with revenues exceeding 1 billion dollars.,MATCH (m:Movie) WHERE m.revenue > 1000000000 RETURN m ORDER BY m.revenue DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24587,neo4jlabs_demo_db_recommendations
"What is the name of the Address with the icij_id ""7C1AAD6896EFDED57D680B82E7ADF7AB""?","MATCH (a:Address {icij_id: ""7C1AAD6896EFDED57D680B82E7ADF7AB""})  RETURN a.name",neo4jLabs_synthetic_gemini,instance_id_30751,neo4jlabs_demo_db_offshoreleaks
What are the names of the top 5 people who followed someone born in 1956?,MATCH (p:Person)-[:FOLLOWS]->(followed:Person {born: 1956}) RETURN p.name AS Name ORDER BY p.name LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23657,neo4jlabs_demo_db_movies
What is the average popularity score of movies released in 2000?,MATCH (m:Movie) WHERE date(m.release_date).year = 2000 WITH avg(m.popularity) AS average_popularity RETURN average_popularity,neo4jLabs_synthetic_gemini,instance_id_34196,neo4jlabs_demo_db_eoflix
Name the top 3 products with the lowest unit price in the 'Grains/Cereals' category.,"MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Grains/Cereals'}) RETURN p.productName, p.unitPrice ORDER BY p.unitPrice ASC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44614,neo4jlabs_demo_db_northwind
List the countries with entities that filed filings as originators where the amount is greater than 1000000.,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE f.amount > 1000000 RETURN DISTINCT c.name,neo4jLabs_synthetic_gemini,instance_id_28067,neo4jlabs_demo_db_fincen
"Show the first 5 countries with the most filings involving transactions below $100,000.","MATCH (c:Country)<-[:COUNTRY]-(e:Entity)-[:FILED]->(f:Filing) WHERE f.amount < 100000 RETURN c.name, count(f) AS filings_count ORDER BY filings_count DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21545,neo4jlabs_demo_db_fincen
What are the top 3 countries with the most filings as an originator in 2012?,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE f.begin >= datetime(""2012-01-01T00:00:00Z"") AND f.end <= datetime(""2012-12-31T23:59:59Z"") WITH c.name AS country, COUNT(f) AS filings_count ORDER BY filings_count DESC LIMIT 3 RETURN country, filings_count",neo4jLabs_synthetic_gpt4o,instance_id_41375,neo4jlabs_demo_db_fincen
Which game is streamed by the most teams and list the first 3 teams?,"MATCH (s:Stream)-[:PLAYS]->(g:Game),       (s)-[:HAS_TEAM]->(t:Team) WITH g, t, COUNT(DISTINCT t) AS teamCount ORDER BY teamCount DESC LIMIT 1 WITH g MATCH (s:Stream)-[:PLAYS]->(g),       (s)-[:HAS_TEAM]->(t:Team) RETURN g.name AS game, COLLECT(t.name)[0..3] AS topTeams",neo4jLabs_synthetic_gpt4o,instance_id_43242,neo4jlabs_demo_db_twitch
"""give me top 5 movies ""","MATCH (m:Movie) RETURN m.title, m.votes ORDER BY m.votes DESC LIMIT 5",neo4j_crowdsourced,instance_id_27695,neo4jlabs_demo_db_movies
Which products have both more than 70 units on order and a reorder level above 15?,"MATCH (p:Product) WHERE p.unitsOnOrder > 70 AND p.reorderLevel > 15 RETURN p.productName, p.unitsOnOrder, p.reorderLevel",neo4jLabs_synthetic_gpt4o,instance_id_44712,neo4jlabs_demo_db_northwind
How many entities have an incorporation_date in 2006?,MATCH (e:Entity) WHERE e.incorporation_date CONTAINS '2006' RETURN count(e) AS count,neo4jLabs_synthetic_gemini,instance_id_30757,neo4jlabs_demo_db_offshoreleaks
"What is the most common jurisdiction for Entities with the status ""Defaulted""?","MATCH (e:Entity {status: ""Defaulted""}) WITH e.jurisdiction AS jurisdiction, count(*) AS count ORDER BY count DESC RETURN jurisdiction, count LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_30649,neo4jlabs_demo_db_offshoreleaks
Find the products with 'unitPrice' between 10 and 20.,"MATCH (p:Product) WHERE p.unitPrice >= 10 AND p.unitPrice <= 20 RETURN p.productName, p.unitPrice",neo4jLabs_synthetic_gpt4o,instance_id_44983,neo4jlabs_demo_db_northwind
"""Which actors played in the most movies and which movies?""","MATCH (p:Person)-[a:ACTED_IN]->(m:Movie) RETURN p.name, collect(m.title) AS movies, count(a) AS movie_count ORDER BY movie_count DESC LIMIT 1",neo4j_crowdsourced,instance_id_27664,neo4jlabs_demo_db_movies
List the top 3 users with the lowest number of followers who follow 'Neo4j'.,"MATCH (neo4j:Me {screen_name: 'neo4j'})<-[:FOLLOWS]-(user:User) RETURN user.screen_name, user.followers ORDER BY user.followers ASC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42821,neo4jlabs_demo_db_twitter
What is the budget for the movie 'Grumpier Old Men'?,MATCH (m:Movie {title: 'Grumpier Old Men'}) RETURN m.budget,neo4jLabs_synthetic_gemini,instance_id_34338,neo4jlabs_demo_db_eoflix
List the top 5 streams that have at least one user as a chatter and are associated with the game 'Rust'.,"MATCH (s:Stream)-[:PLAYS]->(g:Game {name: 'Rust'}) MATCH (s)-[:CHATTER]->(:User) RETURN s.name, s.url, s.followers, s.total_view_count ORDER BY s.followers DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43507,neo4jlabs_demo_db_twitch
What is the price of the package with id 0?,MATCH (p:Package {id: 0}) RETURN p.price,neo4jLabs_synthetic_gemini,instance_id_34442,neo4jlabs_demo_db_eoflix
Which movies have been reviewed with a rating exactly 75?,"MATCH (p:Person)-[r:REVIEWED {rating: 75}]->(m:Movie) RETURN m.title AS MovieTitle, p.name AS ReviewerName",neo4jLabs_synthetic_gpt4turbo,instance_id_23684,neo4jlabs_demo_db_movies
Display the top 5 movies that were most recently released.,MATCH (m:Movie) RETURN m ORDER BY m.release_date DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23633,neo4jlabs_demo_db_eoflix
List the top 3 movies that were released before the year 2000 and have an 'original_language' of 'en'.,MATCH (m:Movie)-[:ORIGINAL_LANGUAGE]->(l:Language {id: 'en'}) WHERE m.release_date < date('2000-01-01') RETURN m ORDER BY m.release_date DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21068,neo4jlabs_demo_db_eoflix
Show the first 3 orders for the product 'Chai'.,"MATCH (p:Product {productName: 'Chai'})<-[:ORDERS]-(o:Order) RETURN o.orderID, o.orderDate, o.shipName, o.shipCity, o.shipCountry ORDER BY o.orderDate LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44603,neo4jlabs_demo_db_northwind
List the first 5 orders that included a product from the 'Seafood' category.,MATCH (c:Category {categoryName: 'Seafood'})<-[:PART_OF]-(p:Product)-[:ORDERS]->(o:Order) RETURN o LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21711,neo4jlabs_demo_db_northwind
"What is the average amount of filings benefiting entities in the country with code ""CHN""?",MATCH (:Entity{country: 'CHN'})<-[:BENEFITS]-(f:Filing) RETURN avg(f.amount) AS averageAmount,neo4jLabs_synthetic_gemini,instance_id_29009,neo4jlabs_demo_db_fincen
Which 3 videos have the most detailed overviews?,"MATCH (v:Video) WHERE v.overview IS NOT NULL RETURN v.title, v.overview ORDER BY size(v.overview) DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20687,neo4jlabs_demo_db_eoflix
"List the users who follow Neo4j and have posted tweets using the source ""Buffer"".",MATCH (neo:User {screen_name: 'neo4j'})<-[:FOLLOWS]-(follower:User) MATCH (follower)-[:POSTS]->(tweet:Tweet)-[:USING]->(source:Source {name: 'Buffer'}) RETURN DISTINCT follower.screen_name,neo4jLabs_synthetic_gemini,instance_id_34464,neo4jlabs_demo_db_twitter
List the top 3 movies with the most revenue that were released before the year 2000.,MATCH (m:Movie) WHERE m.release_date < date('2000-01-01') AND m.revenue IS NOT NULL RETURN m ORDER BY m.revenue DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23587,neo4jlabs_demo_db_eoflix
List the top 5 streams with the most followers.,"MATCH (s:Stream) RETURN s.name, s.followers ORDER BY s.followers DESC LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_33792,neo4jlabs_demo_db_twitch
"How many users are chatters in streams that have the language ""ru""?","MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE l.name = ""ru"" WITH DISTINCT s MATCH (s)<-[:CHATTER]-(u:User) RETURN count(DISTINCT u)",neo4jLabs_synthetic_gemini,instance_id_33883,neo4jlabs_demo_db_twitch
Which streams have no team associated and list the first 5.,"MATCH (s:Stream) WHERE NOT (s)-[:HAS_TEAM]->(:Team) RETURN s.name, s.url, s.followers, s.total_view_count LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43261,neo4jlabs_demo_db_twitch
Find the suppliers who supply products with a 'reorderLevel' greater than 20 and are based in 'Germany'.,MATCH (p:Product)-[:SUPPLIES]-(s:Supplier) WHERE p.reorderLevel > 20 AND s.country = 'Germany' RETURN DISTINCT s.companyName,neo4jLabs_synthetic_gemini,instance_id_32282,neo4jlabs_demo_db_northwind
List the `productName` of products ordered by customers located in 'USA' that have a `unitPrice` higher than the average `unitPrice` of all products.,MATCH (p:Product) WITH avg(p.unitPrice) AS averageUnitPrice MATCH (c:Customer {country: 'USA'})-[:PURCHASED]->(o:Order)-[r:ORDERS]->(p:Product) WHERE p.unitPrice > averageUnitPrice RETURN p.productName,neo4jLabs_synthetic_gemini,instance_id_32213,neo4jlabs_demo_db_northwind
"What is the average budget of movies directed by the director of ""Toy Story""?",MATCH (m:Movie {title: 'Toy Story'}) MATCH (m)<-[cf:CREW_FOR]-(d:Person) WHERE cf.job = 'Director' MATCH (d)-[:CREW_FOR]->(otherMovies:Movie) RETURN avg(otherMovies.budget),neo4jLabs_synthetic_gemini,instance_id_31991,neo4jlabs_demo_db_eoflix
List the top 3 movies that were most frequently rated by users.,"MATCH (u:User)-[r:RATED]->(m:Movie) RETURN m, count(r) AS ratingsCount ORDER BY ratingsCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24694,neo4jlabs_demo_db_recommendations
"Which entities originated filings where the beneficiary bank is ""Barclays Bank Plc""?","MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WHERE f.beneficiary_bank = ""Barclays Bank Plc"" RETURN e.name",neo4jLabs_synthetic_gemini,instance_id_28287,neo4jlabs_demo_db_fincen
Find the movie with the largest number of different roles for a single actor.,"MATCH (m:Movie)<-[ai:ACTED_IN]-(p:Person) WITH m, size(ai.roles) AS roleCount WITH max(roleCount) AS maxRoleCount MATCH (m:Movie)<-[ai:ACTED_IN]-(p:Person) WHERE size(ai.roles) = maxRoleCount RETURN m.title, maxRoleCount",neo4jLabs_synthetic_gemini,instance_id_32845,neo4jlabs_demo_db_movies
"""장르의 유형에 대해 모두 출력하여라""",MATCH (g:Genre) RETURN g.name,neo4j_crowdsourced,instance_id_27798,neo4jlabs_demo_db_recommendations
Can you list the first 4 dependencies of the 'webserver' application?,MATCH (app:Application {name: 'webserver'})-[:DEPENDS_ON]->(dep) RETURN dep.name LIMIT 4,neo4jLabs_synthetic_gpt4o,instance_id_43923,neo4jlabs_demo_db_network
List all movies that have been rated by at least 5 different users.,"MATCH (m:Movie)<-[:RATED]-(u:User) WITH m, COUNT(DISTINCT u) AS userCount WHERE userCount >= 5 RETURN m.title AS MovieTitle, userCount",neo4jLabs_synthetic_gpt4o,instance_id_42010,neo4jlabs_demo_db_recommendations
How many suppliers are there for each country?,"MATCH (s:Supplier) WITH s.country AS country, count(DISTINCT s) AS supplierCount RETURN country, supplierCount",neo4jLabs_synthetic_gemini,instance_id_32204,neo4jlabs_demo_db_northwind
List all persons who have not reviewed any movies.,MATCH (p:Person) WHERE NOT exists{ (p)-[:REVIEWED]->(:Movie) } RETURN p,neo4jLabs_synthetic_gpt4turbo,instance_id_23857,neo4jlabs_demo_db_movies
What is the average number of movies produced by each production company?,"MATCH (m:Movie)-[:PRODUCED_BY]->(p:ProductionCompany) WITH p, count(m) AS num_movies RETURN avg(num_movies) AS average_movies_per_company",neo4jLabs_synthetic_gemini,instance_id_34236,neo4jlabs_demo_db_eoflix
What is the average number of favorites for tweets posted by users who follow Neo4j?,"MATCH (neo4j:User {screen_name: ""neo4j""})<-[:FOLLOWS]-(follower:User) WITH follower MATCH (follower)-[:POSTS]->(tweet:Tweet) WITH avg(tweet.favorites) AS average_favorites RETURN average_favorites",neo4jLabs_synthetic_gemini,instance_id_34469,neo4jlabs_demo_db_twitter
List the filings with the highest number of originators.,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WITH f, COUNT(e) AS originator_count ORDER BY originator_count DESC RETURN f, originator_count LIMIT 1",neo4jLabs_synthetic_gpt4o,instance_id_41285,neo4jlabs_demo_db_fincen
List the top 3 games with the highest average total view count for streams playing them.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WITH g, avg(s.total_view_count) AS avg_view_count ORDER BY avg_view_count DESC RETURN g.name, avg_view_count LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_34186,neo4jlabs_demo_db_twitch
Which genre has the highest average movie budget?,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WITH g, avg(m.budget) AS averageBudget ORDER BY averageBudget DESC RETURN g.name AS genreName, averageBudget LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_31909,neo4jlabs_demo_db_eoflix
"""list 3 movies made in 1990s""",MATCH (m:Movie) WHERE m.released >= 1990 AND m.released < 2000 RETURN m.title LIMIT 3,neo4j_crowdsourced,instance_id_27486,neo4jlabs_demo_db_movies
Identify the top 5 filings that ended in the year 2014 and involve an originator bank from 'United Kingdom'.,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE f.end >= datetime('2014-01-01T00:00:00Z') AND f.end < datetime('2015-01-01T00:00:00Z')   AND c.name = 'United Kingdom' RETURN f ORDER BY f.amount DESC LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_41200,neo4jlabs_demo_db_fincen
List the three entities with the most filings involving a beneficiary bank in 'United Kingdom' and an originator bank in 'Singapore'.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WHERE f.beneficiary_bank_country = 'United Kingdom' AND f.originator_bank_country = 'Singapore' WITH e, COUNT(f) AS num_filings ORDER BY num_filings DESC LIMIT 3 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_41449,neo4jlabs_demo_db_fincen
What is the average number of roles played by actors in each movie?,"MATCH (:Person)-[r:ACTED_IN]->(m:Movie) WITH m, avg(size(r.roles)) AS average_roles RETURN m.title AS movie_title, average_roles",neo4jLabs_synthetic_gemini,instance_id_32843,neo4jlabs_demo_db_movies
Find all entities that have a registered address with a country code that is different from the country code of the entity.,MATCH (e:Entity)-[r:registered_address]->(a:Address) WHERE e.country_codes <> a.country_codes RETURN DISTINCT e.name,neo4jLabs_synthetic_gemini,instance_id_30592,neo4jlabs_demo_db_offshoreleaks
List the top 3 users who have given the highest average ratings.,"MATCH (u:User)-[r:RATED]->(m:Movie) WITH u, avg(r.rating) AS avgRating ORDER BY avgRating DESC LIMIT 3 RETURN u.userId, u.name, avgRating",neo4jLabs_synthetic_gpt4turbo,instance_id_24590,neo4jlabs_demo_db_recommendations
"What is the average number of favorites for tweets that mention a user who follows ""Neo4j"" and contain a link to a specific domain that has been shared by a user who has a similarity score greater than 0.7 with them?","MATCH (n:User {screen_name: ""Neo4j""}) <-[:FOLLOWS]-(follower:User) <-[:MENTIONS]-(tweet:Tweet) MATCH (tweet)-[:POSTS]-(tweeter:User)-[s:SIMILAR_TO]-(similarUser:User) WHERE s.score > 0.7 MATCH (similarUser)-[:POSTS]-(domainTweet:Tweet)-[:CONTAINS]->(link:Link) WHERE link.url CONTAINS 'your_specific_domain' WITH avg(tweet.favorites) AS averageFavorites RETURN averageFavorites",neo4jLabs_synthetic_gemini,instance_id_34693,neo4jlabs_demo_db_twitter
Which 3 orders have the largest quantity of a single product ordered?,"MATCH (o:Order)-[r:ORDERS]->(p:Product) RETURN o.orderID AS orderID, r.quantity AS quantity ORDER BY r.quantity DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45378,neo4jlabs_demo_db_northwind
