question,cypher,data_source,instance_id,database_reference_alias
List the first 3 dependencies of the application 'webserver'.,MATCH (app:Application {name: 'webserver'})-[:DEPENDS_ON]->(dependency) RETURN dependency LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20890,neo4jlabs_demo_db_network
What are the closed dates for entities that have a jurisdiction of SAM?,"MATCH (e:Entity {jurisdiction: 'SAM'}) WHERE e.closed_date IS NOT NULL RETURN e.name, e.closed_date",neo4jLabs_synthetic_gpt4turbo,instance_id_21226,neo4jlabs_demo_db_offshoreleaks
Which 3 filings have the most significant difference in latitude between originator and beneficiary banks?,"MATCH (f:Filing) WITH f,       toFloat(f.origin_lat) AS origin_lat,       toFloat(f.beneficiary_lat) AS beneficiary_lat,       abs(toFloat(f.origin_lat) - toFloat(f.beneficiary_lat)) AS lat_diff ORDER BY lat_diff DESC LIMIT 3 RETURN f.sar_id AS filing_id, f.originator_bank AS originator_bank, f.beneficiary_bank AS beneficiary_bank, lat_diff",neo4jLabs_synthetic_gpt4o,instance_id_41816,neo4jlabs_demo_db_fincen
Which Racks are in zone 2 of DataCenter 'DC1'?,MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(r:Rack {zone: 2}) RETURN r,neo4jLabs_synthetic_gpt4turbo,instance_id_20862,neo4jlabs_demo_db_network
Show the top 5 oldest movies that have been rated by at least 5 different users.,"MATCH (m:Movie)<-[:RATED]-(u:User) WITH m, count(DISTINCT u) AS userCount WHERE userCount >= 5 RETURN m ORDER BY m.year ASC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_24577,neo4jlabs_demo_db_recommendations
List the names of movies that have a plot mentioning 'friendship'.,MATCH (m:Movie) WHERE m.plot CONTAINS 'friendship' RETURN m.title,neo4jLabs_synthetic_gpt4turbo,instance_id_24757,neo4jlabs_demo_db_recommendations
Show the top 5 tweets by 'neo4j' that have been retweeted and tag a hashtag.,"MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet)-[:RETWEETS]->(rt:Tweet),       (t)-[:TAGS]->(h:Hashtag) RETURN t, rt, h ORDER BY t.favorites DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_24206,neo4jlabs_demo_db_twitter
List the top 3 actors born in the 1980s.,"MATCH (a:Actor) WHERE a.born >= date('1980-01-01') AND a.born < date('1990-01-01') RETURN a.name, a.born ORDER BY a.born LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42432,neo4jlabs_demo_db_recommendations
List the first 3 products that have been reordered (units on order > 0) and are not discontinued.,MATCH (p:Product) WHERE p.unitsOnOrder > 0 AND p.discontinued = FALSE RETURN p LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20542,neo4jlabs_demo_db_northwind
"Which 3 filings have the largest amounts and were filed between January 1, 2010, and December 31, 2015?",MATCH (f:Filing) WHERE f.begin >= datetime('2010-01-01T00:00:00Z') AND f.end <= datetime('2015-12-31T23:59:59Z') RETURN f ORDER BY f.amount DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_22814,neo4jlabs_demo_db_fincen
Who are the top 3 customers by number of orders placed in 1996?,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE o.orderDate STARTS WITH '1996' WITH c, COUNT(o) AS orderCount ORDER BY orderCount DESC LIMIT 3 RETURN c.customerID, c.companyName, orderCount",neo4jLabs_synthetic_gpt4o,instance_id_44018,neo4jlabs_demo_db_northwind
List all entities that have filed more than 10 filings.,"MATCH (e:Entity)-[:FILED]->(f:Filing) WITH e, count(f) AS filingsCount WHERE filingsCount > 10 RETURN e",neo4jLabs_synthetic_gpt4turbo,instance_id_22861,neo4jlabs_demo_db_fincen
What is the average unit price of products in the 'Condiments' category?,MATCH (c:Category {categoryName: 'Condiments'})<-[:PART_OF]-(p:Product) WITH avg(p.unitPrice) AS averagePrice RETURN averagePrice,neo4jLabs_synthetic_gemini,instance_id_32089,neo4jlabs_demo_db_northwind
"""Tom Cruise의 영화는 모두 몇 편인가?""","MATCH (:Actor {name: ""Tom Cruise""})-[:ACTED_IN]->(m:Movie) RETURN COUNT(m) AS NumberOfMovies",neo4j_crowdsourced,instance_id_27799,neo4jlabs_demo_db_recommendations
List the top 5 longest running adult films.,"MATCH (a:Adult) RETURN a.title, a.runtime ORDER BY a.runtime DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44253,neo4jlabs_demo_db_eoflix
List the first 5 movies that have been tagged with 'based on novel'.,MATCH (m:Movie)-[:HAS_KEYWORD]->(k:Keyword {name: 'based on novel'}) RETURN m LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23499,neo4jlabs_demo_db_eoflix
What is the maximum amount filed between 2012-01-01T00:00:00Z and 2012-12-31T00:00:00Z?,MATCH (f:Filing) WHERE f.begin >= datetime('2012-01-01T00:00:00Z') AND f.begin <= datetime('2012-12-31T00:00:00Z') WITH max(f.amount) as max_amount RETURN max_amount,neo4jLabs_synthetic_gemini,instance_id_28993,neo4jlabs_demo_db_fincen
Which orders were shipped by ship via option '1'?,"MATCH (o:Order)-[:ORDERS]->(p:Product) WHERE o.shipVia = '1' RETURN o.orderID, o.shipName, o.shippedDate, o.shipCity",neo4jLabs_synthetic_gpt4turbo,instance_id_21792,neo4jlabs_demo_db_northwind
"Which actors have starred in movies with both ""jealousy"" and ""family"" keywords?","MATCH (jealousy:Keyword {name: ""jealousy""})<-[:HAS_KEYWORD]-(movieJ:Movie) MATCH (family:Keyword {name: ""family""})<-[:HAS_KEYWORD]-(movieF:Movie) WITH collect(DISTINCT movieJ.id) AS jealousyMovies, collect(DISTINCT movieF.id) AS familyMovies MATCH (actor:Person)-[:CAST_FOR]->(m) WHERE m.id IN jealousyMovies AND m.id IN familyMovies RETURN DISTINCT actor.name",neo4jLabs_synthetic_gemini,instance_id_32009,neo4jlabs_demo_db_eoflix
"What is the 'port' number used by the 'Application' with 'name' ""webserver""?",MATCH (app:Application {name: 'webserver'})-[:LISTENS]->(port:Port) RETURN port.port,neo4jLabs_synthetic_gemini,instance_id_31593,neo4jlabs_demo_db_network
Identify the first 3 games played by streams that have at least 5000 followers.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WHERE s.followers >= 5000 RETURN g.name AS game_name, s.name AS stream_name, s.followers ORDER BY s.createdAt LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43309,neo4jlabs_demo_db_twitch
"What are the names of the production companies that produced the movie ""Toy Story""?","MATCH (m:Movie {title: ""Toy Story""})-[:PRODUCED_BY]->(p:ProductionCompany) RETURN p.name",neo4jLabs_synthetic_gemini,instance_id_34652,neo4jlabs_demo_db_eoflix
List the top 5 most recent tweets based on the 'created_at' date.,MATCH (t:Tweet) RETURN t ORDER BY t.created_at DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24989,neo4jlabs_demo_db_twitter
What is the average start time of all applications running on machines in zone 2?,MATCH (m:Machine)<-[:HOLDS]-(r:Rack {zone: 2}) WITH m MATCH (m)-[:RUNS]->(a:Application) RETURN avg(a.startTime),neo4jLabs_synthetic_gemini,instance_id_31738,neo4jlabs_demo_db_network
"Which hashtags were used in tweets posted by users followed by the user with screen name ""neo4j""?",MATCH (u:User {screen_name: 'neo4j'})-[:FOLLOWS]->(followed:User) MATCH (followed)-[:POSTS]->(t:Tweet)-[:TAGS]->(h:Hashtag) RETURN DISTINCT h.name,neo4jLabs_synthetic_gemini,instance_id_34669,neo4jlabs_demo_db_twitter
"What are the names of the teams that have streams with more than 5,000 followers and have at least one moderator?",MATCH (s:Stream) WHERE s.followers > 5000 AND EXISTS ((s)-[:MODERATOR]->()) MATCH (s)-[:HAS_TEAM]->(t:Team) RETURN DISTINCT t.name,neo4jLabs_synthetic_gemini,instance_id_34097,neo4jlabs_demo_db_twitch
Which actor has the highest average rating for their movies?,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)<-[r:RATED]-(u:User) WITH a, avg(r.rating) AS averageRating RETURN a.name, averageRating ORDER BY averageRating DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29832,neo4jlabs_demo_db_recommendations
List the sources used in tweets that mention users with a high 'betweenness' centrality score and a high 'followers' count.,MATCH (t:Tweet)-[:MENTIONS]->(u:User) WHERE u.betweenness > 100000 AND u.followers > 10000 WITH DISTINCT t MATCH (t)-[:USING]->(s:Source) RETURN s.name,neo4jLabs_synthetic_gemini,instance_id_33845,neo4jlabs_demo_db_twitter
List the first 3 services listening on port 80.,MATCH (s:Service)-[:LISTENS]->(p:Port {port: 80}) RETURN s.name LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43695,neo4jlabs_demo_db_network
List the top 3 movies with the most revenue that have a runtime under 90 minutes.,"MATCH (m:Movie) WHERE m.runtime < 90 RETURN m.title, m.revenue ORDER BY m.revenue DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42710,neo4jlabs_demo_db_recommendations
What are the names of the top 3 originator banks that have initiated filings with the most distinct beneficiary banks?,"MATCH (f:Filing)-[:ORIGINATOR]->(originator:Entity) WITH originator, count(DISTINCT f.beneficiary_bank) AS distinct_beneficiaries ORDER BY distinct_beneficiaries DESC LIMIT 3 RETURN originator.name AS OriginatorBankName, distinct_beneficiaries",neo4jLabs_synthetic_gpt4turbo,instance_id_21446,neo4jlabs_demo_db_fincen
List the filings where the amount is greater than 500000 and the originator entity is located in a different country than the beneficiary entity.,MATCH (f:Filing) WHERE f.amount > 500000 MATCH (f)-[:ORIGINATOR]->(org:Entity)-[:COUNTRY]->(originCountry:Country) MATCH (f)-[:BENEFITS]->(ben:Entity)-[:COUNTRY]->(beneficiaryCountry:Country) WHERE originCountry.code <> beneficiaryCountry.code RETURN f.id,neo4jLabs_synthetic_gemini,instance_id_28074,neo4jlabs_demo_db_fincen
Which movies have been reviewed with a rating exactly at 75?,"MATCH (m:Movie)<-[:REVIEWED {rating: 75}]-(p:Person) RETURN m.title AS MovieTitle, p.name AS ReviewerName",neo4jLabs_synthetic_gpt4turbo,instance_id_23362,neo4jlabs_demo_db_movies
What are the `countries` associated with the officer of the entity with `ibcRUC` '24138'?,MATCH (e:Entity {ibcRUC: '24138'})-[:officer_of]-(o:Officer) RETURN DISTINCT o.countries,neo4jLabs_synthetic_gemini,instance_id_30513,neo4jlabs_demo_db_offshoreleaks
"""How many directors did Tom Hanks work with and list their names and sort them by movie name""","MATCH (tom:Person {name: ""Tom Hanks""})-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(director:Person) RETURN director.name, m.title ORDER BY m.title",neo4j_crowdsourced,instance_id_27381,neo4jlabs_demo_db_movies
What is the most common company_type for entities that have been struck off?,"MATCH (e:Entity) WHERE e.struck_off_date IS NOT NULL WITH e.company_type AS company_type, count(*) AS count ORDER BY count DESC LIMIT 1 RETURN company_type",neo4jLabs_synthetic_gemini,instance_id_30608,neo4jlabs_demo_db_offshoreleaks
Show the top 5 entities sorted by their node_id.,MATCH (e:Entity) RETURN e ORDER BY e.node_id DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21206,neo4jlabs_demo_db_offshoreleaks
List all movies reviewed by people born after 1960.,MATCH (p:Person)-[:REVIEWED]->(m:Movie) WHERE p.born > 1960 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_23936,neo4jlabs_demo_db_movies
What are the names of the top 3 entities that have filings with an originator iso code of 'SGP'?,"MATCH (e:Entity)-[:FILED]->(f:Filing) WHERE f.originator_iso = 'SGP' RETURN e.name, COUNT(f) AS filing_count ORDER BY filing_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41108,neo4jlabs_demo_db_fincen
Find all products with a 'unitsOnOrder' of 0 and a 'reorderLevel' above 10.,MATCH (p:Product) WHERE p.unitsOnOrder = 0 AND p.reorderLevel > 10 RETURN p,neo4jLabs_synthetic_gpt4turbo,instance_id_21801,neo4jlabs_demo_db_northwind
"What is the most common keyword associated with movies in the ""Action"" genre?","MATCH (g:Genre {name: ""Action""}) MATCH (g)<-[:IN_GENRE]-(m:Movie)-[:HAS_KEYWORD]->(k:Keyword) WITH k, count(m) AS movieCount ORDER BY movieCount DESC RETURN k.name AS mostCommonKeyword, movieCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_31989,neo4jlabs_demo_db_eoflix
"Which streams have more than 100,000 followers and play ""Apex Legends""?","MATCH (s:Stream)-[:PLAYS]->(g:Game {name: ""Apex Legends""}) WHERE s.followers > 100000 RETURN s.name",neo4jLabs_synthetic_gemini,instance_id_34020,neo4jlabs_demo_db_twitch
"""List top ten movies""","MATCH (m:Movie) RETURN m.title, m.votes ORDER BY m.votes DESC LIMIT 10",neo4j_crowdsourced,instance_id_27383,neo4jlabs_demo_db_movies
Which 5 filings have entities from more than one country as originators?,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country) WITH f, collect(DISTINCT c.code) AS countries WHERE size(countries) > 1 RETURN f.id AS filing_id, countries ORDER BY f.begin LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41386,neo4jlabs_demo_db_fincen
"Identify the first 3 teams that are linked to streams with over 10,000 followers.",MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WHERE s.followers > 10000 RETURN t LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24538,neo4jlabs_demo_db_twitch
Name the first 3 types of machines held in Rack 'DC1-RCK-1-1'.,MATCH (r:Rack {name: 'DC1-RCK-1-1'})-[:HOLDS]->(m:Machine)-[:TYPE]->(t:Type) RETURN t.type LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20957,neo4jlabs_demo_db_network
List all products that have a unit price greater than the average unit price of products supplied by supplier '1' and have a reorder level less than 10.,MATCH (s:Supplier {supplierID: '1'})-[:SUPPLIES]->(p:Product) WITH avg(p.unitPrice) AS avg_price MATCH (p:Product) WHERE p.unitPrice > avg_price AND p.reorderLevel < 10 RETURN p.productName,neo4jLabs_synthetic_gemini,instance_id_32516,neo4jlabs_demo_db_northwind
"What are the IDs of the filings filed by the entity with ID ""the-bank-of-new-york-mellon-corp""?","MATCH (e:Entity {id: ""the-bank-of-new-york-mellon-corp""})-[r:FILED]->(f:Filing) RETURN f.id",neo4jLabs_synthetic_gemini,instance_id_28998,neo4jlabs_demo_db_fincen
Which person has acted in the most movies with a different genre? (Note: Genre information is not available in the provided schema. This question is for demonstration purposes only),"MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WITH p, count(m) AS movieCount RETURN p.name AS personName, movieCount ORDER BY movieCount DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32612,neo4jlabs_demo_db_movies
What are the filings with a beneficiary bank from 'Singapore' and an amount over 300000?,MATCH (f:Filing) WHERE f.beneficiary_bank_country = 'Singapore' AND f.amount > 300000 RETURN f,neo4jLabs_synthetic_gpt4turbo,instance_id_22830,neo4jlabs_demo_db_fincen
List all entities that share the same name as officer with node_id 12000001.,MATCH (o:Officer {node_id: 12000001})-[:same_name_as]->(e:Entity) RETURN e,neo4jLabs_synthetic_gpt4turbo,instance_id_21312,neo4jlabs_demo_db_offshoreleaks
List the movies that have grossed over 1 billion USD in revenue.,MATCH (m:Movie) WHERE m.revenue > 1000000000 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_24598,neo4jlabs_demo_db_recommendations
Find the movies released between 1990 and 2000 with more than 1000 votes.,MATCH (m:Movie) WHERE m.released >= 1990 AND m.released <= 2000 AND m.votes > 1000 RETURN m,neo4jLabs_synthetic_gemini,instance_id_32823,neo4jlabs_demo_db_movies
List the top 5 oldest teams based on the 'createdAt' property.,MATCH (t:Team) RETURN t ORDER BY t.createdAt ASC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24554,neo4jlabs_demo_db_twitch
Display the first 5 processes running on machine 'DC1-RCK-1-1-M-1' with PID greater than 5000.,MATCH (m:Machine {name: 'DC1-RCK-1-1-M-1'})-[:RUNS]->(p:Process) WHERE p.pid > 5000 RETURN p LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_20166,neo4jlabs_demo_db_network
List the first 3 directors who have directed a movie with a runtime over 180 minutes.,MATCH (d:Director)-[:DIRECTED]->(m:Movie) WHERE m.runtime > 180 RETURN d LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_25229,neo4jlabs_demo_db_recommendations
What are the different job titles in the movie industry?,MATCH (:Movie)<-[c:CREW_FOR]-() RETURN DISTINCT c.job,neo4jLabs_synthetic_gemini,instance_id_34601,neo4jlabs_demo_db_eoflix
Which users have a 'SIMILAR_TO' relationship with users who have a high 'betweenness' centrality score?,MATCH (u1:User)-[:SIMILAR_TO]->(u2:User) WHERE u2.betweenness > 0.5 RETURN DISTINCT u1.screen_name,neo4jLabs_synthetic_gemini,instance_id_33856,neo4jlabs_demo_db_twitter
List the first 3 users who are moderators for streams playing 'Rust'.,MATCH (u:User)-[:MODERATOR]->(s:Stream)-[:PLAYS]->(g:Game {name: 'Rust'}) RETURN u LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24527,neo4jlabs_demo_db_twitch
"List the countries with entities that originated filings where the beneficiary entity's name contains ""Inc."".",MATCH (f:Filing)-[:BENEFITS]->(b:Entity) WHERE b.name CONTAINS 'Inc.' MATCH (f)-[:ORIGINATOR]->(o:Entity) MATCH (o)-[:COUNTRY]->(c:Country) RETURN DISTINCT c.name,neo4jLabs_synthetic_gemini,instance_id_28085,neo4jlabs_demo_db_fincen
List the names of the streams that have at least one moderator.,MATCH (s:Stream)<-[:MODERATOR]-() RETURN DISTINCT s.name,neo4jLabs_synthetic_gemini,instance_id_34001,neo4jlabs_demo_db_twitch
What are the top 5 most frequently ordered products in the 'Grains/Cereals' category?,"MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Grains/Cereals'}) WITH p, count{(p)<-[:ORDERS]-()} AS ordersCount ORDER BY ordersCount DESC LIMIT 5 RETURN p.productName, ordersCount",neo4jLabs_synthetic_gpt4turbo,instance_id_21737,neo4jlabs_demo_db_northwind
Find all actors who have acted in more than one movie with an IMDb rating over 7.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.imdbRating > 7 WITH a, COUNT(m) AS movieCount WHERE movieCount > 1 RETURN a.name AS actorName, movieCount",neo4jLabs_synthetic_gpt4o,instance_id_42652,neo4jlabs_demo_db_recommendations
List the first 3 categories that have a product with a unit price of less than 10.,MATCH (p:Product)-[:PART_OF]->(c:Category) WHERE p.unitPrice < 10 RETURN DISTINCT c.categoryName LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_45024,neo4jlabs_demo_db_northwind
List the top 5 movies that have a poster path available.,MATCH (m:Movie) WHERE m.poster_path IS NOT NULL RETURN m ORDER BY m.id ASC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23426,neo4jlabs_demo_db_eoflix
List the first 3 movies that have been translated into the language 'Kiswahili'.,MATCH (m:Movie)-[:SPOKEN_IN_LANGUAGE]->(l:Language {name: 'Kiswahili'}) RETURN m.title ORDER BY m.release_date LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_44396,neo4jlabs_demo_db_eoflix
List the 3 most recent movies in the 'Toy Story Collection'.,MATCH (m:Movie)-[:IN_COLLECTION]->(c:Collection {name: 'Toy Story Collection'}) RETURN m ORDER BY m.release_date DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20842,neo4jlabs_demo_db_eoflix
"Find all movies that share the same genre as ""Toy Story"" (first 5).",MATCH (toyStory:Movie { title: 'Toy Story' })-[:IN_GENRE]->(genre:Genre) MATCH (genre)<-[:IN_GENRE]->(otherMovie:Movie) WHERE otherMovie.title <> 'Toy Story' RETURN DISTINCT otherMovie.title LIMIT 5,neo4jLabs_synthetic_gemini,instance_id_31817,neo4jlabs_demo_db_eoflix
Find the top 5 customers based in Germany.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE c.country = 'Germany' RETURN c.companyName AS customerName, COUNT(o) AS orderCount ORDER BY orderCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44674,neo4jlabs_demo_db_northwind
Identify the top 5 tweets with texts containing the word 'education'.,MATCH (t:Tweet) WHERE t.text CONTAINS 'education' RETURN t ORDER BY t.favorites DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24802,neo4jlabs_demo_db_twitter
List the top 5 products with discontinued status and a reorder level above 5.,MATCH (p:Product) WHERE p.discontinued = TRUE AND p.reorderLevel > 5 RETURN p ORDER BY p.reorderLevel DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21865,neo4jlabs_demo_db_northwind
List the top 5 movies with the longest runtime.,"MATCH (m:Movie) RETURN m.title, m.runtime ORDER BY m.runtime DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44442,neo4jlabs_demo_db_eoflix
Find all the officers who are named 'KIM SOO IN'.,MATCH (o:Officer) WHERE o.name = 'KIM SOO IN' RETURN o,neo4jLabs_synthetic_gpt4o,instance_id_44926,neo4jlabs_demo_db_offshoreleaks
"List the names of the first 3 Entities with the service provider ""Mossack Fonseca"".","MATCH (e:Entity {service_provider: ""Mossack Fonseca""}) RETURN e.name LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_30752,neo4jlabs_demo_db_offshoreleaks
List the first 3 actors who have acted in a movie with a budget over 50 million USD.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.budget > 50000000 RETURN a.name, a.url LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25055,neo4jlabs_demo_db_recommendations
Which entities are both originators and beneficiaries of filings?,MATCH (f:Filing)-[:ORIGINATOR]->(originator:Entity) MATCH (f)-[:BENEFITS]->(beneficiary:Entity) WHERE originator = beneficiary RETURN DISTINCT originator.name,neo4jLabs_synthetic_gemini,instance_id_28090,neo4jlabs_demo_db_fincen
List the routers in 'DC1' DataCenter.,MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(r:Router) RETURN r.name,neo4jLabs_synthetic_gpt4turbo,instance_id_20978,neo4jlabs_demo_db_network
What is the average runtime of movies based on Norse mythology?,MATCH (m:Movie) WHERE toLower(m.plot) CONTAINS 'norse mythology' RETURN avg(m.runtime) AS average_runtime,neo4jLabs_synthetic_gemini,instance_id_29387,neo4jlabs_demo_db_recommendations
"What is the average amount of filings where the beneficiary entity is located in the same country as ""The Bank of New York Mellon Corp.""?","MATCH (e1:Entity {name: ""The Bank of New York Mellon Corp.""})-[:COUNTRY]->(c:Country) WITH c MATCH (f:Filing)-[:BENEFITS]->(e2:Entity)-[:COUNTRY]->(c) RETURN avg(f.amount)",neo4jLabs_synthetic_gemini,instance_id_28270,neo4jlabs_demo_db_fincen
Which machines are running the application 'logstash'?,MATCH (app:Application {name: 'logstash'})<-[:RUNS]-(machine:Machine) RETURN machine.name,neo4jLabs_synthetic_gemini,instance_id_31679,neo4jlabs_demo_db_network
List the 3 streams with the most distinct teams associated.,"MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WITH s, count(DISTINCT t) AS teamCount ORDER BY teamCount DESC LIMIT 3 RETURN s.id AS StreamID, s.name AS StreamName, teamCount",neo4jLabs_synthetic_gpt4turbo,instance_id_25440,neo4jlabs_demo_db_twitch
List all movies where the main actor is also the director.,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie), (p)-[:DIRECTED]->(m) RETURN m.title AS MovieTitle, p.name AS PersonName",neo4jLabs_synthetic_gpt4turbo,instance_id_25213,neo4jlabs_demo_db_recommendations
"List the distinct 'originator_bank_id' values for filings where the 'beneficiary_bank_id' is ""barclays-bank-plc-london-england-gbr"".","MATCH (f:Filing) WHERE f.beneficiary_bank_id = ""barclays-bank-plc-london-england-gbr"" WITH DISTINCT f.originator_bank_id AS originatorId RETURN originatorId",neo4jLabs_synthetic_gemini,instance_id_29222,neo4jlabs_demo_db_fincen
What is the average `discount` applied to orders placed by customers from 'Germany'?,MATCH (c:Customer {country: 'Germany'})-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) WITH avg(toFloat(o.discount)) AS avg_discount RETURN avg_discount,neo4jLabs_synthetic_gemini,instance_id_32104,neo4jlabs_demo_db_northwind
Identify the first 3 networks routing through interface with IP '10.0.0.254'.,MATCH (n:Network)-[:ROUTES]->(i:Interface {ip: '10.0.0.254'}) RETURN n LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20175,neo4jlabs_demo_db_network
How many customers have a `fax` number listed?,MATCH (c:Customer) WHERE c.fax IS NOT NULL RETURN count(DISTINCT c) AS numCustomersWithFax,neo4jLabs_synthetic_gemini,instance_id_32177,neo4jlabs_demo_db_northwind
List the first 3 racks by name that contain switches.,MATCH (rack:Rack)-[:HOLDS]->(:Switch) RETURN rack.name ORDER BY rack.name LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43936,neo4jlabs_demo_db_network
List the first 5 categories that have products supplied by 'Exotic Liquids'.,MATCH (s:Supplier {companyName: 'Exotic Liquids'})-[:SUPPLIES]->(p:Product)-[:PART_OF]->(c:Category) RETURN DISTINCT c.categoryName LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_44671,neo4jlabs_demo_db_northwind
Which actors have acted in both high-budget (over 200 million dollars) and low-budget (under 10 million dollars) movies?,"MATCH (actor:Actor)-[:ACTED_IN]->(highBudgetMovie:Movie) WHERE highBudgetMovie.budget > 200000000 WITH actor, highBudgetMovie MATCH (actor)-[:ACTED_IN]->(lowBudgetMovie:Movie) WHERE lowBudgetMovie.budget < 10000000 RETURN DISTINCT actor.name",neo4jLabs_synthetic_gpt4o,instance_id_42796,neo4jlabs_demo_db_recommendations
Find the entities with a `registered_address` relationship to an address in Samoa.,"MATCH (e:Entity)-[r:registered_address]->(a:Address) WHERE a.countries = ""Samoa"" RETURN e",neo4jLabs_synthetic_gemini,instance_id_30499,neo4jlabs_demo_db_offshoreleaks
List the top 5 most expensive products that are not discontinued.,"MATCH (p:Product) WHERE p.discontinued = false RETURN p.productName, p.unitPrice ORDER BY p.unitPrice DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_45346,neo4jlabs_demo_db_northwind
List the first 3 genres that are accessed by the 'Ultimate' package.,MATCH (p:Package {name: 'Ultimate'})-[:PROVIDES_ACCESS_TO]->(g:Genre) RETURN g LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20836,neo4jlabs_demo_db_eoflix
Identify the top 5 users who have exactly 663 followers.,MATCH (u:User) WHERE u.followers = 663 RETURN u ORDER BY u.betweenness DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24228,neo4jlabs_demo_db_twitter
List all users who have rated more than 50 movies.,"MATCH (u:User)-[r:RATED]->(m:Movie) WITH u, count(m) AS movies_rated WHERE movies_rated > 50 RETURN u",neo4jLabs_synthetic_gpt4turbo,instance_id_25315,neo4jlabs_demo_db_recommendations
What is the average lastEditTimestamp for all Entities?,MATCH (e:Entity) WITH avg(toFloat(e.lastEditTimestamp)) AS average_timestamp RETURN average_timestamp,neo4jLabs_synthetic_gemini,instance_id_30743,neo4jlabs_demo_db_offshoreleaks
"What is the name of the stream with the most followers that plays ""Rust""?","MATCH (s:Stream)-[:PLAYS]->(g:Game {name: 'Rust'}) RETURN s.name AS stream_name, max(s.followers) AS max_followers",neo4jLabs_synthetic_gemini,instance_id_33961,neo4jlabs_demo_db_twitch
Find the movie with the longest runtime that was released before 1980.,"MATCH (m:Movie) WHERE m.released < 1980 RETURN m {title: m.title, runtime: m.runtime} ORDER BY m.runtime DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32961,neo4jlabs_demo_db_movies
"""Name an officer for each of the five companies that are located in Hong Kong""","MATCH (e:Entity)-[:registered_address]->(a:Address {country_codes: 'HKG'}), (o:Officer)-[:officer_of]->(e) RETURN e.name AS CompanyName, o.name AS OfficerName LIMIT 5",neo4j_crowdsourced,instance_id_27783,neo4jlabs_demo_db_offshoreleaks
List the first 3 processes dependent on the service named 'java'.,MATCH (s:Service {name: 'java'})<-[:DEPENDS_ON]-(p:Process) RETURN p LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20923,neo4jlabs_demo_db_network
Identify the 3 suppliers from the city 'London' who supply the most products.,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE s.city = 'London' RETURN s.companyName, count(p) AS NumberOfProductsSupplied ORDER BY NumberOfProductsSupplied DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21915,neo4jlabs_demo_db_northwind
List the first 3 tweets retweeted by users located in 'Graphs Are Everywhere'.,MATCH (u:User {location: 'Graphs Are Everywhere'})-[:POSTS]->(t:Tweet)-[:RETWEETS]->(rt:Tweet) RETURN rt LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24958,neo4jlabs_demo_db_twitter
List the top 5 tweets that have been retweeted the most times.,"MATCH (t:Tweet) RETURN t.text AS tweet_text, t.id AS tweet_id, t.favorites AS retweet_count ORDER BY t.favorites DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43109,neo4jlabs_demo_db_twitter
What are the names of the Software dependencies of the Application named 'crm'?,MATCH (app:Application {name: 'crm'})-[:INSTANCE]->(software:Software)-[:DEPENDS_ON]->(dependency) RETURN DISTINCT dependency.name AS dependency_name,neo4jLabs_synthetic_gemini,instance_id_32436,neo4jlabs_demo_db_network
Show all tweets that mention 'Neo4j' and contain a link.,"MATCH (t:Tweet)-[:MENTIONS]->(u:User {name: 'Neo4j'}), (t)-[:CONTAINS]->(l:Link) RETURN t.id_str AS tweet_id, t.text AS tweet_text, l.url AS link_url",neo4jLabs_synthetic_gpt4o,instance_id_42983,neo4jlabs_demo_db_twitter
List the top 5 streams that have chatters with more than 5000 followers.,"MATCH (s:Stream)<-[:CHATTER]-(u:User) WHERE u.followers > 5000 RETURN s.name, s.followers ORDER BY s.followers DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43629,neo4jlabs_demo_db_twitch
Find the streams that have more VIPs than moderators.,"MATCH (stream:Stream)-[:VIP]->(vip) WITH stream, count(vip) AS vipCount MATCH (stream)-[:MODERATOR]->(moderator) WITH stream, vipCount, count(moderator) AS moderatorCount WHERE vipCount > moderatorCount RETURN stream.name",neo4jLabs_synthetic_gemini,instance_id_33983,neo4jlabs_demo_db_twitch
List the top 3 movies with the least votes.,MATCH (m:Movie) WHERE m.votes IS NOT NULL RETURN m ORDER BY m.votes ASC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23968,neo4jlabs_demo_db_movies
"List the actors who have acted in both ""Boxtrolls, The"" and ""Open Season"".","MATCH (movie1:Movie {title: ""Boxtrolls, The""}) MATCH (movie2:Movie {title: ""Open Season""}) MATCH (movie1)<-[:ACTED_IN]-(actor1:Actor) MATCH (movie2)<-[:ACTED_IN]-(actor2:Actor) WITH collect(actor1.name) AS actors1, collect(actor2.name) AS actors2 RETURN apoc.coll.intersection(actors1, actors2) AS commonActors",neo4jLabs_synthetic_gemini,instance_id_29703,neo4jlabs_demo_db_recommendations
What are the first 3 services that depend on the version '7.1'?,MATCH (v:Version {name: '7.1'})<-[:INSTANCE]-(s:Service) RETURN s LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20964,neo4jlabs_demo_db_network
"List the movies that have a higher popularity score than ""Toy Story"".","MATCH (m:Movie {title: ""Toy Story""}) WITH m.popularity AS toyStoryPopularity MATCH (m2:Movie) WHERE m2.popularity > toyStoryPopularity RETURN m2.title AS movieTitle",neo4jLabs_synthetic_gemini,instance_id_31838,neo4jlabs_demo_db_eoflix
"Which streams have ""Dota 2"" as a played game?","MATCH (g:Game {name: ""Dota 2""})<-[:PLAYS]-(s:Stream) RETURN s.name",neo4jLabs_synthetic_gemini,instance_id_32608,neo4jlabs_demo_db_twitch
List the top 5 streams by number of games played.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WITH s, COUNT(g) AS gameCount ORDER BY gameCount DESC LIMIT 5 RETURN s.name AS streamName, gameCount",neo4jLabs_synthetic_gpt4o,instance_id_43334,neo4jlabs_demo_db_twitch
List the first 3 countries by the number of filings they have as a beneficiary in transactions involving multiple currencies.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE f.originator_iso IS NOT NULL AND f.beneficiary_iso IS NOT NULL AND f.originator_iso <> f.beneficiary_iso WITH c, COUNT(f) AS filingsCount ORDER BY filingsCount DESC RETURN c.name AS CountryName, filingsCount LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21552,neo4jlabs_demo_db_fincen
Who are the top 5 users interacting with 'Neo4j'?,"MATCH (me:Me {screen_name: 'neo4j'})-[:INTERACTS_WITH]->(user:User) RETURN user.name, COUNT(*) AS interactions ORDER BY interactions DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43049,neo4jlabs_demo_db_twitter
List all entities with jurisdiction description of Samoa.,"MATCH (e:Entity) WHERE e.jurisdiction_description = ""Samoa"" RETURN e.name, e.jurisdiction_description",neo4jLabs_synthetic_gpt4o,instance_id_42525,neo4jlabs_demo_db_offshoreleaks
"What is the last edit timestamp for the Officer with name ""MOSSFON SUBSCRIBERS LTD.""?",MATCH (o:Officer {name: 'MOSSFON SUBSCRIBERS LTD.'}) RETURN o.lastEditTimestamp,neo4jLabs_synthetic_gemini,instance_id_30670,neo4jlabs_demo_db_offshoreleaks
