question,cypher,data_source,instance_id,database_reference_alias
Show the first 5 movies where the production company's name includes 'Studios'.,"MATCH (m:Movie)-[:PRODUCED_BY]->(pc:ProductionCompany) WHERE pc.name CONTAINS 'Studios' RETURN m.title AS MovieTitle, pc.name AS ProductionCompanyName LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39655,neo4jlabs_demo_db_eoflix
"""How many switches does datacenter DC1 hold?""","MATCH (:DataCenter {name: ""DC1""})-[:CONTAINS]->(s:Switch) RETURN COUNT(s) AS NumberOfSwitches",neo4j_crowdsourced,instance_id_27837,neo4jlabs_demo_db_network
List all filings where the beneficiary bank is 'Barclays Bank Plc' and the amount is greater than 500000.,MATCH (f:Filing) WHERE f.beneficiary_bank = 'Barclays Bank Plc' AND f.amount > 500000 RETURN f,neo4jLabs_synthetic_gpt4turbo,instance_id_22835,neo4jlabs_demo_db_fincen
List the first 3 movies produced in the United States.,"MATCH (m:Movie)-[:PRODUCED_IN_COUNTRY]->(c:Country {id: ""US""}) RETURN m LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23540,neo4jlabs_demo_db_eoflix
Name 3 persons who have reviewed a movie and also acted in a different movie.,MATCH (p:Person)-[:REVIEWED]->(m1:Movie) WHERE exists {     (p)-[:ACTED_IN]->(m2:Movie)     WHERE m1 <> m2 } RETURN p.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24127,neo4jlabs_demo_db_movies
"Find all Intermediaries with a ""name"" containing ""LIMITED"" that are connected to Entities that share the same ""incorporation_date"" as an Entity with a ""status"" of ""Changed agent"".",MATCH (i:Intermediary) WHERE i.name CONTAINS 'LIMITED' WITH i MATCH (i)-[:intermediary_of]->(e:Entity) WHERE EXISTS {   MATCH (e1:Entity)   WHERE e1.incorporation_date = e.incorporation_date AND e1.status = 'Changed agent' } RETURN DISTINCT i,neo4jLabs_synthetic_gemini,instance_id_31396,neo4jlabs_demo_db_offshoreleaks
List all types of machines in rack 'DC1-RCK-1-1' and their disk sizes.,"MATCH (r:Rack {name: 'DC1-RCK-1-1'})-[:HOLDS]->(m:Machine)-[:TYPE]->(t:Type) RETURN t.type AS MachineType, t.disk AS DiskSize",neo4jLabs_synthetic_gpt4turbo,instance_id_20165,neo4jlabs_demo_db_network
List the first 5 addresses with a 'sourceID' property.,MATCH (a:Address) WHERE a.sourceID IS NOT NULL RETURN a.address LIMIT 5,neo4jLabs_synthetic_gemini,instance_id_30955,neo4jlabs_demo_db_offshoreleaks
Which 3 persons have the most followers?,"MATCH (p:Person)<-[:FOLLOWS]-(follower:Person) WITH p, COUNT(follower) AS followerCount ORDER BY followerCount DESC LIMIT 3 RETURN p.name AS personName, followerCount",neo4jLabs_synthetic_gpt4o,instance_id_39471,neo4jlabs_demo_db_movies
List the first 5 actors who have a tmdbId and an imdbId listed on their profile.,MATCH (a:Actor) WHERE a.tmdbId IS NOT NULL AND a.imdbId IS NOT NULL RETURN a LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24712,neo4jlabs_demo_db_recommendations
List the movies that have grossed over 1 billion USD in revenue.,"MATCH (m:Movie) WHERE m.revenue > 1000000000 RETURN m.title AS MovieTitle, m.revenue AS Revenue",neo4jLabs_synthetic_gpt4o,instance_id_42455,neo4jlabs_demo_db_recommendations
List movies with a revenue less than 20 million dollars and released before 1980.,"MATCH (m:Movie) WHERE m.revenue < 20000000 AND m.released < ""1980-01-01"" RETURN m.title AS title, m.revenue AS revenue, m.released AS released",neo4jLabs_synthetic_gpt4o,instance_id_42593,neo4jlabs_demo_db_recommendations
What is the average start time of all the Processes?,MATCH (p:Process) WITH avg(p.startTime) AS averageStartTime RETURN averageStartTime,neo4jLabs_synthetic_gemini,instance_id_32372,neo4jlabs_demo_db_network
Which 3 categories have the most products with a reorder level above 15?,"MATCH (p:Product)-[:PART_OF]->(c:Category) WHERE p.reorderLevel > 15 RETURN c.categoryName, COUNT(p) AS productCount ORDER BY productCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44522,neo4jlabs_demo_db_northwind
"Find the movie with the highest rating that does not have the word ""movie"" in its review summary.","MATCH (m:Movie)<-[r:REVIEWED]-(p:Person) WHERE NOT toLower(r.summary) CONTAINS ""movie"" WITH max(r.rating) as maxRating MATCH (m:Movie)<-[r:REVIEWED]-(p:Person) WHERE r.rating = maxRating RETURN m.title, r.rating",neo4jLabs_synthetic_gemini,instance_id_32667,neo4jlabs_demo_db_movies
How many different types of disks are there for machine types?,MATCH (t:Type) RETURN count(DISTINCT t.disk) AS numberOfDiskTypes,neo4jLabs_synthetic_gpt4o,instance_id_43790,neo4jlabs_demo_db_network
Identify the first 3 users who have rated movies released before 1980.,"MATCH (u:User)-[r:RATED]->(m:Movie) WHERE m.released < ""1980-01-01"" RETURN u ORDER BY r.timestamp LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24661,neo4jlabs_demo_db_recommendations
List the first 3 directors born in the USA.,"MATCH (d:Director) WHERE d.bornIn = ""USA"" RETURN d LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25010,neo4jlabs_demo_db_recommendations
What are the first 3 videos that have been rated higher than 8.0?,"MATCH (v:Video)-[r:RATED]->(u:User) WHERE r.rating > 8.0 RETURN v.title, v.release_date, r.rating ORDER BY r.rating DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23488,neo4jlabs_demo_db_eoflix
Find streams that have a follower count between 1000 and 5000.,"MATCH (s:Stream) WHERE s.followers >= 1000 AND s.followers <= 5000 RETURN s.id, s.name, s.followers, s.url",neo4jLabs_synthetic_gpt4o,instance_id_42952,neo4jlabs_demo_db_twitch
What are the IP addresses of switches located in rack number 5?,MATCH (r:Rack {rack: 5})-[:HOLDS]->(s:Switch) RETURN s.ip AS SwitchIP,neo4jLabs_synthetic_gpt4turbo,instance_id_20934,neo4jlabs_demo_db_network
Which users have rated more than 50 movies?,"MATCH (u:User)-[r:RATED]->(m:Movie) WITH u, COUNT(r) AS ratedMovies WHERE ratedMovies > 50 RETURN u.userId, u.name, ratedMovies",neo4jLabs_synthetic_gpt4o,instance_id_42150,neo4jlabs_demo_db_recommendations
What is the text of the tweet with the most favorites that mentions Neo4j?,MATCH (t:Tweet)-[:MENTIONS]->(u:User {screen_name: 'neo4j'}) WITH t ORDER BY t.favorites DESC LIMIT 1 RETURN t.text,neo4jLabs_synthetic_gemini,instance_id_34471,neo4jlabs_demo_db_twitter
"What is the `inactivation_date` of the entity named ""HOTFOCUS CO., LTD.""?","MATCH (e:Entity {name: ""HOTFOCUS CO., LTD.""}) RETURN e.inactivation_date",neo4jLabs_synthetic_gemini,instance_id_30524,neo4jlabs_demo_db_offshoreleaks
"List the names of people who have produced movies with ""The"" in the title.",MATCH (m:Movie) WHERE m.title CONTAINS 'The' WITH m MATCH (p:Person)-[:PRODUCED]->(m) RETURN DISTINCT p.name,neo4jLabs_synthetic_gemini,instance_id_33108,neo4jlabs_demo_db_movies
List the suppliers that have a fax number listed.,MATCH (s:Supplier) WHERE s.fax IS NOT NULL RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_22116,neo4jlabs_demo_db_northwind
Find all tweets posted by 'Neo4j' containing a hashtag.,MATCH (u:User {name: 'Neo4j'})-[:POSTS]->(t:Tweet)-[:TAGS]->(h:Hashtag) RETURN t,neo4jLabs_synthetic_gpt4o,instance_id_42990,neo4jlabs_demo_db_twitter
Find the users who have both mentioned and been followed by 'Neo4j'.,"MATCH (neo4j:User {screen_name: 'neo4j'}) MATCH (neo4j)-[:FOLLOWS]->(followed:User) MATCH (mentioned:User)-[:POSTS]->(:Tweet)-[:MENTIONS]->(neo4j) WITH DISTINCT followed, mentioned WHERE followed = mentioned RETURN followed.screen_name AS users",neo4jLabs_synthetic_gemini,instance_id_34682,neo4jlabs_demo_db_twitter
List the top 3 directors who have also acted in a movie they directed.,"MATCH (d:Director)-[:DIRECTED]->(m:Movie) WHERE exists{(d)-[:ACTED_IN]->(m)} RETURN d.name, collect(m.title) AS movies ORDER BY size(movies) DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24663,neo4jlabs_demo_db_recommendations
Find the top 3 movies that have a runtime longer than 120 minutes.,MATCH (m:Movie) WHERE m.runtime > 120 RETURN m ORDER BY m.runtime DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21108,neo4jlabs_demo_db_eoflix
List the customers who have placed orders shipped via shipper '2'.,MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE o.shipVia = '2' RETURN DISTINCT c.companyName,neo4jLabs_synthetic_gemini,instance_id_32082,neo4jlabs_demo_db_northwind
"""list 10 movies and 10 actors""","MATCH (p:Person)-[:ACTED_IN]->(m:Movie) RETURN m.title AS Movie, collect(p.name) AS Actors LIMIT 10",neo4j_crowdsourced,instance_id_27420,neo4jlabs_demo_db_movies
"Find all Officers who have an ""officer_of"" relationship with an Entity that shares the same ""registered_address"" as an Entity linked to an Intermediary with the ""address"" value containing ""TSIM SHA TSUI"".",MATCH (i:Intermediary) WHERE i.address CONTAINS 'TSIM SHA TSUI' MATCH (i)-[:intermediary_of]->(e:Entity) MATCH (e)-[:registered_address]->(a:Address) MATCH (e2:Entity)-[:registered_address]->(a) MATCH (o:Officer)-[:officer_of]->(e2) RETURN DISTINCT o.name,neo4jLabs_synthetic_gemini,instance_id_31389,neo4jlabs_demo_db_offshoreleaks
What are the top 3 countries that have the most entities that are both originators and beneficiaries of filings?,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(originCountry:Country) MATCH (f)-[:BENEFITS]->(e)-[:COUNTRY]->(beneficiaryCountry:Country) WHERE originCountry = beneficiaryCountry WITH originCountry.name AS countryName, count(DISTINCT e) AS entityCount ORDER BY entityCount DESC LIMIT 3 RETURN countryName, entityCount",neo4jLabs_synthetic_gemini,instance_id_28206,neo4jlabs_demo_db_fincen
Which machines are running an application that listens on port 80?,MATCH (app:Application)-[:LISTENS]->(port:Port {port: 80}) WITH DISTINCT app MATCH (machine:Machine)-[:RUNS]->(app) RETURN machine.name AS machineName,neo4jLabs_synthetic_gemini,instance_id_32368,neo4jlabs_demo_db_network
"Find the officers with `countries` ""Samoa"" and `sourceID` ""Panama Papers"".","MATCH (o:Officer) WHERE o.countries = ""Samoa"" AND o.sourceID = ""Panama Papers"" RETURN o",neo4jLabs_synthetic_gemini,instance_id_30516,neo4jlabs_demo_db_offshoreleaks
List the top 5 filings where the originator bank's country and beneficiary bank's country are the same but not 'United Kingdom'.,MATCH (f:Filing) WHERE f.originator_bank_country = f.beneficiary_bank_country AND f.originator_bank_country <> 'United Kingdom' RETURN f ORDER BY f.amount DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_26821,neo4jlabs_demo_db_fincen
Identify the first 3 users who mentioned 'Neo4j' in their tweets.,MATCH (u:User)-[:POSTS]->(t:Tweet)-[:MENTIONS]->(m:User {name: 'Neo4j'}) RETURN u LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24913,neo4jlabs_demo_db_twitter
What is the name of the movie with the lowest revenue?,"MATCH (m:Movie) RETURN m.title, m.revenue ORDER BY m.revenue ASC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29839,neo4jlabs_demo_db_recommendations
Identify the first 3 hashtags used in tweets that mention 'Neo4j'.,MATCH (t:Tweet)-[:MENTIONS]->(u:User {name: 'Neo4j'}) MATCH (t)-[:TAGS]->(h:Hashtag) RETURN h.name AS Hashtag LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24360,neo4jlabs_demo_db_twitter
Which 3 filings have the largest difference in latitude between originator and beneficiary locations?,"MATCH (f:Filing) WITH f,       toFloat(f.origin_lat) AS origin_lat,       toFloat(f.beneficiary_lat) AS beneficiary_lat,       abs(toFloat(f.origin_lat) - toFloat(f.beneficiary_lat)) AS lat_diff ORDER BY lat_diff DESC LIMIT 3 RETURN f.sar_id AS filing_id, lat_diff",neo4jLabs_synthetic_gpt4o,instance_id_41481,neo4jlabs_demo_db_fincen
What are the most expensive products ordered by 'LONESOME PINE RESTAURANT'?,"MATCH (c:Customer {companyName: 'LONESOME PINE RESTAURANT'})-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) RETURN p.productName, p.unitPrice ORDER BY p.unitPrice DESC",neo4jLabs_synthetic_gpt4turbo,instance_id_20377,neo4jlabs_demo_db_northwind
List the first 5 suppliers based in 'London'.,MATCH (s:Supplier {city: 'London'}) RETURN s.companyName LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_44634,neo4jlabs_demo_db_northwind
List the first 3 products from suppliers in 'UK'.,MATCH (s:Supplier {country: 'UK'})-[:SUPPLIES]->(p:Product) RETURN p LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21647,neo4jlabs_demo_db_northwind
"What is the average amount of filings originated by entities located in the same country as ""Azizi Bank""?","MATCH (azizi:Entity {name: ""Azizi Bank""})-[:COUNTRY]->(aziziCountry:Country) MATCH (aziziCountry)<-[:COUNTRY]-(otherEntities:Entity) WITH otherEntities MATCH (otherEntities)-[:ORIGINATOR]->(filings:Filing) RETURN avg(filings.amount)",neo4jLabs_synthetic_gemini,instance_id_28080,neo4jlabs_demo_db_fincen
List all reviewers of 'Speed Racer' and the ratings they gave.,"MATCH (p:Person)-[r:REVIEWED]->(m:Movie {title: 'Speed Racer'}) RETURN p.name AS Reviewer, r.rating AS Rating",neo4jLabs_synthetic_gpt4turbo,instance_id_23985,neo4jlabs_demo_db_movies
List the top 5 games played by the streams created in the first half of 2020.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WHERE s.createdAt >= datetime('2020-01-01T00:00:00Z') AND s.createdAt < datetime('2020-07-01T00:00:00Z') RETURN g.name AS game, COUNT(s) AS stream_count ORDER BY stream_count DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43481,neo4jlabs_demo_db_twitch
What are the first 3 genres with the least number of associated movies?,"MATCH (g:Genre)<-[:IN_GENRE]-(m:Movie) WITH g, count(m) AS movieCount ORDER BY movieCount ASC LIMIT 3 RETURN g.name AS Genre, movieCount",neo4jLabs_synthetic_gpt4turbo,instance_id_23144,neo4jlabs_demo_db_eoflix
List the movies that have been produced and directed by the same person.,"MATCH (p:Person)-[:PRODUCED]->(m:Movie)<-[:DIRECTED]-(p) RETURN m.title AS MovieTitle, p.name AS ProducerDirector",neo4jLabs_synthetic_gpt4turbo,instance_id_24130,neo4jlabs_demo_db_movies
List all categories that have products with units in stock less than 10.,MATCH (p:Product)-[:PART_OF]->(c:Category) WHERE p.unitsInStock < 10 RETURN DISTINCT c.categoryName,neo4jLabs_synthetic_gpt4o,instance_id_45228,neo4jlabs_demo_db_northwind
List the top 5 actors by the number of movies they have cast in.,"MATCH (p:Person)-[:CAST_FOR]->(m:Movie) RETURN p.name, count(m) AS movies_count ORDER BY movies_count DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23373,neo4jlabs_demo_db_eoflix
"List the ""jurisdiction_description"" values of Entities that are linked to an Intermediary with the status ""SUSPENDED"" and have an ""officer_of"" relationship with an Officer located in South Korea.",MATCH (i:Intermediary {status: 'SUSPENDED'})-[:intermediary_of]->(e:Entity) WITH distinct e MATCH (e)<-[:officer_of]-(o:Officer {countries: 'South Korea'}) RETURN DISTINCT e.jurisdiction_description,neo4jLabs_synthetic_gemini,instance_id_31408,neo4jlabs_demo_db_offshoreleaks
"List all users who are moderators for streams with over 1,000,000 total view count and play the game ""Rust"".","MATCH (g:Game {name: ""Rust""})<-[:PLAYS]-(s:Stream) WHERE s.total_view_count > 1000000 WITH s MATCH (s)<-[:MODERATOR]-(u:User) RETURN DISTINCT u.name",neo4jLabs_synthetic_gemini,instance_id_33869,neo4jlabs_demo_db_twitch
Which products have a unit price that is within 10% of the average unit price of all products?,MATCH (p:Product) WITH avg(p.unitPrice) AS avgPrice MATCH (p:Product) WHERE p.unitPrice >= avgPrice * 0.9 AND p.unitPrice <= avgPrice * 1.1 RETURN p.productName,neo4jLabs_synthetic_gemini,instance_id_32122,neo4jlabs_demo_db_northwind
List the top 5 filings where the originator bank's country is 'Singapore'.,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WHERE f.originator_bank_country = 'Singapore' RETURN f ORDER BY f.begin DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_26815,neo4jlabs_demo_db_fincen
What are the IPs of all switches in DataCenter 'DC1'?,MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(rack:Rack)-[:HOLDS]->(switch:Switch) RETURN switch.ip AS switch_ip,neo4jLabs_synthetic_gpt4o,instance_id_43766,neo4jlabs_demo_db_network
Which products have a quantity per unit description containing 'bags'?,MATCH (p:Product) WHERE p.quantityPerUnit CONTAINS 'bags' RETURN p,neo4jLabs_synthetic_gpt4turbo,instance_id_20395,neo4jlabs_demo_db_northwind
List the streams that have more than 5 million followers.,"MATCH (s:Stream) WHERE s.followers > 5000000 RETURN s.name AS stream_name, s.followers AS follower_count",neo4jLabs_synthetic_gpt4o,instance_id_43449,neo4jlabs_demo_db_twitch
Which movies have been reviewed with a summary containing 'amazing journey' and have a rating less than 80?,MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE r.summary CONTAINS 'amazing journey' AND r.rating < 80 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_24082,neo4jlabs_demo_db_movies
"""how many movies have Brad Pitt acted in?""","MATCH (p:Person {name: ""Brad Pitt""})-[:ACTED_IN]->(m:Movie) RETURN COUNT(m) AS NumberOfMoviesBradPittActedIn",neo4j_crowdsourced,instance_id_27401,neo4jlabs_demo_db_movies
What is the name of the machine that runs the process with PID 2586?,MATCH (p:Process {pid: 2586})<-[:RUNS]-(m:Machine) RETURN m.name,neo4jLabs_synthetic_gemini,instance_id_31691,neo4jlabs_demo_db_network
Find the top 3 tweets with the highest number of favorites.,MATCH (t:Tweet) RETURN t ORDER BY t.favorites DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24789,neo4jlabs_demo_db_twitter
Find the top 5 Filings by number of transactions.,MATCH (f:Filing) RETURN f ORDER BY f.number DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21397,neo4jlabs_demo_db_fincen
List the first 3 streams that have a language set to 'en'.,"MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language {name: 'en'}) RETURN s.name, s.url, s.createdAt ORDER BY s.createdAt LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43469,neo4jlabs_demo_db_twitch
Identify streams that have a creation date before 2010.,MATCH (s:Stream) WHERE s.createdAt < datetime('2010-01-01T00:00:00Z') RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_25585,neo4jlabs_demo_db_twitch
List the first 3 movies where the main genre is 'Adventure'.,MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Adventure'}) RETURN m LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_25054,neo4jlabs_demo_db_recommendations
Display the top 5 longest Filings by duration between begin and end dates.,"MATCH (f:Filing) WHERE f.begin IS NOT NULL AND f.end IS NOT NULL RETURN f, duration.between(f.begin, f.end) AS Duration ORDER BY Duration DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21474,neo4jlabs_demo_db_fincen
Find the top 3 types of applications by PID in descending order.,"MATCH (a:Application) RETURN a.name AS ApplicationType, a.pid AS PID ORDER BY a.pid DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20350,neo4jlabs_demo_db_network
What is the average unitsInStock for products supplied by suppliers based in the 'UK'?,MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE s.country = 'UK' WITH avg(p.unitsInStock) AS averageUnitsInStock RETURN averageUnitsInStock,neo4jLabs_synthetic_gemini,instance_id_32606,neo4jlabs_demo_db_northwind
List the top 5 suppliers with the most products in category 'Beverages'.,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product)-[:PART_OF]->(c:Category {categoryName: 'Beverages'}) WITH s, count(p) AS numProducts ORDER BY numProducts DESC LIMIT 5 RETURN s.companyName, numProducts",neo4jLabs_synthetic_gpt4turbo,instance_id_20459,neo4jlabs_demo_db_northwind
What is the name of the youngest director in the database?,"MATCH (d:Director) RETURN d.name, d.born ORDER BY d.born DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29634,neo4jlabs_demo_db_recommendations
List the first 3 movies that have a link to their homepage that includes 'disney'.,MATCH (m:Movie) WHERE m.homepage CONTAINS 'disney' RETURN m LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23260,neo4jlabs_demo_db_eoflix
"List the first 3 Officers with the sourceID ""Panama Papers"".","MATCH (n:Officer {sourceID: ""Panama Papers""}) RETURN n.name LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_30627,neo4jlabs_demo_db_offshoreleaks
Which intermediaries have a 'status' of 'SUSPENDED' and are 'intermediary_of' entities with an 'incorporation_date' before '01-JAN-2000'?,MATCH (i:Intermediary {status: 'SUSPENDED'}) -[:intermediary_of]->(e:Entity) WHERE e.incorporation_date < '01-JAN-2000' RETURN i.name,neo4jLabs_synthetic_gemini,instance_id_30534,neo4jlabs_demo_db_offshoreleaks
Identify the top 5 tweets linking to the most popular external sources.,"MATCH (t:Tweet)-[:CONTAINS]->(l:Link) WITH t, l, COUNT(l) AS link_count ORDER BY link_count DESC LIMIT 5 RETURN t.text AS tweet_text, l.url AS link_url, link_count",neo4jLabs_synthetic_gpt4o,instance_id_43148,neo4jlabs_demo_db_twitter
List the top 3 actors who have the highest average IMDb rating across their movies.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.imdbRating IS NOT NULL WITH a, avg(m.imdbRating) AS avgRating RETURN a.name AS actorName, avgRating ORDER BY avgRating DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41992,neo4jlabs_demo_db_recommendations
"""Show me all the officers""",MATCH (o:Officer) RETURN o,neo4j_crowdsourced,instance_id_27496,neo4jlabs_demo_db_offshoreleaks
What are the names of the entities that filed filings where the beneficiary bank is located in the United Kingdom and the amount is greater than 1000000?,"MATCH (f:Filing) WHERE f.beneficiary_bank_country = ""United Kingdom"" AND f.amount > 1000000 MATCH (e:Entity)-[:FILED]->(f) RETURN DISTINCT e.name",neo4jLabs_synthetic_gemini,instance_id_28279,neo4jlabs_demo_db_fincen
Which Machines in DataCenter 'DC1' are running an Application named 'webserver'?,MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(rack:Rack)-[:HOLDS]->(machine:Machine)-[:RUNS]->(app:Application {name: 'webserver'}) RETURN machine.name,neo4jLabs_synthetic_gpt4o,instance_id_43814,neo4jlabs_demo_db_network
List the first 3 products that are supplied exclusively by 'Mayumi's'.,"MATCH (s:Supplier {companyName: ""Mayumi's""})-[:SUPPLIES]->(p:Product) WHERE NOT exists {     MATCH (s2:Supplier)-[:SUPPLIES]->(p)     WHERE s2 <> s } RETURN p.productName, p.productID LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21813,neo4jlabs_demo_db_northwind
What is the average number of 'favorites' for tweets that mention users with a high 'following' count and a high 'statuses' count?,MATCH (t:Tweet)-[:MENTIONS]->(u:User) WHERE u.followers > 10000 AND u.statuses > 500 WITH avg(t.favorites) AS average_favorites RETURN average_favorites,neo4jLabs_synthetic_gemini,instance_id_33842,neo4jlabs_demo_db_twitter
List the orders that include products from categories with a total quantity of units in stock greater than 100.,"MATCH (cat:Category)<-[:PART_OF]-(prod:Product) WITH cat, sum(prod.unitsInStock) AS totalUnitsInStock WHERE totalUnitsInStock > 100 MATCH (cat)<-[:PART_OF]-(prod:Product)<-[:ORDERS]-(order:Order) RETURN DISTINCT order.orderID",neo4jLabs_synthetic_gemini,instance_id_30982,neo4jlabs_demo_db_northwind
What is the name of the director who directed the movie with the highest budget?,"MATCH (movie:Movie) WITH max(movie.budget) AS max_budget, movie MATCH (director:Director)-[:DIRECTED]->(movie) WHERE  movie.budget = max_budget RETURN director.name",neo4jLabs_synthetic_gemini,instance_id_29285,neo4jlabs_demo_db_recommendations
List the names of people who have both written and directed a movie.,MATCH (p:Person)-[:WROTE]->(m:Movie) WITH p MATCH (p)-[:DIRECTED]->(:Movie) RETURN p.name,neo4jLabs_synthetic_gemini,instance_id_32951,neo4jlabs_demo_db_movies
List the first 5 videos that have a runtime under 60 minutes.,MATCH (v:Video) WHERE v.runtime < 60 RETURN v LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_20627,neo4jlabs_demo_db_eoflix
List the games played by streams that have a description containing 'game play'.,MATCH (s:Stream)-[:PLAYS]->(g:Game) WHERE s.description CONTAINS 'game play' RETURN g.name AS GameName,neo4jLabs_synthetic_gpt4turbo,instance_id_25636,neo4jlabs_demo_db_twitch
What are the locations of the top 3 users who interact with 'neo4j'?,MATCH (u:User {screen_name: 'neo4j'})-[:INTERACTS_WITH]->(other:User) RETURN other.location AS Location ORDER BY other.followers DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24851,neo4jlabs_demo_db_twitter
Identify the top 3 games played by streams with a description containing 'hilarious moments'.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WHERE s.description CONTAINS 'hilarious moments' RETURN g.name AS game, COUNT(s) AS stream_count ORDER BY stream_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43659,neo4jlabs_demo_db_twitch
What are the IP addresses of all networks in zone 3?,MATCH (n:Network {zone: 3}) RETURN n.ip AS NetworkIP,neo4jLabs_synthetic_gpt4turbo,instance_id_20289,neo4jlabs_demo_db_network
List all the streams that have a 'CHATTER' relationship with a user who is also a 'VIP' to another stream.,MATCH (s:Stream)-[:CHATTER]->(u:User)-[:VIP]->(s2:Stream) RETURN DISTINCT s,neo4jLabs_synthetic_gemini,instance_id_33674,neo4jlabs_demo_db_twitch
List all entities with a note about their status.,"MATCH (e:Entity) WHERE e.note IS NOT NULL RETURN e.name, e.note",neo4jLabs_synthetic_gpt4turbo,instance_id_21325,neo4jlabs_demo_db_offshoreleaks
List the 3 streams with the most distinct users as VIPs.,"MATCH (s:Stream)-[:VIP]->(u:User) WITH s, count(DISTINCT u) AS uniqueVips ORDER BY uniqueVips DESC LIMIT 3 RETURN s.id AS StreamID, s.name AS StreamName, uniqueVips",neo4jLabs_synthetic_gpt4turbo,instance_id_25443,neo4jlabs_demo_db_twitch
"Find the streams that have a moderator who also moderates a stream with the game ""Rust"" and has more than 5,000 followers.","MATCH (s1:Stream)-[:PLAYS]->(:Game {name: ""Rust""}) MATCH (s1)<-[:MODERATOR]-(m) MATCH (m)-[:MODERATOR]->(s2:Stream) WHERE s2.followers > 5000 RETURN DISTINCT s2.name",neo4jLabs_synthetic_gemini,instance_id_33928,neo4jlabs_demo_db_twitch
List the 3 games most commonly played by streams with an English language setup.,"MATCH (s:Stream)-[:PLAYS]->(g:Game), (s)-[:HAS_LANGUAGE]->(l:Language) WHERE l.name = 'en' RETURN g.name AS game, COUNT(s) AS stream_count ORDER BY stream_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43668,neo4jlabs_demo_db_twitch
"""which actor has the highest rating movies""","MATCH (p:Person)-[:ACTED_IN]->(m:Movie)<-[:REVIEWED]-(r:Person) RETURN p.name AS Actor, AVG(r.rating) AS AvgRating ORDER BY AvgRating DESC LIMIT 1",neo4j_crowdsourced,instance_id_27479,neo4jlabs_demo_db_movies
Find the top 5 filings with the largest amount transferred in 2011.,MATCH (f:Filing) WHERE f.begin.year = 2011 RETURN f ORDER BY f.amount DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21375,neo4jlabs_demo_db_fincen
List the top 5 users who are moderators for the most streams.,"MATCH (u:User)-[:MODERATOR]->(s:Stream) WITH u, count(s) AS moderated_streams ORDER BY moderated_streams DESC LIMIT 5 RETURN u.name, moderated_streams",neo4jLabs_synthetic_gpt4turbo,instance_id_25746,neo4jlabs_demo_db_twitch
"""show me Movies directed by the Same Person and written by the same actor?""","MATCH (p:Person)-[:DIRECTED]->(m:Movie)<-[:WROTE]-(a:Person)-[:ACTED_IN]->(m) RETURN m.title AS MovieTitle, p.name AS DirectorAndWriter, a.name AS Actor",neo4j_crowdsourced,instance_id_27471,neo4jlabs_demo_db_movies
Name the first 3 streams that have had the same game since creation and more than 5 million total views.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WHERE s.createdAt = s.createdAt AND s.total_view_count > 5000000 RETURN s.name AS StreamName, g.name AS GameName LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25465,neo4jlabs_demo_db_twitch
List all persons who have directed a movie and also follow someone.,MATCH (p:Person)-[:DIRECTED]->(:Movie) WHERE exists{ (p)-[:FOLLOWS]->(:Person) } RETURN p.name,neo4jLabs_synthetic_gpt4turbo,instance_id_24084,neo4jlabs_demo_db_movies
List the top 5 streams that have a 'createdAt' date after 2019.,"MATCH (s:Stream) WHERE s.createdAt > datetime('2019-01-01T00:00:00Z') RETURN s.name, s.createdAt ORDER BY s.createdAt DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43664,neo4jlabs_demo_db_twitch
"What is the total number of streams that have at least one moderator and one VIP who are different users and belong to a team created before 2017 and have more than 50,000 followers and play the game ""Rust""?","MATCH (stream:Stream)-[:PLAYS]->(game:Game {name: ""Rust""}) WHERE stream.followers > 50000 WITH stream MATCH (stream)-[:MODERATOR]->(moderator:User) WITH DISTINCT stream, moderator MATCH (stream)-[:VIP]->(vip:User) WHERE moderator <> vip WITH DISTINCT stream, moderator, vip MATCH (stream)-[:HAS_TEAM]->(team:Team) WHERE team.createdAt < datetime('2017-01-01T00:00:00.000000000Z') WITH DISTINCT stream RETURN count(stream) AS totalStreams",neo4jLabs_synthetic_gemini,instance_id_33821,neo4jlabs_demo_db_twitch
List the top 5 most frequently ordered products by 'VINET'.,"MATCH (c:Customer {customerID: ""VINET""})-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) RETURN p.productName, count(o) AS ordersCount ORDER BY ordersCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_20462,neo4jlabs_demo_db_northwind
Which 3 suppliers are located in the UK?,"MATCH (s:Supplier {country: ""UK""}) RETURN s.companyName LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44664,neo4jlabs_demo_db_northwind
Which 3 products have the lowest 'unitPrice' in the 'Beverages' category?,"MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Beverages'}) RETURN p.productName, p.unitPrice ORDER BY p.unitPrice ASC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45266,neo4jlabs_demo_db_northwind
List the titles of movies directed by someone born before 1960.,MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE p.born < 1960 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_33105,neo4jlabs_demo_db_movies
List the actors who have acted in movies with a rating above 90.,MATCH (:Person)-[r:REVIEWED]->(m:Movie) WHERE r.rating > 90 WITH m MATCH (p:Person)-[:ACTED_IN]->(m) RETURN DISTINCT p.name,neo4jLabs_synthetic_gemini,instance_id_33090,neo4jlabs_demo_db_movies
What are the last known addresses of entities with a status 'Defaulted' in 2013?,"MATCH (e:Entity)-[:registered_address]->(a:Address) WHERE e.status = 'Defaulted' AND (e.inactivation_date CONTAINS '2013' OR e.struck_off_date CONTAINS '2013') RETURN e.name AS entity_name, a.address AS last_known_address",neo4jLabs_synthetic_gpt4o,instance_id_44907,neo4jlabs_demo_db_offshoreleaks
What is the name of the country with country code 'AFG'?,MATCH (c:Country {code: 'AFG'}) RETURN c.name,neo4jLabs_synthetic_gemini,instance_id_29076,neo4jlabs_demo_db_fincen
How many machines are there in rack 'DC1-RCK-4-9' and what types are they?,"MATCH (rack:Rack {name: 'DC1-RCK-4-9'})-[:HOLDS]->(machine:Machine)-[:TYPE]->(type:Type) RETURN COUNT(machine) AS machine_count, COLLECT(DISTINCT type.type) AS machine_types",neo4jLabs_synthetic_gpt4o,instance_id_43912,neo4jlabs_demo_db_network
What are the products with a 'unitPrice' less than 10 and are discontinued?,"MATCH (p:Product) WHERE p.unitPrice < 10 AND p.discontinued = true RETURN p.productName, p.unitPrice, p.discontinued",neo4jLabs_synthetic_gpt4turbo,instance_id_21778,neo4jlabs_demo_db_northwind
Find the orders that include products from the category with the lowest average unit price.,"MATCH (p:Product)-[:PART_OF]->(c:Category) WITH c, avg(p.unitPrice) AS averagePrice ORDER BY averagePrice ASC LIMIT 1 MATCH (c)<-[:PART_OF]-(p:Product)<-[:ORDERS]-(o:Order) RETURN o.orderID, collect(p.productName) AS products",neo4jLabs_synthetic_gemini,instance_id_30792,neo4jlabs_demo_db_northwind
List the `name`s of all countries that have entities which are both `ORIGINATOR` and `BENEFICIARY` in at least one filing.,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)<-[:BENEFITS]-(f) MATCH (e)-[:COUNTRY]->(c:Country) RETURN DISTINCT c.name,neo4jLabs_synthetic_gemini,instance_id_28216,neo4jlabs_demo_db_fincen
