question,cypher,data_source,instance_id,database_reference_alias
What are the top 5 filings by the longest duration from begin to end date?,"MATCH (f:Filing) WITH f, duration.inDays(datetime(f.begin), datetime(f.end)) AS duration ORDER BY duration DESC LIMIT 5 RETURN f.sar_id AS SAR_ID, f.begin AS BeginDate, f.end AS EndDate, duration",neo4jLabs_synthetic_gpt4o,instance_id_39123,neo4jlabs_demo_db_fincen
List the top 5 movies where actors also served as directors.,"MATCH (actor:Actor)-[:ACTED_IN]->(movie:Movie)<-[:DIRECTED]-(actor) RETURN movie.title AS MovieTitle, COUNT(actor) AS ActorDirectorCount ORDER BY ActorDirectorCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_42136,neo4jlabs_demo_db_recommendations
List all movies with more than 1000 votes.,MATCH (m:Movie) WHERE m.votes > 1000 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_23692,neo4jlabs_demo_db_movies
What are the names of intermediaries located in 'South Africa'?,MATCH (i:Intermediary) WHERE i.countries = 'South Africa' RETURN i.name,neo4jLabs_synthetic_gpt4o,instance_id_44936,neo4jlabs_demo_db_offshoreleaks
Name the top 5 production companies that have produced the highest grossing movies.,"MATCH (m:Movie)-[:PRODUCED_BY]->(pc:ProductionCompany) WITH pc, SUM(m.revenue) AS total_revenue ORDER BY total_revenue DESC LIMIT 5 RETURN pc.name AS production_company, total_revenue",neo4jLabs_synthetic_gpt4o,instance_id_39730,neo4jlabs_demo_db_eoflix
What is the total revenue generated by orders that include products with no discount?,"MATCH (o:Order)-[rel:ORDERS]->(p:Product) WHERE rel.discount = ""0"" WITH o, sum(toFloat(rel.unitPrice) * toInteger(rel.quantity)) AS orderRevenue WITH sum(orderRevenue) AS totalRevenue RETURN totalRevenue",neo4jLabs_synthetic_gemini,instance_id_32296,neo4jlabs_demo_db_northwind
Identify the first 3 networks with a zone of 4 that route through any interface.,"MATCH (n:Network)-[:ROUTES]->(i:Interface) WHERE n.zone = 4 RETURN n.ip, n.zone LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43726,neo4jlabs_demo_db_network
List all the streams that have a 'HAS_TEAM' relationship with a team created before the year 2015.,MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WHERE t.createdAt < datetime('2015-01-01T00:00:00Z') RETURN DISTINCT s.name,neo4jLabs_synthetic_gemini,instance_id_33679,neo4jlabs_demo_db_twitch
Which 3 customers have their phone numbers starting with '030'?,"MATCH (c:Customer) WHERE c.phone STARTS WITH '030' RETURN c.companyName, c.phone LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45245,neo4jlabs_demo_db_northwind
What is the average number of officers for entities that have a 'jurisdiction' of 'SAM' and a 'status' of 'Active'?,"MATCH (e:Entity {jurisdiction: 'SAM', status: 'Active'})-[:officer_of]->(o:Officer) WITH e, count(o) AS officer_count WITH avg(officer_count) AS average_officers RETURN average_officers",neo4jLabs_synthetic_gemini,instance_id_30700,neo4jlabs_demo_db_offshoreleaks
Find the top 5 users with the most followers who follow Neo4j.,"MATCH (me:Me {screen_name: 'neo4j'}) MATCH (u:User)-[:FOLLOWS]->(me) RETURN u.screen_name, u.followers  ORDER BY u.followers DESC LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_34479,neo4jlabs_demo_db_twitter
Find all entities that have a registered address in 'Samoa' and an officer with the country_codes 'WSM'.,"MATCH (e:Entity)-[r:registered_address]->(a:Address) WHERE a.countries = 'Samoa' MATCH (e2:Entity)<-[:officer_of]-(o:Officer) WHERE e.node_id = e2.node_id AND o.country_codes = 'WSM' RETURN DISTINCT e.node_id, e.name",neo4jLabs_synthetic_gemini,instance_id_30948,neo4jlabs_demo_db_offshoreleaks
Identify all orders shipped by 'shipVia' 3.,"MATCH (o:Order) WHERE o.shipVia = '3' RETURN o.orderID, o.shipName, o.shipCity, o.shipCountry, o.shipPostalCode, o.shipAddress, o.shipRegion, o.shippedDate",neo4jLabs_synthetic_gpt4o,instance_id_45347,neo4jlabs_demo_db_northwind
List the entities that were incorporated in '2006' and have a service provider of 'Mossack Fonseca'.,"MATCH (e:Entity) WHERE e.incorporation_date CONTAINS '2006' AND e.service_provider = 'Mossack Fonseca' RETURN e.name AS entity_name, e.incorporation_date AS incorporation_date, e.service_provider AS service_provider",neo4jLabs_synthetic_gpt4o,instance_id_42522,neo4jlabs_demo_db_offshoreleaks
What is the name of the entity with internal_id '1001256'?,MATCH (e:Entity {internal_id: '1001256'}) RETURN e.name,neo4jLabs_synthetic_gemini,instance_id_30909,neo4jlabs_demo_db_offshoreleaks
List the top 5 users followed by 'Neo4j' who have a screen_name starting with 'n'.,"MATCH (me:Me {screen_name: 'neo4j'})-[:FOLLOWS]->(user:User) WHERE user.screen_name STARTS WITH 'n' RETURN user.screen_name, user.followers ORDER BY user.followers DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43121,neo4jlabs_demo_db_twitter
Find the `orderID` and `shipRegion` for orders that contain products from suppliers located in both 'USA' and 'UK'.,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE s.country IN ['USA', 'UK'] WITH DISTINCT p MATCH (p)<-[:ORDERS]-(o:Order) RETURN DISTINCT o.orderID, o.shipRegion",neo4jLabs_synthetic_gemini,instance_id_30837,neo4jlabs_demo_db_northwind
Which year had the most movies released?,"MATCH (m:Movie) WITH m.year AS releaseYear, count(*) AS movieCount ORDER BY movieCount DESC RETURN releaseYear, movieCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29623,neo4jlabs_demo_db_recommendations
"Which movie has the highest IMDB rating in the ""Horror"" genre?","MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Horror'}) WITH m ORDER BY m.imdbRating DESC RETURN m.title AS Movie, m.imdbRating AS Rating LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29334,neo4jlabs_demo_db_recommendations
Which entities are connected to the officer with `icij_id` 'C0FCC85C73FE8405CBF5FD732A6787E5' through the 'officer_of' relationship?,MATCH (o:Officer {icij_id: 'C0FCC85C73FE8405CBF5FD732A6787E5'})-[:officer_of]->(e:Entity) RETURN e.name,neo4jLabs_synthetic_gemini,instance_id_30511,neo4jlabs_demo_db_offshoreleaks
Find the top 5 most recent tweets by 'neo4j'.,MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet) RETURN t ORDER BY t.created_at DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24858,neo4jlabs_demo_db_twitter
Show the top 3 actors who have acted in movies that generated over 500 million in revenue.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.revenue > 500000000 RETURN a.name, count(m) AS movies_count ORDER BY movies_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24591,neo4jlabs_demo_db_recommendations
List all products from suppliers located in 'Germany'.,"MATCH (s:Supplier {country: 'Germany'})-[:SUPPLIES]->(p:Product) RETURN p.productName, p.productID",neo4jLabs_synthetic_gpt4turbo,instance_id_20435,neo4jlabs_demo_db_northwind
List the first 3 orders that included products from more than three different categories.,"MATCH (o:Order)-[:ORDERS]->(p:Product)-[:PART_OF]->(c:Category) WITH o, count(DISTINCT c) AS numCategories WHERE numCategories > 3 RETURN o ORDER BY o.orderDate LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20556,neo4jlabs_demo_db_northwind
Which 3 products have the highest unit price among those supplied by 'Mayumi's'?,"MATCH (s:Supplier {companyName: ""Mayumi's""})-[:SUPPLIES]->(p:Product) RETURN p.productName, p.unitPrice ORDER BY p.unitPrice DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20424,neo4jlabs_demo_db_northwind
Which machines are type 'm' in DataCenter DC1?,MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(rack:Rack)-[:HOLDS]->(machine:Machine)-[:TYPE]->(type:Type {type: 'm'}) RETURN machine.name,neo4jLabs_synthetic_gpt4o,instance_id_43717,neo4jlabs_demo_db_network
What are the top 3 processes running on the application 'webserver'?,MATCH (app:Application {name: 'webserver'})-[:RUNS]->(proc:Process) RETURN proc ORDER BY proc.startTime DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20245,neo4jlabs_demo_db_network
List all the types of machines available in rack 'DC1-RCK-1-1'.,MATCH (r:Rack {name: 'DC1-RCK-1-1'})-[:HOLDS]->(m:Machine)-[:TYPE]->(t:Type) RETURN DISTINCT t.name AS MachineType,neo4jLabs_synthetic_gpt4turbo,instance_id_20174,neo4jlabs_demo_db_network
Which entity benefited from the filing with the latest 'end' date?,MATCH (f:Filing) WITH max(f.end) AS latest_end MATCH (f:Filing {end: latest_end})-[r:BENEFITS]->(e:Entity) RETURN e.name,neo4jLabs_synthetic_gemini,instance_id_29109,neo4jlabs_demo_db_fincen
List the top 5 movies with the most diverse cast in terms of birth years.,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WITH m, count(DISTINCT p.born) AS diversity ORDER BY diversity DESC LIMIT 5 RETURN m.title, diversity",neo4jLabs_synthetic_gpt4turbo,instance_id_24037,neo4jlabs_demo_db_movies
List the first 3 keywords associated with the movie with the highest average vote.,MATCH (m:Movie) WITH m ORDER BY m.average_vote DESC LIMIT 1 MATCH (m)-[:HAS_KEYWORD]->(k:Keyword) RETURN k.name LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_34621,neo4jlabs_demo_db_eoflix
Which movies have a tagline containing a question mark?,"MATCH (m:Movie) WHERE m.tagline CONTAINS ""?"" RETURN m.title",neo4jLabs_synthetic_gemini,instance_id_33059,neo4jlabs_demo_db_movies
Which directors were born in France and have directed at least two movies?,"MATCH (d:Director)-[:DIRECTED]->(m:Movie) WHERE d.bornIn = ""France"" WITH d, COUNT(m) AS movieCount WHERE movieCount >= 2 RETURN d.name AS directorName, movieCount",neo4jLabs_synthetic_gpt4o,instance_id_42801,neo4jlabs_demo_db_recommendations
Identify the top 5 originator banks by the total number of filings they initiated.,"MATCH (e:Entity)-[:FILED]->(f:Filing) WHERE e.id = f.originator_bank_id RETURN e.name AS originator_bank, COUNT(f) AS total_filings ORDER BY total_filings DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41371,neo4jlabs_demo_db_fincen
Find all products that have never been reordered (reorder level 0).,"MATCH (p:Product) WHERE p.reorderLevel = 0 RETURN p.productName, p.productID, p.unitPrice, p.unitsInStock",neo4jLabs_synthetic_gpt4o,instance_id_45009,neo4jlabs_demo_db_northwind
"What is the total number of filings where the beneficiary entity's name contains ""Bank""?",MATCH (f:Filing)-[:BENEFITS]->(b:Entity) WHERE b.name CONTAINS 'Bank' RETURN count(*) AS totalFilings,neo4jLabs_synthetic_gemini,instance_id_28083,neo4jlabs_demo_db_fincen
How many applications are dependent on the service named 'java'?,MATCH (s:Service {name: 'java'})<-[:DEPENDS_ON]-(a:Application) RETURN count(a) AS NumberOfDependentApplications,neo4jLabs_synthetic_gpt4turbo,instance_id_20311,neo4jlabs_demo_db_network
How many customers are from 'Germany' and have placed an order with a `freight` cost greater than 100?,MATCH (customer:Customer)-[:PURCHASED]->(order:Order) WHERE customer.country = 'Germany' AND toFloat(order.freight) > 100 RETURN count(DISTINCT customer),neo4jLabs_synthetic_gemini,instance_id_32199,neo4jlabs_demo_db_northwind
Find the top 5 Filings by amount where the originator is from 'United Kingdom'.,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country {name: 'United Kingdom'}) RETURN f ORDER BY f.amount DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21476,neo4jlabs_demo_db_fincen
Which racks are in zone 1 and hold machines of type 'l'?,MATCH (r:Rack {zone: 1})-[:HOLDS]->(m:Machine)-[:TYPE]->(t:Type {type: 'l'}) RETURN r.name AS RackName,neo4jLabs_synthetic_gpt4turbo,instance_id_20233,neo4jlabs_demo_db_network
"""Who prodced the most movies during 2000 to 2010""","MATCH (p:Person)-[:PRODUCED]->(m:Movie) WHERE m.released >= 2000 AND m.released <= 2010 RETURN p.name, COUNT(m) AS movies_produced ORDER BY movies_produced DESC LIMIT 1",neo4j_crowdsourced,instance_id_27518,neo4jlabs_demo_db_movies
What is the average number of favorites for tweets that mention users who have interacted with 'Tobias Lindaaker'?,"MATCH (tobias:User {name: ""Tobias Lindaaker""})<-[:INTERACTS_WITH]-(interactedUser:User) WITH interactedUser MATCH (interactedUser)<-[:MENTIONS]-(tweet:Tweet) WITH tweet RETURN avg(tweet.favorites) AS average_favorites",neo4jLabs_synthetic_gemini,instance_id_34674,neo4jlabs_demo_db_twitter
Show the top 5 oldest movies in the collection with the highest revenue.,"MATCH (m:Movie)-[:IN_COLLECTION]->(c:Collection) WHERE m.revenue IS NOT NULL RETURN m.title, m.release_date, m.revenue ORDER BY m.release_date ASC, m.revenue DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23240,neo4jlabs_demo_db_eoflix
What is the tagline of the movie with the highest number of votes?,"MATCH (m:Movie) RETURN m.tagline AS tagline, m.votes as votes ORDER BY votes DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32883,neo4jlabs_demo_db_movies
List the top 3 movies with the highest number of votes.,"MATCH (m:Movie) WITH m ORDER BY m.votes DESC LIMIT 3 RETURN m.title, m.votes",neo4jLabs_synthetic_gemini,instance_id_32976,neo4jlabs_demo_db_movies
How many customers have placed orders that include products with a `discount` greater than 0?,MATCH (o:Order)-[rel:ORDERS]->(p:Product) WHERE toFloat(rel.discount) > 0 WITH DISTINCT o.customerID AS customerId RETURN count(customerId),neo4jLabs_synthetic_gemini,instance_id_32095,neo4jlabs_demo_db_northwind
List the first 3 movies directed by persons who were born after 1950 and before 1960.,"MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE p.born > 1950 AND p.born < 1960 RETURN m.title, m.released ORDER BY m.released LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23867,neo4jlabs_demo_db_movies
Name the top 5 most voted movies on IMDb released after 2010.,"MATCH (m:Movie) WHERE m.year > 2010 RETURN m.title, m.imdbVotes ORDER BY m.imdbVotes DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_24782,neo4jlabs_demo_db_recommendations
Show the first 3 people born in 1980 who have reviewed a movie.,MATCH (p:Person)-[:REVIEWED]->(:Movie) WHERE p.born = 1980 RETURN p LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23735,neo4jlabs_demo_db_movies
Who are the top 3 VIPs in the streams that were created in 2018?,"MATCH (s:Stream)-[:VIP]->(u:User) WHERE s.createdAt >= datetime('2018-01-01T00:00:00Z') AND s.createdAt < datetime('2019-01-01T00:00:00Z') RETURN u.name, COUNT(s) AS stream_count ORDER BY stream_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43513,neo4jlabs_demo_db_twitch
Which person has the highest average rating for the movies they directed?,"MATCH (p:Person)-[:DIRECTED]->(m:Movie)<-[review:REVIEWED]-(p2:Person) WITH p.name AS directorName, avg(review.rating) AS averageRating ORDER BY averageRating DESC RETURN directorName, averageRating LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32648,neo4jlabs_demo_db_movies
What are the top 5 products that have been reordered the least times?,"MATCH (p:Product) RETURN p.productName, p.unitsOnOrder ORDER BY p.unitsOnOrder ASC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_45279,neo4jlabs_demo_db_northwind
"What are the different languages spoken in the movie ""Toy Story""?",MATCH (m:Movie {title: 'Toy Story'})-[:SPOKEN_IN_LANGUAGE]->(l:Language) RETURN l.name,neo4jLabs_synthetic_gemini,instance_id_34252,neo4jlabs_demo_db_eoflix
List the 3 streams with the highest number of games played.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WITH s, COUNT(g) AS gameCount ORDER BY gameCount DESC LIMIT 3 RETURN s.name AS streamName, gameCount",neo4jLabs_synthetic_gpt4o,instance_id_43587,neo4jlabs_demo_db_twitch
"Which users are chatters in the most streams, listing the first 5.","MATCH (u:User)-[:CHATTER]->(s:Stream) WITH u, count(s) AS streams_count ORDER BY streams_count DESC LIMIT 5 RETURN u.name, streams_count",neo4jLabs_synthetic_gpt4turbo,instance_id_25466,neo4jlabs_demo_db_twitch
"What is the `lastEditTimestamp` of the officer associated with the entity named ""HOTFOCUS CO., LTD.""?","MATCH (e:Entity {name: ""HOTFOCUS CO., LTD.""}) MATCH (e)<-[:officer_of]-(o:Officer) RETURN o.lastEditTimestamp",neo4jLabs_synthetic_gemini,instance_id_30515,neo4jlabs_demo_db_offshoreleaks
What is the average number of dependencies for all the Software?,MATCH (s:Software) WITH avg(size(s.dependencies)) AS average_dependencies RETURN average_dependencies,neo4jLabs_synthetic_gemini,instance_id_32451,neo4jlabs_demo_db_network
Which software has the highest number of dependencies on other applications?,"MATCH (s:Software)-[r:DEPENDS_ON]->(a:Application) WITH s, count(r) AS num_dependencies ORDER BY num_dependencies DESC RETURN s.name AS software_name, num_dependencies LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_31744,neo4jlabs_demo_db_network
List the names of the users who are moderators of at least one stream.,MATCH (u:User)-[:MODERATOR]->(:Stream) RETURN DISTINCT u.name,neo4jLabs_synthetic_gemini,instance_id_34012,neo4jlabs_demo_db_twitch
"What is the minimum amount filed by entities located in the country with name ""United Kingdom""?","MATCH (c:Country {name: ""United Kingdom""})<-[:COUNTRY]-(e:Entity)-[:FILED]->(f:Filing) RETURN min(f.amount)",neo4jLabs_synthetic_gemini,instance_id_28987,neo4jlabs_demo_db_fincen
Find the streams that are chatted in by users who are also VIPs of other streams.,MATCH (u:User)-[:VIP]->(:Stream) WITH DISTINCT u MATCH (u)-[:CHATTER]->(s:Stream) RETURN DISTINCT s,neo4jLabs_synthetic_gemini,instance_id_33946,neo4jlabs_demo_db_twitch
Identify streams that were created on or after 2018 and are part of teams.,"MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WHERE s.createdAt >= datetime('2018-01-01T00:00:00Z') RETURN s.id AS streamId, s.name AS streamName, s.createdAt AS creationDate, t.name AS teamName",neo4jLabs_synthetic_gpt4o,instance_id_43406,neo4jlabs_demo_db_twitch
What are the top 5 OS instances running on machines in DataCenter 'DC1'?,"MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(:Rack)-[:HOLDS]->(m:Machine)-[:RUNS]->(os:OS) RETURN os.name, COUNT(os) AS instance_count ORDER BY instance_count DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43782,neo4jlabs_demo_db_network
List the first 3 persons who have produced a movie with a tagline including 'real world' and released after 1995.,MATCH (p:Person)-[:PRODUCED]->(m:Movie) WHERE m.tagline CONTAINS 'real world' AND m.released > 1995 RETURN p LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23887,neo4jlabs_demo_db_movies
"""Is there a shortest path between Jerry Maguire and Top Gun?""","MATCH p=shortestPath((m1:Movie {title: ""Jerry Maguire""})-[*]-(m2:Movie {title: ""Top Gun""})) RETURN p",neo4j_crowdsourced,instance_id_27770,neo4jlabs_demo_db_movies
List the top 5 most used process names in the database.,"MATCH (p:Process) RETURN p.name, count(p) AS usage ORDER BY usage DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_20346,neo4jlabs_demo_db_network
List the Entities that are concerned by Filings where the originator bank is in 'Angola'.,MATCH (f:Filing)-[:CONCERNS]->(e:Entity) WHERE f.originator_bank_country = 'Angola' RETURN e.name AS ConcernedEntities,neo4jLabs_synthetic_gpt4o,instance_id_41211,neo4jlabs_demo_db_fincen
List the top 3 movies that were produced by 'Pixar Animation Studios' and have a runtime longer than 90 minutes.,"MATCH (p:ProductionCompany {name: 'Pixar Animation Studios'})<-[:PRODUCED_BY]-(m:Movie) WHERE m.runtime > 90 RETURN m.title, m.runtime ORDER BY m.average_vote DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44377,neo4jlabs_demo_db_eoflix
Show the streams that have the highest number of different games played.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WITH s, COUNT(DISTINCT g) AS gameCount ORDER BY gameCount DESC LIMIT 1 RETURN s.name AS streamName, gameCount",neo4jLabs_synthetic_gpt4o,instance_id_43627,neo4jlabs_demo_db_twitch
List the top 5 adult films with the most keywords associated.,"MATCH (a:Adult)-[:HAS_KEYWORD]->(k:Keyword) WITH a, count(k) AS num_keywords ORDER BY num_keywords DESC LIMIT 5 RETURN a.title, num_keywords",neo4jLabs_synthetic_gpt4turbo,instance_id_20820,neo4jlabs_demo_db_eoflix
What is the total number of filings where the begin date is in the year 2015?,MATCH (f:Filing) WHERE datetime(f.begin_date_format).year = 2015 RETURN count(f) AS totalFilings,neo4jLabs_synthetic_gemini,instance_id_28291,neo4jlabs_demo_db_fincen
Which movie has the longest title?,"MATCH (m:Movie) WITH m, size(m.title) AS titleLength ORDER BY titleLength DESC RETURN m.title, titleLength LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29635,neo4jlabs_demo_db_recommendations
List the top 5 streams with the lowest follower count that play the game 'Rust'.,"MATCH (s:Stream)-[:PLAYS]->(g:Game {name: 'Rust'}) RETURN s.name, s.followers ORDER BY s.followers ASC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43495,neo4jlabs_demo_db_twitch
What is the title of the movie with the most recent release date?,MATCH (m:Movie) RETURN m.title ORDER BY m.released DESC LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_33040,neo4jlabs_demo_db_movies
Which users have rated movies in the 'Adventure' genre?,MATCH (u:User)-[:RATED]->(m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Adventure'}) RETURN DISTINCT u,neo4jLabs_synthetic_gpt4turbo,instance_id_25851,neo4jlabs_demo_db_recommendations
List the top 3 countries where the originator banks have originated the smallest total amounts in filings.,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country) WITH c.name AS country, SUM(f.amount) AS total_amount ORDER BY total_amount ASC RETURN country, total_amount LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_26818,neo4jlabs_demo_db_fincen
How many different software versions are available for the software named RHEL?,MATCH (s:Software {name: 'RHEL'})-[:VERSION]->(v:Version) RETURN count(DISTINCT v) AS NumberOfVersions,neo4jLabs_synthetic_gpt4turbo,instance_id_20935,neo4jlabs_demo_db_network
List the URLs of the links shared in the tweets that mention 'Neo4j'. Limit to 8.,MATCH (t:Tweet)-[:MENTIONS]->(m:Me) MATCH (t)-[:CONTAINS]->(l:Link) RETURN l.url LIMIT 8,neo4jLabs_synthetic_gemini,instance_id_34500,neo4jlabs_demo_db_twitter
What is the total freight cost of orders placed by 'FURIB' for products in the 'Condiments' category?,MATCH (c:Customer {customerID: 'FURIB'})-[:PURCHASED]->(o:Order) MATCH (o)-[:ORDERS]->(p:Product) MATCH (p)-[:PART_OF]->(cat:Category) WHERE cat.categoryName = 'Condiments' WITH sum(toFloat(o.freight)) AS totalFreightCost RETURN totalFreightCost,neo4jLabs_synthetic_gemini,instance_id_32142,neo4jlabs_demo_db_northwind
List the top 3 genres with the most movies associated with them.,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WITH g, count(m) AS movieCount ORDER BY movieCount DESC LIMIT 3 RETURN g.name AS Genre, movieCount",neo4jLabs_synthetic_gpt4turbo,instance_id_24655,neo4jlabs_demo_db_recommendations
"""Who worked with Tim Allen in 2010?
""","MATCH (timAllen:Person {name: ""Tim Allen""})-[:CAST_FOR]->(m:Movie)<-[:CAST_FOR|CREW_FOR]-(colleagues:Person) WHERE m.release_date >= date(""2010-01-01"") AND m.release_date <= date(""2010-12-31"") RETURN DISTINCT colleagues.name",neo4j_crowdsourced,instance_id_27835,neo4jlabs_demo_db_eoflix
List the top 5 movies with the highest number of imdbVotes.,MATCH (m:Movie) WHERE m.imdbVotes IS NOT NULL RETURN m ORDER BY m.imdbVotes DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_25301,neo4jlabs_demo_db_recommendations
Identify the 5 most common employee IDs associated with orders.,"MATCH (o:Order) WITH o.employeeID AS EmployeeID, count(o) AS OrdersCount ORDER BY OrdersCount DESC LIMIT 5 RETURN EmployeeID, OrdersCount",neo4jLabs_synthetic_gpt4turbo,instance_id_20472,neo4jlabs_demo_db_northwind
What is the average number of votes for movies released before 1990?,MATCH (m:Movie) WHERE m.released < 1990 RETURN avg(m.votes) AS average_votes,neo4jLabs_synthetic_gemini,instance_id_32644,neo4jlabs_demo_db_movies
List the 3 customers who have ordered products with the highest average unit price.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) WITH c, AVG(toFloat(p.unitPrice)) AS avgUnitPrice ORDER BY avgUnitPrice DESC LIMIT 3 RETURN c.companyName, avgUnitPrice",neo4jLabs_synthetic_gpt4turbo,instance_id_21916,neo4jlabs_demo_db_northwind
List the products that are out of stock (unitsInStock = 0).,MATCH (p:Product) WHERE p.unitsInStock = 0 RETURN p.productName,neo4jLabs_synthetic_gemini,instance_id_32319,neo4jlabs_demo_db_northwind
Identify the top 5 filings where the originator bank's country is 'Singapore' and the beneficiary bank's country is 'United Kingdom'.,MATCH (f:Filing) WHERE f.originator_bank_country = 'Singapore' AND f.beneficiary_bank_country = 'United Kingdom' RETURN f ORDER BY f.amount DESC LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_41782,neo4jlabs_demo_db_fincen
What are the jurisdictions described for entities with country code 'HKG'?,MATCH (e:Entity) WHERE e.country_codes = 'HKG' RETURN DISTINCT e.jurisdiction_description AS jurisdiction_description,neo4jLabs_synthetic_gpt4o,instance_id_44964,neo4jlabs_demo_db_offshoreleaks
List 3 users who have posted tweets tagging the hashtag 'education'.,"MATCH (u:User)-[:POSTS]->(t:Tweet)-[:TAGS]->(h:Hashtag {name: 'education'}) RETURN u.screen_name, u.name LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43086,neo4jlabs_demo_db_twitter
List the first 3 ports exposed by any service running on OS 'RHEL'.,MATCH (os:OS {name: 'RHEL'})-[:RUNS]->(service:Service)-[:LISTENS]->(port:Port) RETURN port.port LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20541,neo4jlabs_demo_db_network
"List the first 5 entities that benefited from filings where the originator bank is located in the country with code ""SGP"" and the beneficiary bank is located in the country with code ""GBR"".","MATCH (originatorCountry:Country {code: ""SGP""}) MATCH (beneficiaryCountry:Country {code: ""GBR""}) MATCH (filing:Filing)-[:ORIGINATOR]->(:Entity)-[:COUNTRY]->(originatorCountry) WHERE filing.beneficiary_iso = beneficiaryCountry.code WITH DISTINCT filing MATCH (filing)-[:BENEFITS]->(entity:Entity) RETURN entity.name LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_28213,neo4jlabs_demo_db_fincen
List the top 3 actors who have the most diverse filmography in terms of genres they acted in.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)-[:IN_GENRE]->(g:Genre) WITH a, COUNT(DISTINCT g.name) AS genreCount ORDER BY genreCount DESC LIMIT 3 RETURN a.name AS actorName, genreCount",neo4jLabs_synthetic_gpt4o,instance_id_41984,neo4jlabs_demo_db_recommendations
List the officers that are connected to entities with a node_id greater than '12000000'.,MATCH (o:Officer)-[:connected_to]->(e:Entity) WHERE e.node_id > 12000000 RETURN o.name AS officer_name,neo4jLabs_synthetic_gpt4o,instance_id_44741,neo4jlabs_demo_db_offshoreleaks
"What is the name of the application that is running on the machine that is located in the data center ""DC1"" and is of type ""xxl""?","MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(rack:Rack)-[:HOLDS]->(machine:Machine),       (machine)-[:TYPE]->(type:Type {type: 'xxl'}),       (machine)-[:RUNS]->(app:Application) RETURN app.name",neo4jLabs_synthetic_gemini,instance_id_32405,neo4jlabs_demo_db_network
"List the creation dates of all streams that have ""Resident Evil Village"" as a played game.","MATCH (g:Game {name: ""Resident Evil Village""})<-[:PLAYS]-(s:Stream) RETURN s.createdAt",neo4jLabs_synthetic_gemini,instance_id_34009,neo4jlabs_demo_db_twitch
Which customers have a contact title of 'Sales Representative'?,"MATCH (c:Customer) WHERE c.contactTitle = 'Sales Representative' RETURN c.companyName AS customerName, c.contactName AS contactPerson",neo4jLabs_synthetic_gpt4o,instance_id_44701,neo4jlabs_demo_db_northwind
What are the product names of the top 5 most expensive products?,"MATCH (p:Product) RETURN p.productName AS ProductName, p.unitPrice AS UnitPrice ORDER BY p.unitPrice DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21111,neo4jlabs_demo_db_northwind
What are the names of all applications running on machines in zone 3?,MATCH (dc:DataCenter)-[:CONTAINS]->(rack:Rack {zone: 3})-[:HOLDS]->(machine:Machine)-[:RUNS]->(app:Application) RETURN DISTINCT app.name AS application_name,neo4jLabs_synthetic_gpt4o,instance_id_44049,neo4jlabs_demo_db_network
List the names of the games played by streams that have more than 100000 followers.,MATCH (s:Stream)-[:PLAYS]->(g:Game) WHERE s.followers > 100000 RETURN DISTINCT g.name,neo4jLabs_synthetic_gemini,instance_id_34150,neo4jlabs_demo_db_twitch
What is the oldest movie with a rating above 90?,"MATCH (m:Movie)<-[r:REVIEWED]-(p:Person) WHERE r.rating > 90 RETURN m.title, m.released ORDER BY m.released ASC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32714,neo4jlabs_demo_db_movies
Find the movies released between 1990 and 2000 with more than 50 votes.,MATCH (m:Movie) WHERE m.released >= 1990 AND m.released <= 2000 AND m.votes > 50 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32841,neo4jlabs_demo_db_movies
Display all movies that were released in the 1990s.,MATCH (m:Movie) WHERE m.release_date >= date('1990-01-01') AND m.release_date <= date('1999-12-31') RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_23588,neo4jlabs_demo_db_eoflix
What is the total number of movies in the database?,MATCH (m:Movie) RETURN count(m),neo4jLabs_synthetic_gemini,instance_id_29295,neo4jlabs_demo_db_recommendations
What is the average start time of all processes running on machines in zone 4?,MATCH (r:Rack {zone: 4})-[:HOLDS]->(m:Machine)-[:RUNS]->(p:Process) WITH avg(p.startTime) AS averageStartTime RETURN averageStartTime,neo4jLabs_synthetic_gemini,instance_id_31685,neo4jlabs_demo_db_network
"List the top 5 highest grossing movies that have been released on or after January 1, 2000.","MATCH (m:Movie) WHERE m.release_date >= date('2000-01-01') RETURN m.title, m.revenue ORDER BY m.revenue DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39602,neo4jlabs_demo_db_eoflix
"Who has acted in, directed, and produced the same movie?","MATCH (p:Person)-[:ACTED_IN]->(m:Movie) MATCH (p)-[:DIRECTED]->(m) MATCH (p)-[:PRODUCED]->(m) RETURN p.name, m.title",neo4jLabs_synthetic_gpt4turbo,instance_id_23849,neo4jlabs_demo_db_movies
"Which 'Service' is 'Application' with 'name' ""webserver"" dependent on?",MATCH (app:Application {name: 'webserver'})-[:DEPENDS_ON]->(service:Service) RETURN service.name,neo4jLabs_synthetic_gemini,instance_id_31589,neo4jlabs_demo_db_network
What is the runtime of the video 'Jonah: A VeggieTales Movie'?,MATCH (v:Video {title: 'Jonah: A VeggieTales Movie'}) RETURN v.runtime,neo4jLabs_synthetic_gemini,instance_id_34427,neo4jlabs_demo_db_eoflix
Which Countries have the most Entities as originators in Filings?,"MATCH (c:Country)<-[:COUNTRY]-(e:Entity)<-[:ORIGINATOR]-(f:Filing) WITH c, count(e) AS entity_count RETURN c.name AS country, entity_count ORDER BY entity_count DESC LIMIT 10",neo4jLabs_synthetic_gpt4o,instance_id_41076,neo4jlabs_demo_db_fincen
List all orders with a freight cost less than 10.,MATCH (o:Order) WHERE o.freight < '10' RETURN o,neo4jLabs_synthetic_gpt4turbo,instance_id_21763,neo4jlabs_demo_db_northwind
Which movies are associated with the genre 'Animation'?,MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Animation'}) RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_23600,neo4jlabs_demo_db_eoflix
Retrieve the top five movies released in the 2000s that were either directed or produced by the same person.,"MATCH (p:Person)-[r:DIRECTED|PRODUCED]->(m:Movie) WHERE m.released >= 2000 AND m.released < 2010 WITH m, COUNT(r) AS involvementCount ORDER BY involvementCount DESC, m.released DESC RETURN m.title, m.released, involvementCount LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_24075,neo4jlabs_demo_db_movies
What is the average runtime of movies released in each decade since 1950?,"MATCH (m:Movie) WHERE m.year >= 1950 WITH floor((m.year / 10)) * 10 AS decade, m.runtime AS runtime WITH decade, avg(runtime) AS average_runtime RETURN decade, average_runtime ORDER BY decade",neo4jLabs_synthetic_gemini,instance_id_29413,neo4jlabs_demo_db_recommendations
