question,cypher,data_source,instance_id,database_reference_alias
"What is the average number of favorites for tweets that are replies to tweets posted by the user with screen name ""neo4j""?","MATCH (u:User {screen_name: ""neo4j""})-[:POSTS]->(t:Tweet)<-[:REPLY_TO]-(reply:Tweet) RETURN avg(reply.favorites) AS average_favorites",neo4jLabs_synthetic_gemini,instance_id_34663,neo4jlabs_demo_db_twitter
What is the title of the movie with the lowest rating?,"MATCH (m:Movie)<-[r:REVIEWED]-() RETURN m.title, r.rating ORDER BY r.rating LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32739,neo4jlabs_demo_db_movies
List all the movies where the roles list contains more than 4 characters.,"MATCH (p:Person)-[r:ACTED_IN]->(m:Movie) WHERE size(r.roles) > 4 RETURN m.title, r.roles",neo4jLabs_synthetic_gpt4turbo,instance_id_23294,neo4jlabs_demo_db_movies
What is the average runtime of movies that are classified as both 'Horror' and 'Thriller'?,MATCH (m:Movie)-[:IN_GENRE]->(g1:Genre {name: 'Horror'}) MATCH (m)-[:IN_GENRE]->(g2:Genre {name: 'Thriller'}) WITH avg(m.runtime) AS average_runtime RETURN average_runtime,neo4jLabs_synthetic_gemini,instance_id_34645,neo4jlabs_demo_db_eoflix
Find all movies where Tom Hanks is listed first in the cast.,"MATCH (p:Person {name: ""Tom Hanks""})-[:CAST_FOR {order: 0}]->(m:Movie) RETURN m.title AS MovieTitle, m.release_date AS ReleaseDate, m.overview AS Overview",neo4jLabs_synthetic_gpt4o,instance_id_39579,neo4jlabs_demo_db_eoflix
Show the top 3 Filings with the earliest begin dates.,MATCH (f:Filing) RETURN f ORDER BY f.begin LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21469,neo4jlabs_demo_db_fincen
Find the top 5 orders with the most different products included.,"MATCH (o:Order)-[r:ORDERS]->(p:Product) WITH o, COUNT(DISTINCT p.productID) AS productCount ORDER BY productCount DESC LIMIT 5 RETURN o.orderID AS orderID, productCount",neo4jLabs_synthetic_gpt4o,instance_id_45258,neo4jlabs_demo_db_northwind
"What is the internal ID of the entity named ""HOTFOCUS CO., LTD.""?","MATCH (e:Entity {name: ""HOTFOCUS CO., LTD.""}) RETURN e.internal_id",neo4jLabs_synthetic_gemini,instance_id_30599,neo4jlabs_demo_db_offshoreleaks
What are the three highest freight values in orders?,MATCH (o:Order) RETURN o.freight ORDER BY o.freight DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21822,neo4jlabs_demo_db_northwind
What is the average `unitPrice` of products that are currently discontinued?,MATCH (p:Product) WHERE p.discontinued = true WITH avg(p.unitPrice) AS averagePrice RETURN averagePrice,neo4jLabs_synthetic_gemini,instance_id_32189,neo4jlabs_demo_db_northwind
"""Which supplier is the most frequent one fulfilling orders containing beverages?""","MATCH (s:Supplier)-[:SUPPLIES]->(p:Product)-[:PART_OF]->(c:Category {categoryName: ""Beverages""}),       (p)<-[:ORDERS]-(:Order) WITH s, COUNT(*) AS ordersCount RETURN s.companyName AS SupplierName ORDER BY ordersCount DESC LIMIT 1",neo4j_crowdsourced,instance_id_27592,neo4jlabs_demo_db_northwind
List the first 3 games played by streams that have a URL containing 'twitch.tv'.,MATCH (s:Stream)-[:PLAYS]->(g:Game) WHERE s.url CONTAINS 'twitch.tv' RETURN g.name AS Game LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24449,neo4jlabs_demo_db_twitch
"""Find friends (mutual followers) of a user""","MATCH (u1:User)-[:FOLLOWS]->(u2:User)<-[:FOLLOWS]-(u1) RETURN u1, u2",neo4j_crowdsourced,instance_id_27457,neo4jlabs_demo_db_twitter
List the top 3 countries based on the number of beneficiary banks they have.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country) WITH c, count(e) AS num_beneficiary_banks ORDER BY num_beneficiary_banks DESC RETURN c.name AS country_name, num_beneficiary_banks LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21510,neo4jlabs_demo_db_fincen
What are the last known statuses of entities that were incorporated in January 2006?,"MATCH (e:Entity) WHERE e.incorporation_date STARTS WITH ""JAN-2006"" RETURN e.name, e.status",neo4jLabs_synthetic_gpt4turbo,instance_id_21295,neo4jlabs_demo_db_offshoreleaks
List the top 5 movies with the most production companies involved.,"MATCH (m:Movie)-[:PRODUCED_BY]->(pc:ProductionCompany) WITH m, count(pc) AS num_companies ORDER BY num_companies DESC LIMIT 5 RETURN m.title, num_companies",neo4jLabs_synthetic_gpt4turbo,instance_id_23347,neo4jlabs_demo_db_eoflix
What is the jurisdiction_description of the entity with internal_id '1001256'?,MATCH (e:Entity {internal_id: '1001256'}) RETURN e.jurisdiction_description,neo4jLabs_synthetic_gemini,instance_id_30954,neo4jlabs_demo_db_offshoreleaks
List the top 5 movies that have generated revenue more than 500 million USD.,MATCH (m:Movie) WHERE m.revenue > 500000000 RETURN m ORDER BY m.revenue DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_25408,neo4jlabs_demo_db_recommendations
Which orders were shipped to 'France' and required before '1997-01-01'?,MATCH (o:Order) WHERE o.shipCountry = 'France' AND o.requiredDate < '1997-01-01 00:00:00.000' RETURN o,neo4jLabs_synthetic_gpt4turbo,instance_id_20386,neo4jlabs_demo_db_northwind
List the first 3 people who have a profile path starting with '/p'.,MATCH (p:Person) WHERE p.profile_path STARTS WITH '/p' RETURN p LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20711,neo4jlabs_demo_db_eoflix
List the top 3 movies with the most revenue that were released before the year 2000.,"MATCH (m:Movie) WHERE m.release_date < date('2000-01-01') RETURN m.title, m.revenue ORDER BY m.revenue DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_39582,neo4jlabs_demo_db_eoflix
"Name the first 5 movies that were rated by users on a specific date, e.g., '2020-01-01'.",MATCH (m:Movie)<-[:RATED]-(u:User)-[r:RATED]->(m) WHERE r.timestamp = date('2020-01-01') RETURN m.title AS MovieTitle LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23184,neo4jlabs_demo_db_eoflix
What is the total revenue generated by orders shipped to 'Brazil'?,"MATCH (o:Order)-[rel:ORDERS]->(p:Product) WHERE o.shipCountry = 'Brazil' WITH o, SUM(toFloat(rel.quantity) * toFloat(rel.unitPrice)) AS orderRevenue RETURN SUM(orderRevenue) AS totalRevenue",neo4jLabs_synthetic_gemini,instance_id_32305,neo4jlabs_demo_db_northwind
List the first 5 movies with a tagline containing 'end' that were reviewed with a rating above 75.,"MATCH (m:Movie)-[r:REVIEWED]->() WHERE m.tagline CONTAINS 'end' AND r.rating > 75 RETURN m.title, m.tagline, r.rating ORDER BY m.released LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23741,neo4jlabs_demo_db_movies
"""Where did Keanu Reeves play?""",MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE p.name = 'Keanu Reeves' RETURN m.title,neo4j_crowdsourced,instance_id_27882,neo4jlabs_demo_db_movies
What are the dependencies of the service named 'java' that started after 1605733619064?,"MATCH (s:Service {name: 'java'}) WHERE s.startTime > 1605733619064 MATCH (s)-[:INSTANCE|DEPENDS_ON*]->(dependency) RETURN s.name AS ServiceName, s.startTime AS StartTime, COLLECT(dependency.name) AS Dependencies",neo4jLabs_synthetic_gpt4turbo,instance_id_20215,neo4jlabs_demo_db_network
List the first 3 filings where the beneficiary bank and the filer organization name are the same.,MATCH (f:Filing) WHERE f.beneficiary_bank = f.filer_org_name RETURN f ORDER BY f.begin LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_41307,neo4jlabs_demo_db_fincen
What is the 'location' of the user who has posted the most tweets containing the word 'database'?,"MATCH (u:User)-[:POSTS]->(t:Tweet) WHERE toLower(t.text) CONTAINS 'database' WITH u, count(t) AS tweetCount ORDER BY tweetCount DESC WITH u, tweetCount LIMIT 1 RETURN u.location",neo4jLabs_synthetic_gemini,instance_id_33848,neo4jlabs_demo_db_twitter
List the entities with a closed date and their closed dates.,"MATCH (e:Entity) WHERE e.closed_date IS NOT NULL RETURN e.name AS entity_name, e.closed_date",neo4jLabs_synthetic_gpt4o,instance_id_44912,neo4jlabs_demo_db_offshoreleaks
Which genre has the most movies with a female lead?,"MATCH (m:Movie)<-[cf:CAST_FOR]-(p:Person) WHERE p.gender = 1 WITH m, cf, p MATCH (m)-[:IN_GENRE]->(g:Genre) WITH g, count(DISTINCT m) AS movieCount RETURN g.name AS genreName, movieCount ORDER BY movieCount DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_31898,neo4jlabs_demo_db_eoflix
Find the top 3 orders by freight cost.,MATCH (o:Order) RETURN o ORDER BY o.freight DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20497,neo4jlabs_demo_db_northwind
Which 3 filings have the longest duration from begin to end date?,"MATCH (f:Filing) WITH f, duration.between(f.begin, f.end) AS duration ORDER BY duration DESC LIMIT 3 RETURN f.sar_id AS SAR_ID, f.begin AS BeginDate, f.end AS EndDate, duration AS Duration",neo4jLabs_synthetic_gpt4o,instance_id_41263,neo4jlabs_demo_db_fincen
List the first 3 products in the 'Confections' category with the most units on order.,"MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Confections'}) WHERE p.unitsOnOrder IS NOT NULL RETURN p.productName, p.unitsOnOrder ORDER BY p.unitsOnOrder DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20356,neo4jlabs_demo_db_northwind
"""what are some movies by keanu reeves?""","MATCH (p:Person {name: ""Keanu Reeves""})-[:ACTED_IN]->(m:Movie) RETURN m.title",neo4j_crowdsourced,instance_id_27321,neo4jlabs_demo_db_movies
Show the top 5 countries with the most filings where they are both originator and beneficiary in transactions involving multiple currencies.,"MATCH (c:Country)<-[:COUNTRY]-(e:Entity)-[:FILED]->(f:Filing)-[:ORIGINATOR|BENEFITS]->(e2:Entity)-[:COUNTRY]->(c2:Country) WHERE c.code <> c2.code WITH c, count(DISTINCT f) AS filingsCount ORDER BY filingsCount DESC LIMIT 5 RETURN c.name AS Country, filingsCount",neo4jLabs_synthetic_gpt4turbo,instance_id_21520,neo4jlabs_demo_db_fincen
List the first 3 tweets posted using the source named 'Buffer'.,MATCH (t:Tweet)-[:USING]->(s:Source {name: 'Buffer'}) RETURN t ORDER BY t.created_at LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24912,neo4jlabs_demo_db_twitter
What is the name of the Application that has the most dependencies?,"MATCH (app:Application)-[d:DEPENDS_ON]->() WITH app, size(collect(d)) AS num_dependencies RETURN app.name ORDER BY num_dependencies DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32428,neo4jlabs_demo_db_network
List the first 3 networks connected to the interface with IP '10.0.0.254'.,MATCH (i:Interface {ip: '10.0.0.254'})-[:ROUTES]->(n:Network) RETURN n LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20958,neo4jlabs_demo_db_network
What is the highest rated movie in the database?,"MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WITH m, r.rating AS rating ORDER BY rating DESC RETURN m.title, rating LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32894,neo4jlabs_demo_db_movies
What are the names of the top 3 entities that originated filings with amounts over 1000000?,"MATCH (e:Entity)-[:FILED]->(f:Filing) WHERE f.amount > 1000000 WITH e, COUNT(f) AS num_filings ORDER BY num_filings DESC LIMIT 3 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_41132,neo4jlabs_demo_db_fincen
What is the most common country code for all entities?,"MATCH (e:Entity) WITH e.country_codes AS country_code, count(e) AS count ORDER BY count DESC RETURN country_code, count LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_30934,neo4jlabs_demo_db_offshoreleaks
Find the top 5 actors who have acted in more than 10 movies.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WITH a, COUNT(m) AS movieCount WHERE movieCount > 10 RETURN a.name AS actorName, movieCount ORDER BY movieCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_42464,neo4jlabs_demo_db_recommendations
List the first 3 genres of movies that have an average runtime greater than 120 minutes.,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WITH g, avg(m.runtime) AS average_runtime WHERE average_runtime > 120 RETURN DISTINCT g.name AS genre_name, average_runtime ORDER BY average_runtime DESC LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_29660,neo4jlabs_demo_db_recommendations
List the names of people who have acted in movies with less than 40 votes.,MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.votes < 40 RETURN p.name,neo4jLabs_synthetic_gemini,instance_id_32727,neo4jlabs_demo_db_movies
Find all orders shipped to 'Reims' with a freight cost less than $50.,"MATCH (o:Order) WHERE o.shipCity = 'Reims' AND toFloat(o.freight) < 50 RETURN o.orderID, o.shipName, o.requiredDate, o.shipCity, o.shipPostalCode, o.shippedDate, o.freight, o.orderDate, o.shipAddress, o.customerID, o.shipCountry, o.shipVia, o.shipRegion",neo4jLabs_synthetic_gpt4o,instance_id_45146,neo4jlabs_demo_db_northwind
List the three entities with the most filings where the originator bank is located in Singapore.,"MATCH (e:Entity)-[:FILED]->(f:Filing) WHERE f.originator_bank_country = ""Singapore"" WITH e, COUNT(f) AS num_filings ORDER BY num_filings DESC LIMIT 3 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_41081,neo4jlabs_demo_db_fincen
List the first 3 orders shipped to Berlin with a freight cost over $100.,"MATCH (o:Order)-[:PURCHASED]->(c:Customer {city: ""Berlin""}) WHERE o.freight > 100 AND o.shippedDate IS NOT NULL RETURN o ORDER BY o.shippedDate LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20400,neo4jlabs_demo_db_northwind
What is the average number of officers per entity for entities that have a 'struck_off_date'?,"MATCH (e:Entity)<-[:officer_of]-(o:Officer) WHERE e.struck_off_date IS NOT NULL WITH e, count(o) AS num_officers RETURN avg(num_officers) AS average_officers_per_entity",neo4jLabs_synthetic_gemini,instance_id_30536,neo4jlabs_demo_db_offshoreleaks
List the top 5 entities by the number of filings concerning them in 2013.,"MATCH (f:Filing)-[:CONCERNS]->(e:Entity) WHERE f.begin >= datetime('2013-01-01T00:00:00Z') AND f.end <= datetime('2013-12-31T23:59:59Z') WITH e, count(f) AS num_filings ORDER BY num_filings DESC LIMIT 5 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_41091,neo4jlabs_demo_db_fincen
List the movies released after 2000 in chronological order.,"MATCH (m:Movie) WHERE m.released > 2000 RETURN m.title, m.released  ORDER BY m.released",neo4jLabs_synthetic_gemini,instance_id_32755,neo4jlabs_demo_db_movies
List the top 5 entities that have benefited from the highest total amount of filings.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WITH e, sum(f.amount) AS totalAmount ORDER BY totalAmount DESC RETURN e.name AS entityName, totalAmount LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_28221,neo4jlabs_demo_db_fincen
List the first 3 customers who have ordered 'Chai' and are from 'Portland'.,MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) WHERE p.productName = 'Chai' AND c.city = 'Portland' RETURN c LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20392,neo4jlabs_demo_db_northwind
"""Which collection has the lowest average user rating? Only consider collections that have at least five ratings.""","MATCH (u:User)-[r:RATED]->(m:Movie)-[:IN_COLLECTION]->(c:Collection) WITH c, AVG(r.rating) AS avg_rating, COUNT(r) AS num_ratings WHERE num_ratings >= 5 RETURN c.name AS collection_name, avg_rating ORDER BY avg_rating ASC LIMIT 1",neo4j_crowdsourced,instance_id_27388,neo4jlabs_demo_db_eoflix
What are the order IDs for orders containing products from more than three different categories?,"MATCH (o:Order)-[:ORDERS]->(p:Product)-[:PART_OF]->(c:Category) WITH o, count(DISTINCT c) AS numCategories WHERE numCategories > 3 RETURN o.orderID AS OrderID",neo4jLabs_synthetic_gpt4turbo,instance_id_22026,neo4jlabs_demo_db_northwind
Find the entities that have a relationship with the officer with icij_id 'C0FCC85C73FE8405CBF5FD732A6787E5'.,MATCH (o:Officer {icij_id: 'C0FCC85C73FE8405CBF5FD732A6787E5'})-[r]-(e) RETURN e,neo4jLabs_synthetic_gemini,instance_id_31002,neo4jlabs_demo_db_offshoreleaks
Identify all 'Other' nodes with a jurisdiction of 'AW' and their types.,"MATCH (o:Other {jurisdiction: 'AW'}) RETURN o.node_id, o.name, o.type",neo4jLabs_synthetic_gpt4turbo,instance_id_21154,neo4jlabs_demo_db_offshoreleaks
List the first 3 languages used in movies with an original title 'Toy Story'.,MATCH (m:Movie {original_title: 'Toy Story'})-[:ORIGINAL_LANGUAGE]->(l:Language) RETURN l.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23544,neo4jlabs_demo_db_eoflix
Which orders were placed before '1997-01-01' and have a freight greater than 100?,MATCH (o:Order) WHERE o.orderDate < '1997-01-01' AND toFloat(o.freight) > 100 RETURN o,neo4jLabs_synthetic_gpt4turbo,instance_id_21818,neo4jlabs_demo_db_northwind
List the top 3 genres with the most movies associated with them.,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WITH g, count(m) AS movieCount ORDER BY movieCount DESC LIMIT 3 RETURN g.name AS genre, movieCount",neo4jLabs_synthetic_gpt4o,instance_id_42753,neo4jlabs_demo_db_recommendations
List all the actors who have starred in a movie with a runtime greater than 3 hours.,MATCH (m:Movie) WHERE m.runtime > 180 MATCH (a:Actor)-[:ACTED_IN]->(m) RETURN DISTINCT a.name,neo4jLabs_synthetic_gemini,instance_id_29420,neo4jlabs_demo_db_recommendations
What are the names of entities that have been inactivated on '18-FEB-2013'?,MATCH (e:Entity {inactivation_date: '18-FEB-2013'}) RETURN e.name,neo4jLabs_synthetic_gpt4turbo,instance_id_21954,neo4jlabs_demo_db_offshoreleaks
Which 3 beneficiary banks have been involved in filings with the highest total amounts?,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) RETURN e.name AS BeneficiaryBank, sum(f.amount) AS TotalAmount ORDER BY TotalAmount DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21455,neo4jlabs_demo_db_fincen
Which movies have a homepage listed?,"MATCH (m:Movie) WHERE m.homepage IS NOT NULL RETURN m.title, m.homepage",neo4jLabs_synthetic_gpt4turbo,instance_id_23425,neo4jlabs_demo_db_eoflix
"List the first 5 Intermediaries with the status ""INACTIVE"".","MATCH (i:Intermediary) WHERE i.status = ""INACTIVE"" RETURN i.name LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_30741,neo4jlabs_demo_db_offshoreleaks
List the first 3 movies that have a homepage listed.,"MATCH (m:Movie) WHERE m.homepage IS NOT NULL RETURN m.title, m.homepage ORDER BY m.title LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44336,neo4jlabs_demo_db_eoflix
Identify the 3 most frequent ship countries for orders from 'Alfreds Futterkiste'.,"MATCH (c:Customer {companyName: ""Alfreds Futterkiste""})-[:PURCHASED]->(o:Order) RETURN o.shipCountry AS ShipCountry, count(o) AS NumberOfOrders ORDER BY NumberOfOrders DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21919,neo4jlabs_demo_db_northwind
What is the total number of movies released in each country?,"MATCH (m:Movie) UNWIND m.countries AS country WITH country, count(*) AS movieCount RETURN country, movieCount",neo4jLabs_synthetic_gemini,instance_id_29340,neo4jlabs_demo_db_recommendations
"""which movies have the lowest rating""","MATCH (:Person)-[r:REVIEWED]->(m:Movie) RETURN m.title AS Movie, r.rating AS Rating ORDER BY r.rating ASC LIMIT 1",neo4j_crowdsourced,instance_id_27478,neo4jlabs_demo_db_movies
List all movies with exactly 5 roles in the 'ACTED_IN' relationship.,"MATCH (p:Person)-[r:ACTED_IN]->(m:Movie) WHERE size(r.roles) = 5 RETURN m.title, collect(p.name) AS actors",neo4jLabs_synthetic_gpt4turbo,instance_id_23379,neo4jlabs_demo_db_movies
Which 3 entities filed the most filings between 2010 and 2015?,"MATCH (e:Entity)-[:FILED]->(f:Filing) WHERE f.begin >= datetime('2010-01-01T00:00:00Z') AND f.end <= datetime('2015-12-31T23:59:59Z') RETURN e.name, count(f) AS filings_count ORDER BY filings_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21480,neo4jlabs_demo_db_fincen
What are the names of the 3 newest teams in the database?,MATCH (t:Team) RETURN t.name ORDER BY t.createdAt DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_25431,neo4jlabs_demo_db_twitch
List the top 5 most common countries for registered Intermediaries.,"MATCH (i:Intermediary) UNWIND i.countries AS country WITH country, COUNT(*) AS count ORDER BY count DESC RETURN country, count LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_30731,neo4jlabs_demo_db_offshoreleaks
List the top 3 highest revenue movies released in the 2000s.,"MATCH (m:Movie) WHERE m.year >= 2000 AND m.year < 2010 RETURN m.title, m.revenue ORDER BY m.revenue DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42451,neo4jlabs_demo_db_recommendations
Which applications are listening on port 80?,MATCH (app:Application)-[:LISTENS]->(p:Port {port: 80}) RETURN app.name AS applicationName,neo4jLabs_synthetic_gemini,instance_id_31569,neo4jlabs_demo_db_network
List the movies where the plot mentions 'friendship' and the budget was under 20 million dollars.,MATCH (m:Movie) WHERE m.plot CONTAINS 'friendship' AND m.budget < 20000000 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_25268,neo4jlabs_demo_db_recommendations
List the first 3 videos that have been produced in more than one country.,"MATCH (v:Video)-[:PRODUCED_IN_COUNTRY]->(c:Country) WITH v, COUNT(c) AS countryCount WHERE countryCount > 1 RETURN v.title AS VideoTitle, countryCount ORDER BY countryCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44339,neo4jlabs_demo_db_eoflix
List the officers that have a valid status up until 2015 and are linked to Samoa.,"MATCH (o:Officer)-[:officer_of]->(e:Entity) WHERE o.valid_until CONTAINS ""2015"" AND e.jurisdiction_description = ""Samoa"" RETURN o.name",neo4jLabs_synthetic_gpt4o,instance_id_44944,neo4jlabs_demo_db_offshoreleaks
List all movies produced by 'Pixar Animation Studios'.,MATCH (p:ProductionCompany {name: 'Pixar Animation Studios'})-[:PRODUCED_BY]-(m:Movie) RETURN m.title AS MovieTitle,neo4jLabs_synthetic_gpt4o,instance_id_44440,neo4jlabs_demo_db_eoflix
Which actor has the highest total gross revenue for all their movies?,"MATCH (actor:Actor)-[:ACTED_IN]->(movie:Movie) WITH actor, sum(movie.revenue) AS totalRevenue RETURN actor.name AS actorName, totalRevenue ORDER BY totalRevenue DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29735,neo4jlabs_demo_db_recommendations
Which director has the highest ratio of box office revenue to budget?,"MATCH (d:Director)-[:DIRECTED]->(m:Movie) WITH d, m, CASE WHEN m.budget > 0 THEN toFloat(m.revenue) / toFloat(m.budget) ELSE 0.0 END AS ratio WITH d, max(ratio) AS maxRatio ORDER BY maxRatio DESC RETURN d.name AS director, maxRatio LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29774,neo4jlabs_demo_db_recommendations
"What is the average number of followers for users who chat on streams that belong to the ""ESO Stream Team""?","MATCH (team:Team {name: ""ESO Stream Team""}) WITH team MATCH (team)<-[:HAS_TEAM]-(stream:Stream) WITH stream MATCH (stream)<-[:CHATTER]-(user:User) WITH avg(user.followers) AS average_followers RETURN average_followers",neo4jLabs_synthetic_gemini,instance_id_34073,neo4jlabs_demo_db_twitch
What is the average 'unitPrice' of products supplied by suppliers based in the UK?,MATCH (s:Supplier {country: 'UK'})-[:SUPPLIES]->(p:Product) RETURN avg(p.unitPrice) AS averagePrice,neo4jLabs_synthetic_gemini,instance_id_32228,neo4jlabs_demo_db_northwind
What is the name of the Software that has the most outgoing connections to other Software?,"MATCH (s:Software)-[r:DEPENDS_ON]->(t:Software) WITH s, count(r) AS num_connections ORDER BY num_connections DESC RETURN s.name, num_connections LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32465,neo4jlabs_demo_db_network
What are the top 5 filings with the earliest begin dates?,"MATCH (f:Filing) WITH f ORDER BY f.begin ASC LIMIT 5 RETURN f.sar_id AS SAR_ID, f.begin AS BeginDate, f.end AS EndDate, f.amount AS Amount, f.originator_bank AS OriginatorBank, f.beneficiary_bank AS BeneficiaryBank",neo4jLabs_synthetic_gpt4o,instance_id_41289,neo4jlabs_demo_db_fincen
Which 3 products have the lowest unit price and are still in stock?,MATCH (p:Product) WHERE p.unitPrice IS NOT NULL AND p.unitsInStock > 0 RETURN p ORDER BY p.unitPrice ASC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20419,neo4jlabs_demo_db_northwind
List the movies where the spoken language is 'Gaeilge'.,MATCH (m:Movie)-[:SPOKEN_IN_LANGUAGE]->(l:Language {name: 'Gaeilge'}) RETURN m.title AS MovieTitle,neo4jLabs_synthetic_gpt4o,instance_id_44168,neo4jlabs_demo_db_eoflix
Which entities have an inactivation date on '18-FEB-2013' and a struck off date on '15-FEB-2013'?,MATCH (e:Entity) WHERE e.inactivation_date = '18-FEB-2013' AND e.struck_off_date = '15-FEB-2013' RETURN e,neo4jLabs_synthetic_gpt4turbo,instance_id_21231,neo4jlabs_demo_db_offshoreleaks
Which movies have a runtime longer than the average runtime of all movies?,MATCH (m:Movie) WITH avg(m.runtime) AS avgRuntime MATCH (movie:Movie) WHERE movie.runtime > avgRuntime RETURN movie,neo4jLabs_synthetic_gpt4turbo,instance_id_20752,neo4jlabs_demo_db_eoflix
"How many users are both chatters and VIPs of the stream with the name ""itsbigchase""?","MATCH (s:Stream {name: ""itsbigchase""}) MATCH (s)-[:CHATTER]->(user:User) MATCH (s)-[:VIP]->(user) RETURN count(DISTINCT user) AS count",neo4jLabs_synthetic_gemini,instance_id_33719,neo4jlabs_demo_db_twitch
Identify the first 5 racks that hold machines of type 'm'.,MATCH (r:Rack)-[:HOLDS]->(m:Machine)-[:TYPE]->(t:Type {type: 'm'}) RETURN r LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_20276,neo4jlabs_demo_db_network
Find all games played by streams that have at least one chatter who is also a moderator for another stream.,MATCH (s:Stream)-[:CHATTER]->(u:User)-[r:MODERATOR]->(:Stream) WITH DISTINCT s MATCH (s)-[:PLAYS]->(g:Game) RETURN DISTINCT g.name,neo4jLabs_synthetic_gemini,instance_id_33922,neo4jlabs_demo_db_twitch
List 3 directors who have never reviewed a movie.,MATCH (d:Person)-[:DIRECTED]->(:Movie) WHERE NOT exists{ (d)-[:REVIEWED]->(:Movie) } RETURN d.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24006,neo4jlabs_demo_db_movies
Find the orders that include at least one product with 'unitsOnOrder' > 0 and one product with 'unitsOnOrder' = 0.,"MATCH (o:Order)-[rel:ORDERS]->(p:Product) WHERE p.unitsOnOrder > 0 WITH o, collect(p) as productsGreaterThanZero MATCH (o)-[rel:ORDERS]->(p2:Product) WHERE p2.unitsOnOrder = 0 WITH o, productsGreaterThanZero, collect(p2) as productsEqualToZero WHERE size(productsGreaterThanZero) > 0 AND size(productsEqualToZero) > 0 RETURN DISTINCT o.orderID",neo4jLabs_synthetic_gemini,instance_id_32232,neo4jlabs_demo_db_northwind
Find out which 3 games are most frequently associated with streams having a 'VIP' relationship.,"MATCH (s:Stream)-[:VIP]->(:User) MATCH (s)-[:PLAYS]->(g:Game) RETURN g.name AS game, COUNT(s) AS stream_count ORDER BY stream_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43606,neo4jlabs_demo_db_twitch
List all actors who have a poster URL that includes 'smile' in it.,MATCH (a:Actor) WHERE a.poster CONTAINS 'smile' RETURN a,neo4jLabs_synthetic_gpt4turbo,instance_id_25174,neo4jlabs_demo_db_recommendations
How many suppliers are located in countries where there are no customers?,MATCH (s:Supplier) WHERE NOT EXISTS {   MATCH (c:Customer {country: s.country}) } WITH count(DISTINCT s) AS supplierCount RETURN supplierCount,neo4jLabs_synthetic_gemini,instance_id_32098,neo4jlabs_demo_db_northwind
Identify the top 5 tweets tagged with the hashtag 'education'.,MATCH (t:Tweet)-[:TAGS]->(h:Hashtag {name: 'education'}) RETURN t ORDER BY t.favorites DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24910,neo4jlabs_demo_db_twitter
List the top 5 movies that have been rated by the highest number of different users.,"MATCH (u:User)-[:RATED]->(m:Movie) WITH m, count(DISTINCT u) AS userCount ORDER BY userCount DESC LIMIT 5 RETURN m.title, userCount",neo4jLabs_synthetic_gpt4turbo,instance_id_25404,neo4jlabs_demo_db_recommendations
How many different categories of products do we have?,MATCH (p:Product)-[:PART_OF]->(c:Category) RETURN COUNT(DISTINCT c) AS NumberOfDifferentCategories,neo4jLabs_synthetic_gpt4turbo,instance_id_21664,neo4jlabs_demo_db_northwind
Which director has the most movies with a budget greater than 300 million?,"MATCH (m:Movie) WHERE m.budget > 300000000 WITH m MATCH (d:Director)-[:DIRECTED]->(m) WITH d, count(m) AS movieCount ORDER BY movieCount DESC RETURN d.name AS directorName, movieCount  LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29617,neo4jlabs_demo_db_recommendations
What are the top 5 suppliers based on the number of different cities they have shipped to?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product)<-[:ORDERS]-(o:Order)-[:PURCHASED]->(c:Customer) WITH s, COUNT(DISTINCT c.city) AS citiesShippedTo ORDER BY citiesShippedTo DESC LIMIT 5 RETURN s.companyName, citiesShippedTo",neo4jLabs_synthetic_gpt4turbo,instance_id_20393,neo4jlabs_demo_db_northwind
"What is the most frequent import method used for tweets that reply to tweets posted by the user with screen name ""neo4j""?","MATCH (user:User {screen_name: ""neo4j""})-[:POSTS]->(tweet:Tweet)<-[:REPLY_TO]->(reply:Tweet) WITH reply.import_method AS importMethod, count(*) AS count RETURN importMethod, count ORDER BY count DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_34660,neo4jlabs_demo_db_twitter
List the first 3 customers who have placed more than 5 orders.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WITH c, COUNT(o) AS orderCount WHERE orderCount > 5 RETURN c.customerID, c.companyName, orderCount ORDER BY orderCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45144,neo4jlabs_demo_db_northwind
List the top 5 movies that have not been reviewed.,"MATCH (m:Movie) WHERE NOT (m)<-[:REVIEWED]-(:Person) RETURN m.title AS title, m.released AS released ORDER BY m.released DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39407,neo4jlabs_demo_db_movies
List the first 3 streams that were created in 2018.,MATCH (s:Stream) WHERE s.createdAt >= datetime('2018-01-01T00:00:00Z') AND s.createdAt < datetime('2019-01-01T00:00:00Z') RETURN s ORDER BY s.createdAt ASC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24475,neo4jlabs_demo_db_twitch
List the first 3 products with '20 bags' in their quantity per unit description and a reorder level below 15.,MATCH (p:Product) WHERE p.quantityPerUnit CONTAINS '20 bags' AND p.reorderLevel < 15 RETURN p LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20367,neo4jlabs_demo_db_northwind
List the `productID` and `productName` of the first 3 products that have a `reorderLevel` higher than 20 and belong to the category 'Beverages'.,"MATCH (c:Category {categoryName: 'Beverages'}) MATCH (p:Product)-[:PART_OF]->(c) WHERE p.reorderLevel > 20 RETURN p.productID, p.productName LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_32223,neo4jlabs_demo_db_northwind
Find the customers who have placed orders that were shipped to the same city as their billing address.,MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE c.city = o.shipCity RETURN DISTINCT c.companyName,neo4jLabs_synthetic_gemini,instance_id_30814,neo4jlabs_demo_db_northwind
How many applications depend on the 'crm' service?,MATCH (app:Application)-[:DEPENDS_ON]->(service:Service {name: 'crm'}) RETURN count(app) AS numberOfApplications,neo4jLabs_synthetic_gpt4o,instance_id_43843,neo4jlabs_demo_db_network
Which country has the least number of entities that are originators?,"MATCH (e:Entity)-[:COUNTRY]->(c:Country) MATCH (f:Filing)-[:ORIGINATOR]->(e) WITH c, COUNT(DISTINCT e) AS originator_count RETURN c.name AS country, originator_count ORDER BY originator_count ASC LIMIT 1",neo4jLabs_synthetic_gpt4o,instance_id_41328,neo4jlabs_demo_db_fincen
List the top 5 most common sourceIDs for registered Entities.,"MATCH (e:Entity)<-[r:registered_address]-() WITH r.sourceID AS sourceID, count(*) AS entityCount ORDER BY entityCount DESC LIMIT 5 RETURN sourceID, entityCount",neo4jLabs_synthetic_gemini,instance_id_30653,neo4jlabs_demo_db_offshoreleaks
