question,cypher,data_source,instance_id,database_reference_alias
"Find the streams that have a moderator who also moderates a stream with the game ""Rust"" and has more than 5,000 followers and have the language ""en"" and have at least one VIP.","MATCH (s1:Stream)-[:HAS_LANGUAGE]->(l:Language {name: 'en'}) OPTIONAL MATCH (s1)-[:VIP]->(v) WITH s1, collect(DISTINCT v) AS vips WHERE size(vips) > 0 MATCH (s1)<-[:MODERATOR]-(u:User)-[:MODERATOR]->(s2:Stream)-[:PLAYS]->(g:Game {name: 'Rust'}) WHERE u.followers > 5000 RETURN DISTINCT s1.name",neo4jLabs_synthetic_gemini,instance_id_33734,neo4jlabs_demo_db_twitch
Find the actors who have acted in at least 5 movies with an IMDb rating above 7.0.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.imdbRating > 7.0 WITH a, count(m) AS moviesCount WHERE moviesCount >= 5 RETURN a.name",neo4jLabs_synthetic_gemini,instance_id_29795,neo4jlabs_demo_db_recommendations
Find the top 3 Countries based on the number of originating Filings.,"MATCH (c:Country)<-[:COUNTRY]-(e:Entity)<-[:ORIGINATOR]-(f:Filing) RETURN c.name AS Country, count(f) AS NumberOfOriginatingFilings ORDER BY NumberOfOriginatingFilings DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21437,neo4jlabs_demo_db_fincen
List the movies with a title containing only one word.,"MATCH (m:Movie) WHERE size(split(m.title, ' ')) = 1 RETURN m.title",neo4jLabs_synthetic_gemini,instance_id_32990,neo4jlabs_demo_db_movies
"What is the total budget of all movies produced by ""Pixar Animation Studios""?",MATCH (company:ProductionCompany {name: 'Pixar Animation Studios'}) WITH company MATCH (company)-[:PRODUCED_BY]->(movie:Movie) RETURN sum(movie.budget) AS totalBudget,neo4jLabs_synthetic_gemini,instance_id_32049,neo4jlabs_demo_db_eoflix
What are the IP addresses of the interfaces connected to the router DC1-RE?,MATCH (r:Router {name: 'DC1-RE'})-[:ROUTES]->(i:Interface) RETURN i.ip AS interface_ip,neo4jLabs_synthetic_gemini,instance_id_31574,neo4jlabs_demo_db_network
List the top 5 products that have been ordered more than 50 times.,"MATCH (:Order)-[o:ORDERS]->(p:Product) WITH p, SUM(o.quantity) AS totalQuantity WHERE totalQuantity > 50 RETURN p.productName, totalQuantity ORDER BY totalQuantity DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_45199,neo4jlabs_demo_db_northwind
"Who has produced, directed, and acted in the same movie?","MATCH (p:Person)-[:PRODUCED]->(m:Movie)<-[:DIRECTED]-(p)-[:ACTED_IN]->(m) RETURN p.name, m.title",neo4jLabs_synthetic_gpt4turbo,instance_id_24042,neo4jlabs_demo_db_movies
List the people who have directed and reviewed the same movie.,"MATCH (p:Person)-[:DIRECTED]->(m:Movie)<-[:REVIEWED]-(p) RETURN p.name, m.title",neo4jLabs_synthetic_gpt4turbo,instance_id_23730,neo4jlabs_demo_db_movies
What is the average freight cost of orders placed by customers in 'UK' and shipped to 'Germany'?,MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE c.country = 'UK' AND o.shipCountry = 'Germany' WITH toFloat(o.freight) AS freightValues RETURN avg(freightValues) AS averageFreight,neo4jLabs_synthetic_gemini,instance_id_32510,neo4jlabs_demo_db_northwind
Which streams have both a 'MODERATOR' and a 'VIP' relationship with the same user?,"MATCH (u:User)-[:MODERATOR]->(s:Stream)<-[:VIP]-(u) RETURN s.name AS streamName, u.name AS userName",neo4jLabs_synthetic_gpt4o,instance_id_43657,neo4jlabs_demo_db_twitch
What is the average number of tweets posted by users who have been mentioned by users who have retweeted tweets mentioning users followed by 'Neo4j'?,"MATCH (neo4j:User {screen_name: 'neo4j'})-[:FOLLOWS]->(followed:User) WITH followed MATCH (followed)<-[:MENTIONS]-(tweet1:Tweet)<-[:RETWEETS]-(tweeter:User) WITH DISTINCT tweeter MATCH (tweeter)<-[:MENTIONS]-(tweet2:Tweet)<-[:POSTS]-(author:User) WITH author, count(DISTINCT tweet2) AS tweetsCount WITH avg(tweetsCount) AS averageTweets RETURN averageTweets",neo4jLabs_synthetic_gemini,instance_id_34574,neo4jlabs_demo_db_twitter
Display the top 5 longest movies by runtime.,"MATCH (m:Movie) RETURN m.title, m.runtime ORDER BY m.runtime DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39630,neo4jlabs_demo_db_eoflix
List the names of all processes that have a dependency on the same service as the process with PID 2586.,MATCH (p:Process {pid: 2586})-[:DEPENDS_ON]->(s:Service) WITH s MATCH (s)<-[:DEPENDS_ON]-(other:Process) RETURN DISTINCT other.name AS processName,neo4jLabs_synthetic_gemini,instance_id_31736,neo4jlabs_demo_db_network
Identify the first 3 users who are moderators for streams with a description containing 'Belarus'.,MATCH (u:User)-[:MODERATOR]->(s:Stream) WHERE s.description CONTAINS 'Belarus' RETURN u LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24491,neo4jlabs_demo_db_twitch
List the first 3 categories and their descriptions.,"MATCH (c:Category) RETURN c.categoryName, c.description ORDER BY c.categoryName LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45068,neo4jlabs_demo_db_northwind
What is the average number of followers for users who have replied to tweets that mention users who have retweeted 'Neo4j's tweets?,MATCH (neo4j:User {screen_name: 'neo4j'})-[:POSTS]->(neo4jTweet:Tweet)<-[:RETWEETS]-(retweet:Tweet)-[:MENTIONS]->(mentionedUser:User) WITH distinct mentionedUser MATCH (mentionedUser)<-[:MENTIONS]-(tweetRepliedTo:Tweet)<-[:REPLY_TO]-(replyTweet:Tweet)-[:POSTS]->(replyUser:User) WITH avg(replyUser.followers) AS averageFollowers RETURN averageFollowers,neo4jLabs_synthetic_gemini,instance_id_34573,neo4jlabs_demo_db_twitter
"What are the distinct jurisdictions of entities associated with the service provider ""Appleby""?","MATCH (e:Entity) WHERE e.service_provider = ""Appleby"" WITH DISTINCT e.jurisdiction AS jurisdiction RETURN COLLECT(jurisdiction) AS jurisdictions",neo4jLabs_synthetic_gemini,instance_id_30581,neo4jlabs_demo_db_offshoreleaks
Find the 3 streams that play the least common games based on follower count.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WITH g, count(s) AS streamCount ORDER BY streamCount ASC LIMIT 1 MATCH (s2:Stream)-[:PLAYS]->(g) RETURN s2 ORDER BY s2.followers DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25573,neo4jlabs_demo_db_twitch
Find the address with the icij_id 'F969D23B2EDF91CAEBE119A675B61AAB'.,MATCH (a:Address {icij_id: 'F969D23B2EDF91CAEBE119A675B61AAB'}) RETURN a.address,neo4jLabs_synthetic_gemini,instance_id_31016,neo4jlabs_demo_db_offshoreleaks
How many streams have more than one language?,"MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WITH s, count(l) AS languageCount WHERE languageCount > 1 RETURN count(s) AS streamsWithMultipleLanguages",neo4jLabs_synthetic_gemini,instance_id_33710,neo4jlabs_demo_db_twitch
What is the most frequent source used in tweets that mention users with a betweenness centrality greater than 1000?,"MATCH (u:User)-[r:MENTIONS]-(t:Tweet)-[:USING]->(s:Source) WHERE u.betweenness > 1000 WITH s, count(t) AS sourceCount ORDER BY sourceCount DESC RETURN s.name AS sourceName, sourceCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_34716,neo4jlabs_demo_db_twitter
Which movies have a rating greater than 90?,MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE r.rating > 90 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32815,neo4jlabs_demo_db_movies
"List the names of the games played by streams that have VIP users with more than 5,000 followers.",MATCH (s:Stream)-[:VIP]->(vip:User) WHERE vip.followers > 5000 MATCH (s)-[:PLAYS]->(g:Game) RETURN DISTINCT g.name,neo4jLabs_synthetic_gemini,instance_id_33771,neo4jlabs_demo_db_twitch
"What is the average rating given by people who reviewed ""The Matrix""?","MATCH (m:Movie {title: ""The Matrix""})<-[r:REVIEWED]-() WITH avg(r.rating) AS average_rating RETURN average_rating",neo4jLabs_synthetic_gemini,instance_id_32824,neo4jlabs_demo_db_movies
"""which supplier supplies the most products?""","MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) RETURN s.companyName, COUNT(p) AS NumberOfProductsSupplied ORDER BY NumberOfProductsSupplied DESC LIMIT 1",neo4j_crowdsourced,instance_id_27597,neo4jlabs_demo_db_northwind
Show the top 5 originator banks by the total amount of transactions.,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WITH e.name AS originator_bank, SUM(f.amount) AS total_amount RETURN originator_bank, total_amount ORDER BY total_amount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41053,neo4jlabs_demo_db_fincen
List the first 3 products from suppliers located in 'USA'.,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE s.country = 'USA' RETURN p.productName AS productName, s.companyName AS supplierName LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45118,neo4jlabs_demo_db_northwind
Which country has the highest average `amount` for filings where the `beneficiary_bank` is located within its borders?,"MATCH (f:Filing) MATCH (b:Entity {id: f.beneficiary_bank_id})-[:COUNTRY]->(country:Country) WHERE f.beneficiary_iso = country.code WITH country.code AS country_code, avg(f.amount) AS avg_amount ORDER BY avg_amount DESC RETURN country_code, avg_amount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_28299,neo4jlabs_demo_db_fincen
List the top 5 games with the highest number of users who are chatters of streams playing them.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WITH g, s MATCH (s)-[:CHATTER]->(u:User) WITH g, count(DISTINCT u) AS chatterCount RETURN g.name AS gameName, chatterCount ORDER BY chatterCount DESC LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_34165,neo4jlabs_demo_db_twitch
Find the first 3 suppliers with products that have a reorder level of zero.,MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE p.reorderLevel = 0 RETURN s LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20402,neo4jlabs_demo_db_northwind
"""I am planning for an outage. how many webapps s fail if rack  DC1-RCK-1-1 goes offline.""","MATCH (:Rack {name: ""DC1-RCK-1-1""})-[:HOLDS]->(m:Machine)-[:RUNS]->(app:Application)-[:LISTENS]->(p:Port {port: 80}) RETURN COUNT(DISTINCT app) AS webapp_failures",neo4j_crowdsourced,instance_id_27661,neo4jlabs_demo_db_network
List the top 3 movies that have been directed by actors.,"MATCH (a:Actor)-[:DIRECTED]->(m:Movie) WITH m, COUNT(a) AS actorDirectors ORDER BY actorDirectors DESC, m.imdbRating DESC LIMIT 3 RETURN m.title AS MovieTitle, m.imdbRating AS IMDbRating, actorDirectors AS NumberOfActorDirectors",neo4jLabs_synthetic_gpt4o,instance_id_42046,neo4jlabs_demo_db_recommendations
List the first 3 categories with products that have been ordered more than 50 times.,"MATCH (c:Category)-[:PART_OF]-(p:Product)-[:ORDERS]-(o:Order) WITH c, count(o) AS ordersCount WHERE ordersCount > 50 RETURN c LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20357,neo4jlabs_demo_db_northwind
List the 3 movies with the highest average review ratings.,"MATCH (m:Movie)<-[r:REVIEWED]-(p:Person) WITH m, avg(r.rating) AS averageRating ORDER BY averageRating DESC LIMIT 3 RETURN m.title, averageRating",neo4jLabs_synthetic_gpt4turbo,instance_id_24001,neo4jlabs_demo_db_movies
Which users have mentioned 'Neo4j' in their tweets and have a following of more than 20000? Show the top 5.,"MATCH (u:User)-[:POSTS]->(t:Tweet)-[:MENTIONS]->(m:User {name: 'Neo4j'}) WHERE u.following > 20000 RETURN u.name, u.screen_name, u.following ORDER BY u.following DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_24893,neo4jlabs_demo_db_twitter
Identify the streams that are part of the 'ESO Stream Team'.,MATCH (s:Stream)-[:HAS_TEAM]->(t:Team {name: 'ESO Stream Team'}) RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_24363,neo4jlabs_demo_db_twitch
Which 3 movies feature both English and Japanese languages?,MATCH (m:Movie) WHERE 'English' IN m.languages AND 'Japanese' IN m.languages RETURN m LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24921,neo4jlabs_demo_db_recommendations
"How many Entities have an inactivation_date before ""01-JAN-2010""?","MATCH (e:Entity) WHERE e.inactivation_date < ""01-JAN-2010"" RETURN count(e) AS totalEntities",neo4jLabs_synthetic_gemini,instance_id_30647,neo4jlabs_demo_db_offshoreleaks
What are the top 3 most common languages spoken in the movies in the database?,"MATCH (m:Movie)-[:SPOKEN_IN_LANGUAGE]->(l:Language) WITH l, count(DISTINCT m) AS movieCount ORDER BY movieCount DESC LIMIT 3 RETURN l.name AS language, movieCount",neo4jLabs_synthetic_gemini,instance_id_34452,neo4jlabs_demo_db_eoflix
"""Which person has produced the most movies that have a rating higher than 95?""","MATCH (p:Person)-[:PRODUCED]->(m:Movie)<-[:REVIEWED]-(r:Person) WHERE r.rating > 95 RETURN p.name, COUNT(m) AS high_rating_movies ORDER BY high_rating_movies DESC LIMIT 1",neo4j_crowdsourced,instance_id_27421,neo4jlabs_demo_db_movies
What is the name of the Officer with the earliest lastEditTimestamp?,"MATCH (o:Officer) RETURN o.name, o.lastEditTimestamp ORDER BY o.lastEditTimestamp LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_30639,neo4jlabs_demo_db_offshoreleaks
List the first 3 genres that have movies with a runtime greater than 120 minutes.,MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WHERE m.runtime > 120 RETURN DISTINCT g.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_26022,neo4jlabs_demo_db_recommendations
Show the top 3 highest-grossing movies of the 2000s.,MATCH (m:Movie) WHERE m.year >= 2000 AND m.year < 2010 AND m.revenue IS NOT NULL RETURN m ORDER BY m.revenue DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24582,neo4jlabs_demo_db_recommendations
"List the names of the genres associated with the movie ""Toy Story"".","MATCH (m:Movie {title: ""Toy Story""}) MATCH (m)-[:IN_GENRE]->(g:Genre) RETURN g.name",neo4jLabs_synthetic_gemini,instance_id_29641,neo4jlabs_demo_db_recommendations
What is the total number of orders placed by the customer with `customerID` 'VINET'?,MATCH (c:Customer {customerID: 'VINET'})-[:PURCHASED]->(o:Order) RETURN count(o) AS TotalOrders,neo4jLabs_synthetic_gemini,instance_id_32163,neo4jlabs_demo_db_northwind
Identify the customers who have ordered products with a total discount of 0.,MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[r:ORDERS]->(p:Product) WHERE r.discount = '0' RETURN DISTINCT c AS CustomersWithNoDiscountOrders,neo4jLabs_synthetic_gpt4turbo,instance_id_22100,neo4jlabs_demo_db_northwind
Find the products that have a quantity on order greater than the average quantity on order for products in the same category.,"MATCH (p:Product)-[:PART_OF]->(c:Category) WITH c.categoryID AS categoryID, avg(p.unitsOnOrder) AS avgQuantityOnOrder MATCH (p:Product)-[:PART_OF]->(c:Category) WHERE p.unitsOnOrder > avgQuantityOnOrder AND c.categoryID = categoryID RETURN p.productName",neo4jLabs_synthetic_gemini,instance_id_30971,neo4jlabs_demo_db_northwind
"What is the average amount of filings where the beneficiary bank is located in a country with a name starting with ""U""?",MATCH (f:Filing)-[r:BENEFITS]->(e:Entity) WHERE f.beneficiary_bank_country STARTS WITH 'U' WITH avg(f.amount) AS averageAmount RETURN averageAmount,neo4jLabs_synthetic_gemini,instance_id_28239,neo4jlabs_demo_db_fincen
List the first 3 entities that are originators in filings where the originator bank is 'CIMB Bank Berhad' and the amount is above 500000.,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WHERE f.originator_bank = 'CIMB Bank Berhad' AND f.amount > 500000 RETURN e LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21571,neo4jlabs_demo_db_fincen
List the movies with a release year divisible by 5.,"MATCH (m:Movie) WHERE m.released % 5 = 0 RETURN m.title AS title, m.released AS year",neo4jLabs_synthetic_gemini,instance_id_32982,neo4jlabs_demo_db_movies
Find all tweets that 'neo4j' has retweeted from users located in 'Graphs Are Everywhere' and show the first 5.,MATCH (u:User {name: 'Neo4j'})-[:POSTS]->(rt:Tweet)-[:RETWEETS]->(t:Tweet)<-[:POSTS]-(other:User {location: 'Graphs Are Everywhere'}) RETURN t LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24204,neo4jlabs_demo_db_twitter
"""Can you map the global footprint of \""CF INDUSTRIES (BARBADOS) SRL\"" through its connections to officers and entities in different countries?""","MATCH (e:Entity {name: ""CF INDUSTRIES (BARBADOS) SRL""})-[:officer_of|intermediary_of|connected_to*]-(connectedEntities) WHERE connectedEntities:Entity OR connectedEntities:Officer RETURN e, connectedEntities",neo4j_crowdsourced,instance_id_27370,neo4jlabs_demo_db_offshoreleaks
"What is the ibcRUC of the entity with the name ""NINGBO SUNRISE ENTERPRISES UNITED CO., LTD.""?","MATCH (e:Entity {name: ""NINGBO SUNRISE ENTERPRISES UNITED CO., LTD.""}) RETURN e.ibcRUC",neo4jLabs_synthetic_gemini,instance_id_30568,neo4jlabs_demo_db_offshoreleaks
"What is the tagline of the movie ""The Matrix Revolutions""?","MATCH (m:Movie {title: ""The Matrix Revolutions""}) RETURN m.tagline",neo4jLabs_synthetic_gemini,instance_id_32890,neo4jlabs_demo_db_movies
"List the Filings where the amount is greater than $1,500,000.",MATCH (f:Filing) WHERE f.amount > 1500000 RETURN f,neo4jLabs_synthetic_gpt4turbo,instance_id_21462,neo4jlabs_demo_db_fincen
"What are the top 3 beneficiary banks that received filings where the originator bank is located in the country with code ""SGP"" and the beneficiary bank is located in the country with code ""GBR""?","MATCH (filing:Filing)-[:ORIGINATOR]->(originator:Entity)-[:COUNTRY]->(originatorCountry:Country) WHERE originatorCountry.code = ""SGP"" MATCH (filing)-[:BENEFITS]->(beneficiaryBank:Entity)-[:COUNTRY]->(beneficiaryCountry:Country) WHERE beneficiaryCountry.code = ""GBR"" WITH beneficiaryBank, count(filing) AS filingCount ORDER BY filingCount DESC LIMIT 3 RETURN beneficiaryBank.name, filingCount",neo4jLabs_synthetic_gemini,instance_id_28187,neo4jlabs_demo_db_fincen
List all actors who have never acted in an 'Action' genre movie.,MATCH (a:Actor) WHERE NOT EXISTS {   MATCH (a)-[:ACTED_IN]->(m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Action'}) } RETURN a.name,neo4jLabs_synthetic_gpt4o,instance_id_42110,neo4jlabs_demo_db_recommendations
"Find the filings where the originator entity's name contains ""AG"" and the amount is greater than 1000000.","MATCH (f:Filing)-[r:ORIGINATOR]->(e:Entity) WHERE e.name CONTAINS 'AG' AND f.amount > 1000000 RETURN f.id, f.amount",neo4jLabs_synthetic_gemini,instance_id_28096,neo4jlabs_demo_db_fincen
List the products ordered by 'VINET' customer.,MATCH (c:Customer {customerID: 'VINET'})-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) RETURN p.productName AS productName,neo4jLabs_synthetic_gpt4o,instance_id_45002,neo4jlabs_demo_db_northwind
List the top 5 orders in terms of quantity for the 'Dairy Products' category.,"MATCH (c:Category {categoryName: 'Dairy Products'})<-[:PART_OF]-(p:Product)<-[:ORDERS]-(o:Order) RETURN o.orderID AS orderID, SUM(o.quantity) AS totalQuantity ORDER BY totalQuantity DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44725,neo4jlabs_demo_db_northwind
Show the first 5 filings with the most entities involved as concerns from the same sector.,"MATCH (f:Filing)-[:CONCERNS]->(e:Entity) WITH f, COUNT(e) AS entityCount ORDER BY entityCount DESC LIMIT 5 MATCH (f)-[:CONCERNS]->(e:Entity)-[:COUNTRY]->(c:Country) RETURN f.sar_id AS FilingID, f.begin AS BeginDate, f.end AS EndDate, COLLECT(e.name) AS ConcernedEntities, c.name AS Country",neo4jLabs_synthetic_gpt4o,instance_id_41398,neo4jlabs_demo_db_fincen
Identify the top 5 entities by the number of filings they filed.,"MATCH (e:Entity)-[:FILED]->(f:Filing) WITH e, COUNT(f) AS num_filings ORDER BY num_filings DESC LIMIT 5 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_41208,neo4jlabs_demo_db_fincen
What is the average number of entities that are 'intermediary_of' by intermediaries with a 'status' of 'INACTIVE'?,"MATCH (i:Intermediary {status: 'INACTIVE'})-[:intermediary_of]->(e:Entity) WITH i, count(e) AS numEntities WITH avg(numEntities) AS averageEntities RETURN averageEntities",neo4jLabs_synthetic_gemini,instance_id_30625,neo4jlabs_demo_db_offshoreleaks
Show the first 3 movies with the most complex role lists in the 'ACTED_IN' relationship.,"MATCH (p:Person)-[r:ACTED_IN]->(m:Movie) RETURN m.title, r.roles ORDER BY size(r.roles) DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23364,neo4jlabs_demo_db_movies
"What is the average `amount` of filings where the `beneficiary_bank` is ""Barclays Bank Plc""?","MATCH (filing:Filing) WHERE filing.beneficiary_bank = ""Barclays Bank Plc"" WITH avg(filing.amount) AS average_amount RETURN average_amount",neo4jLabs_synthetic_gemini,instance_id_28103,neo4jlabs_demo_db_fincen
Retrieve the top five people who have reviewed a movie with a rating less than 50.,"MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE r.rating < 50 RETURN p.name, COUNT(r) AS review_count ORDER BY review_count DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_40151,neo4jlabs_demo_db_movies
What is the most common genre among movies that grossed over 500 million dollars?,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WHERE m.revenue > 500000000 WITH g, count(DISTINCT m) AS movieCount ORDER BY movieCount DESC RETURN g.name AS genre, movieCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_34626,neo4jlabs_demo_db_eoflix
Find the entities that are connected to the officer with the icij_id 'CB195B5424E13A74A6F3BC719050A2B9' through the 'officer_of' relationship.,MATCH (o:Officer {icij_id: 'CB195B5424E13A74A6F3BC719050A2B9'})-[r:officer_of]->(e) RETURN e.name,neo4jLabs_synthetic_gemini,instance_id_30990,neo4jlabs_demo_db_offshoreleaks
"What are the top 3 countries that received filings from the entity with id ""the-bank-of-new-york-mellon-corp"" with an amount greater than 1000000?","MATCH (e:Entity {id: 'the-bank-of-new-york-mellon-corp'})-[:FILED]->(f:Filing) WHERE f.amount > 1000000 MATCH (f)-[:CONCERNS]->(be:Entity)-[:COUNTRY]->(c:Country) WITH c, count(f) AS filingCount ORDER BY filingCount DESC LIMIT 3 RETURN c.name",neo4jLabs_synthetic_gemini,instance_id_28180,neo4jlabs_demo_db_fincen
List all movies released after 2000.,MATCH (m:Movie) WHERE m.released > 2000 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_23891,neo4jlabs_demo_db_movies
Name the top 5 adult videos that were produced in Italy.,"MATCH (a:Adult)-[:PRODUCED_IN_COUNTRY]->(c:Country {id: ""IT""}) RETURN a.title AS Title, a.id AS ID ORDER BY a.popularity DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23236,neo4jlabs_demo_db_eoflix
"List the processes that have a dependency on the service ""java"".","MATCH (s:Service {name: ""java""})<-[:DEPENDS_ON]-(p:Process) RETURN p.name AS process_name",neo4jLabs_synthetic_gemini,instance_id_31567,neo4jlabs_demo_db_network
What are the IP addresses of the interfaces routed by the egress router DC1-RE?,"MATCH (egress:Egress {name: ""DC1-RE""})-[:ROUTES]->(interface:Interface) RETURN interface.ip",neo4jLabs_synthetic_gemini,instance_id_31563,neo4jlabs_demo_db_network
List the first 3 movies with a budget over 50 million.,MATCH (m:Movie) WHERE m.budget > 50000000 RETURN m ORDER BY m.release_date LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23448,neo4jlabs_demo_db_eoflix
Identify the top 5 entities by number of filings where the beneficiary bank is 'Barclays Bank Plc'.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WHERE f.beneficiary_bank = 'Barclays Bank Plc' WITH e, count(f) AS filingsCount ORDER BY filingsCount DESC LIMIT 5 RETURN e.name, filingsCount",neo4jLabs_synthetic_gpt4turbo,instance_id_26854,neo4jlabs_demo_db_fincen
Identify the top 3 filings where the originator and beneficiary banks are in the same country.,"MATCH (f:Filing)-[:ORIGINATOR]->(o:Entity)-[:COUNTRY]->(c:Country),       (f)-[:BENEFITS]->(b:Entity)-[:COUNTRY]->(c) RETURN f ORDER BY f.amount DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_22812,neo4jlabs_demo_db_fincen
List the top 5 movies with the tagline 'Welcome to the Real World' that were released after 1995.,"MATCH (m:Movie) WHERE m.tagline = 'Welcome to the Real World' AND m.released > 1995 RETURN m.title, m.released ORDER BY m.votes DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39823,neo4jlabs_demo_db_movies
Identify the first 3 streams that play a game and have a VIP who is a user.,"MATCH (s:Stream)-[:PLAYS]->(g:Game), (s)-[:VIP]->(u:User) RETURN s, g, u LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25536,neo4jlabs_demo_db_twitch
List all the movies that have been both directed and acted in by the same person.,"MATCH (p:Person)-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(p) RETURN m.title AS MovieTitle, p.name AS PersonName",neo4jLabs_synthetic_gpt4o,instance_id_42759,neo4jlabs_demo_db_recommendations
List the top 5 entities with the most recent inactivation dates.,"MATCH (e:Entity) WHERE e.inactivation_date IS NOT NULL RETURN e.name, e.inactivation_date ORDER BY e.inactivation_date DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44575,neo4jlabs_demo_db_offshoreleaks
"""Which movies have the string \""then\"" in them?""","MATCH (m:Movie) WHERE m.title CONTAINS ""then"" RETURN m",neo4j_crowdsourced,instance_id_27639,neo4jlabs_demo_db_movies
"List the distinct 'beneficiary_bank' values for filings where the 'originator_bank' is ""Deutsche Bank AG"" and the 'amount' is greater than 1,000,000.","MATCH (f:Filing) WHERE f.originator_bank = ""Deutsche Bank AG"" AND f.amount > 1000000 RETURN DISTINCT f.beneficiary_bank",neo4jLabs_synthetic_gemini,instance_id_29219,neo4jlabs_demo_db_fincen
List the first 3 movies with roles that include 'Captain' and their actors.,"MATCH (p:Person)-[r:ACTED_IN]->(m:Movie) WHERE any(role IN r.roles WHERE role CONTAINS 'Captain') RETURN m.title, p.name, r.roles LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24110,neo4jlabs_demo_db_movies
List the top 5 products with the highest total sales quantity.,"MATCH (p:Product)<-[:ORDERS]-(o:Order) WITH p, SUM(o.quantity) AS totalSalesQuantity ORDER BY totalSalesQuantity DESC LIMIT 5 RETURN p.productName, totalSalesQuantity",neo4jLabs_synthetic_gpt4o,instance_id_44521,neo4jlabs_demo_db_northwind
Find all movies that have the same original language and spoken language.,MATCH (m:Movie) OPTIONAL MATCH (m)-[:ORIGINAL_LANGUAGE]->(ol:Language)<-[:SPOKEN_IN_LANGUAGE]-(m) WITH DISTINCT m RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32001,neo4jlabs_demo_db_eoflix
Find streams that have VIP relationships with more than three users.,"MATCH (s:Stream)-[:VIP]->(u:User) WITH s, COUNT(u) AS vipCount WHERE vipCount > 3 RETURN s.name AS streamName, vipCount",neo4jLabs_synthetic_gpt4o,instance_id_43634,neo4jlabs_demo_db_twitch
How many orders have been shipped to the same `shipAddress`?,"MATCH (o:Order) WITH o.shipAddress AS shipAddress, collect(o) AS orders WITH shipAddress, size(orders) AS orderCount RETURN shipAddress, orderCount",neo4jLabs_synthetic_gemini,instance_id_32182,neo4jlabs_demo_db_northwind
"What is the tagline for the movie ""Cloud Atlas""?","MATCH (m:Movie) WHERE m.title = ""Cloud Atlas"" RETURN m.tagline",neo4jLabs_synthetic_gemini,instance_id_32749,neo4jlabs_demo_db_movies
Find the `companyName` and `phone` number of suppliers who supply products that have a `unitsInStock` value lower than their `reorderLevel`.,"MATCH (p:Product) WHERE p.unitsInStock < p.reorderLevel MATCH (s:Supplier)-[:SUPPLIES]->(p) RETURN s.companyName, s.phone",neo4jLabs_synthetic_gemini,instance_id_32217,neo4jlabs_demo_db_northwind
Identify the top 5 users who have a profile image URL ending with 'normal.jpg' and follow 'Neo4j'.,"MATCH (u:User)-[:FOLLOWS]->(m:Me {screen_name: 'neo4j'}) WHERE u.profile_image_url ENDS WITH 'normal.jpg' RETURN u.screen_name, u.profile_image_url ORDER BY u.followers DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43208,neo4jlabs_demo_db_twitter
Find top 5 entities serviced by Mossack Fonseca.,"MATCH (e:Entity {service_provider: ""Mossack Fonseca""}) RETURN e ORDER BY e.node_id LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21235,neo4jlabs_demo_db_offshoreleaks
"List the actors who have acted in movies directed by ""Quentin Tarantino"".","MATCH (d:Director {name: ""Quentin Tarantino""})-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(a:Actor) RETURN DISTINCT a.name",neo4jLabs_synthetic_gemini,instance_id_29766,neo4jlabs_demo_db_recommendations
Name three suppliers from Germany.,"MATCH (s:Supplier {country: ""Germany""}) RETURN s.companyName LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45353,neo4jlabs_demo_db_northwind
What is the contactName of the supplier with the lowest average product unitPrice?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WITH s, avg(p.unitPrice) AS averagePrice ORDER BY averagePrice LIMIT 1 RETURN s.contactName",neo4jLabs_synthetic_gemini,instance_id_32498,neo4jlabs_demo_db_northwind
List the top 5 oldest directors based on their birth year who have directed at least one movie.,MATCH (d:Director)-[:DIRECTED]->(:Movie) WHERE d.born IS NOT NULL RETURN d ORDER BY d.born LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_25328,neo4jlabs_demo_db_recommendations
"""which product was ordered most by a single customer?""","MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[r:ORDERS]->(p:Product) RETURN p.productName, SUM(r.quantity) AS TotalQuantityOrdered ORDER BY TotalQuantityOrdered DESC LIMIT 1",neo4j_crowdsourced,instance_id_27937,neo4jlabs_demo_db_northwind
Find the first 3 actors who acted in more than one movie with a tagline containing 'beginning'.,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.tagline CONTAINS 'beginning' WITH p, count(m) AS moviesCount WHERE moviesCount > 1 RETURN p LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23750,neo4jlabs_demo_db_movies
List the first 3 entities that originated filings with a beneficiary bank country of 'United Kingdom' and amount over 500000.,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WHERE f.beneficiary_bank_country = 'United Kingdom' AND f.amount > 500000 RETURN e.name AS entity_name ORDER BY f.begin LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_41106,neo4jlabs_demo_db_fincen
List the top 5 actors by the variety of roles they played in movies.,"MATCH (p:Person)-[r:ACTED_IN]->(m:Movie) WITH p, size(apoc.coll.toSet(collect(r.roles))) AS roleVariety RETURN p.name AS actor, roleVariety ORDER BY roleVariety DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39514,neo4jlabs_demo_db_movies
List the top 3 movies which are in the genre 'Animation' and have been released.,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Animation'}) WHERE m.status = 'Released' RETURN m.title, m.release_date, m.popularity ORDER BY m.popularity DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44387,neo4jlabs_demo_db_eoflix
What is the average unit price of products supplied by each supplier?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WITH s.companyName AS supplierName, AVG(p.unitPrice) AS averageUnitPrice RETURN supplierName, averageUnitPrice",neo4jLabs_synthetic_gemini,instance_id_30785,neo4jlabs_demo_db_northwind
What is the name of the language that is used in the stream that has the least amount of total view count?,MATCH (s:Stream) WITH s ORDER BY s.total_view_count LIMIT 1 MATCH (s)-[:HAS_LANGUAGE]->(l:Language) RETURN l.name,neo4jLabs_synthetic_gemini,instance_id_33877,neo4jlabs_demo_db_twitch
Who are the people born before 1950?,MATCH (p:Person) WHERE p.born < 1950 RETURN p.name,neo4jLabs_synthetic_gemini,instance_id_32623,neo4jlabs_demo_db_movies
List the first 3 tweets by 'Neo4j' that contain a link to 'https://twitter.com'.,MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet)-[:CONTAINS]->(l:Link) WHERE l.url CONTAINS 'https://twitter.com' RETURN t LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24154,neo4jlabs_demo_db_twitter
List the tweets that contain links to websites ending in '.org'.,MATCH (t:Tweet)-[:CONTAINS]->(l:Link) WHERE l.url ENDS WITH '.org' RETURN t,neo4jLabs_synthetic_gemini,instance_id_33861,neo4jlabs_demo_db_twitter
List the top 3 actors with the highest average imdbRating across movies they've acted in (minimum 3 movies).,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WITH a, avg(m.imdbRating) AS avgRating, count(m) AS moviesCount WHERE moviesCount >= 3 RETURN a.name, avgRating ORDER BY avgRating DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24747,neo4jlabs_demo_db_recommendations
