question,cypher,data_source,instance_id,database_reference_alias
What is the highest-rated movie Keanu Reeves acted in?,"MATCH (p:Person {name: ""Keanu Reeves""})-[:ACTED_IN]->(m:Movie)<-[r:REVIEWED]-() WITH m, max(r.rating) AS max_rating MATCH (m)<-[r:REVIEWED]-() WHERE r.rating = max_rating RETURN m.title, max_rating",neo4jLabs_synthetic_gemini,instance_id_32820,neo4jlabs_demo_db_movies
Find the streams that have been chatted in by users who also moderate other streams.,MATCH (u:User)-[:MODERATOR]->(s1:Stream) WITH u MATCH (u)-[:CHATTER]->(s2:Stream) RETURN DISTINCT s2,neo4jLabs_synthetic_gemini,instance_id_33785,neo4jlabs_demo_db_twitch
List the first 3 Addresses located in the Bahamas.,MATCH (a:Address) WHERE a.countries = 'Bahamas' RETURN a LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_30738,neo4jlabs_demo_db_offshoreleaks
List the first 3 filings with a duration of exactly one month from begin to end date.,"MATCH (f:Filing) WHERE duration.inMonths(datetime(f.begin), datetime(f.end)).months = 1 RETURN f ORDER BY f.begin LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41373,neo4jlabs_demo_db_fincen
What is the average 'amount' of filings where the beneficiary entity is located in the country with code 'GBR'?,MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE c.code = 'GBR' WITH avg(f.amount) AS average_amount RETURN average_amount,neo4jLabs_synthetic_gemini,instance_id_29084,neo4jlabs_demo_db_fincen
"Find the top 3 `originator_bank` values with the lowest total number of filings where the `beneficiary_bank_country` is ""Cayman Islands"" and the `amount` is less than 100000.","MATCH (f:Filing) WHERE f.beneficiary_bank_country = ""Cayman Islands"" AND f.amount < 100000 WITH f.originator_bank AS originator_bank, count(f) AS filing_count ORDER BY filing_count ASC LIMIT 3 RETURN originator_bank, filing_count",neo4jLabs_synthetic_gemini,instance_id_28358,neo4jlabs_demo_db_fincen
"List the names of sources used in tweets posted by users who follow the user with screen name ""neo4j"".","MATCH (u:User {screen_name: ""neo4j""}) <-[:FOLLOWS]-(follower:User) MATCH (follower)-[:POSTS]->(tweet:Tweet) MATCH (tweet)-[:USING]->(source:Source) RETURN DISTINCT source.name",neo4jLabs_synthetic_gemini,instance_id_34658,neo4jlabs_demo_db_twitter
List the top 5 users with the highest number of streams they are VIPs of.,"MATCH (u:User)-[:VIP]->(s:Stream) WITH u, count(s) AS vipCount ORDER BY vipCount DESC LIMIT 5 RETURN u.name AS userName, vipCount",neo4jLabs_synthetic_gemini,instance_id_34161,neo4jlabs_demo_db_twitch
List the top 5 movies with a plot containing the word 'adventure'.,MATCH (m:Movie) WHERE m.plot CONTAINS 'adventure' RETURN m ORDER BY m.imdbRating DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_25400,neo4jlabs_demo_db_recommendations
Which machines are held in rack 'DC1-RCK-4-9'?,MATCH (r:Rack {name: 'DC1-RCK-4-9'})-[:HOLDS]->(m:Machine) RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_20950,neo4jlabs_demo_db_network
List all suppliers who supply products to customers in all regions of 'France'.,"MATCH (customer:Customer {country: 'France'})-[:PURCHASED]->(order:Order)-[:ORDERS]->(product:Product)<-[:SUPPLIES]->(supplier:Supplier) WITH DISTINCT supplier, order.shipRegion AS region WITH supplier, count(DISTINCT region) AS supplierRegions, size(collect(region)) AS totalRegions WHERE supplierRegions = totalRegions RETURN DISTINCT supplier.companyName AS supplierName",neo4jLabs_synthetic_gemini,instance_id_32517,neo4jlabs_demo_db_northwind
List all the tweets by 'neo4j' that reply to another tweet.,MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet)-[:REPLY_TO]->(r:Tweet) RETURN t,neo4jLabs_synthetic_gpt4o,instance_id_43228,neo4jlabs_demo_db_twitter
What is the average similarity score between users who follow users followed by Neo4j and users followed by them?,MATCH (neo4j:User {screen_name: 'neo4j'})-[:FOLLOWS]->(user1:User) MATCH (user1)<-[:FOLLOWS]-(user2:User) MATCH (user2)-[sim:SIMILAR_TO]-(user1) WITH avg(sim.score) AS average_similarity RETURN average_similarity,neo4jLabs_synthetic_gemini,instance_id_34509,neo4jlabs_demo_db_twitter
Name the people who have directed more than two movies.,"MATCH (p:Person)-[:DIRECTED]->(m:Movie) WITH p, count(m) AS directedMovies WHERE directedMovies > 2 RETURN p.name AS DirectorName",neo4jLabs_synthetic_gpt4o,instance_id_39561,neo4jlabs_demo_db_movies
List the movies with a title containing a punctuation mark.,"MATCH (m:Movie) WHERE m.title =~ "".*[[:punct:]].*"" RETURN m.title",neo4jLabs_synthetic_gemini,instance_id_33000,neo4jlabs_demo_db_movies
Which movie has the shortest runtime?,MATCH (m:Movie) RETURN m ORDER BY m.runtime ASC LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_29636,neo4jlabs_demo_db_recommendations
List all software versions that are previous versions of the version named '7.1'.,MATCH (v:Version {name: '7.1'})<-[:PREVIOUS]-(prev:Version) RETURN prev.name AS previous_versions,neo4jLabs_synthetic_gemini,instance_id_32391,neo4jlabs_demo_db_network
Which Switches are connected to Interfaces routing through network '10.2'?,MATCH (n:Network {ip: '10.2'})-[:ROUTES]->(i:Interface)<-[:ROUTES]-(s:Switch) RETURN s.ip AS switch_ip,neo4jLabs_synthetic_gpt4o,instance_id_44090,neo4jlabs_demo_db_network
List all the links contained in tweets posted by 'neo4j'.,MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet)-[:CONTAINS]->(l:Link) RETURN l.url AS LinkURL,neo4jLabs_synthetic_gpt4turbo,instance_id_24340,neo4jlabs_demo_db_twitter
List the names of people who directed movies with a rating above 90.,MATCH (p:Person)-[:DIRECTED]->(m:Movie)<-[r:REVIEWED]-(reviewer:Person) WHERE r.rating > 90 RETURN DISTINCT p.name,neo4jLabs_synthetic_gemini,instance_id_34193,neo4jlabs_demo_db_movies
Find the customers who placed orders that were shipped to the same country as the customer with 'customerID' 'ALFKI'.,MATCH (c:Customer {customerID: 'ALFKI'}) WITH c.country AS customerCountry MATCH (o:Order {shipCountry: customerCountry}) MATCH (customer:Customer)-[:PURCHASED]->(o) RETURN DISTINCT customer.customerID,neo4jLabs_synthetic_gemini,instance_id_32337,neo4jlabs_demo_db_northwind
List the names of the top 5 movies with the highest revenue.,"MATCH (m:Movie) RETURN m.title AS movieTitle, m.revenue AS revenue ORDER BY m.revenue DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_42562,neo4jlabs_demo_db_recommendations
List the first 3 products from suppliers located in 'USA'.,MATCH (s:Supplier {country: 'USA'})-[:SUPPLIES]->(p:Product) RETURN p LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20557,neo4jlabs_demo_db_northwind
Which entities have a different former name and current name?,MATCH (e:Entity) WHERE e.former_name IS NOT NULL AND e.name IS NOT NULL AND e.former_name <> e.name RETURN e,neo4jLabs_synthetic_gpt4turbo,instance_id_21324,neo4jlabs_demo_db_offshoreleaks
"List the distinct 'originator_bank' values for filings where the 'beneficiary_bank' is ""Azizi Bank"".","MATCH (f:Filing) WHERE f.beneficiary_bank = ""Azizi Bank"" RETURN DISTINCT f.originator_bank",neo4jLabs_synthetic_gemini,instance_id_29216,neo4jlabs_demo_db_fincen
"List the movies that have the keyword ""jealousy"" associated with them.",MATCH (m:Movie)-[:HAS_KEYWORD]->(k:Keyword {name: 'jealousy'}) RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_31845,neo4jlabs_demo_db_eoflix
What is the average difference in days between the 'begin_date' and 'end_date' for filings where the 'originator_country' is the United States?,"MATCH (f:Filing) WHERE f.originator_country = ""United States"" WITH duration.inDays(f.end_date_format, f.begin_date_format) AS difference RETURN avg(difference) AS average_difference",neo4jLabs_synthetic_gemini,instance_id_29204,neo4jlabs_demo_db_fincen
List the first 3 directors born after 1960.,"MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE p.born > 1960 RETURN p.name AS DirectorName, p.born AS BirthYear ORDER BY p.born LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_40061,neo4jlabs_demo_db_movies
"What is the average number of followers for streams that have been played by users who also play ""Rust""?","MATCH (rust:Game {name: ""Rust""})<-[:PLAYS]-(user:User)-[:PLAYS]->(stream:Stream) WITH avg(stream.followers) AS average_followers RETURN average_followers",neo4jLabs_synthetic_gemini,instance_id_34103,neo4jlabs_demo_db_twitch
What is the total revenue generated by orders placed by customers located in the same country as the supplier of the most expensive product?,"MATCH (mostExpensiveProduct:Product) WITH max(mostExpensiveProduct.unitPrice) AS maxPrice, mostExpensiveProduct MATCH (mostExpensiveProduct)-[:SUPPLIES]->(supplier:Supplier) WITH mostExpensiveProduct, supplier.country AS supplierCountry MATCH (customer:Customer {country: supplierCountry})-[:PURCHASED]->(order:Order) WITH order, customer MATCH (order)-[orders:ORDERS]->(product:Product) WITH order, sum(toFloat(orders.quantity) * toFloat(orders.unitPrice) * (1 - toFloat(orders.discount))) AS orderRevenue RETURN sum(orderRevenue) AS totalRevenue",neo4jLabs_synthetic_gemini,instance_id_32211,neo4jlabs_demo_db_northwind
List all the products ordered in the 'Confections' category.,MATCH (c:Category {categoryName: 'Confections'})<-[:PART_OF]-(p:Product) MATCH (o:Order)-[:ORDERS]->(p) RETURN DISTINCT p.productName AS ProductName,neo4jLabs_synthetic_gpt4o,instance_id_44622,neo4jlabs_demo_db_northwind
What are the top 5 orders in terms of quantity for the product 'Chai'?,"MATCH (p:Product {productName: 'Chai'})<-[:ORDERS]-(o:Order) RETURN o.orderID AS orderID, o.orderDate AS orderDate, o.shipName AS shipName, o.shipCity AS shipCity, o.shipCountry AS shipCountry, o.shipPostalCode AS shipPostalCode, o.shipAddress AS shipAddress, o.shipVia AS shipVia, o.shipRegion AS shipRegion, o.freight AS freight, o.requiredDate AS requiredDate, o.shippedDate AS shippedDate, o.customerID AS customerID, o.employeeID AS employeeID, o.unitPrice AS unitPrice, o.quantity AS quantity, o.discount AS discount ORDER BY o.quantity DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_45159,neo4jlabs_demo_db_northwind
List the top 3 filings with the highest number of transactions in a single filing.,MATCH (f:Filing) RETURN f ORDER BY f.number DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21454,neo4jlabs_demo_db_fincen
Which entities are connected to 'MOSSFON SUBSCRIBERS LTD.'?,MATCH (e:Entity {name: 'MOSSFON SUBSCRIBERS LTD.'})-[:connected_to]->(connectedEntities:Entity) RETURN connectedEntities,neo4jLabs_synthetic_gpt4turbo,instance_id_21130,neo4jlabs_demo_db_offshoreleaks
What is the total amount of filings where the originator entity is located in 'SGP' and the beneficiary entity is located in 'AFG'?,"MATCH (originator:Entity)-[:ORIGINATOR]->(filing:Filing), (filing)-[:BENEFITS]->(beneficiary:Entity) WHERE originator.country = 'SGP' AND beneficiary.country = 'AFG' WITH filing RETURN sum(filing.amount) AS total_amount",neo4jLabs_synthetic_gemini,instance_id_28069,neo4jlabs_demo_db_fincen
What is the total number of officers in the dataset?,MATCH (n:Officer) RETURN count(n) AS total_officers,neo4jLabs_synthetic_gemini,instance_id_30620,neo4jlabs_demo_db_offshoreleaks
Which actors have acted in movies with a rating lower than 50?,MATCH (p:Person)-[:ACTED_IN]->(m:Movie)<-[r:REVIEWED]-() WHERE r.rating < 50 RETURN DISTINCT p.name,neo4jLabs_synthetic_gemini,instance_id_33039,neo4jlabs_demo_db_movies
List the first 3 services that started on applications named 'webserver'.,MATCH (app:Application {name: 'webserver'})-[:RUNS]->(service:Service) RETURN service ORDER BY service.startTime LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20128,neo4jlabs_demo_db_network
List all movies with more than one person who has reviewed them.,"MATCH (m:Movie)<-[:REVIEWED]-(p:Person) WITH m, COUNT(p) AS reviewers WHERE reviewers > 1 RETURN m.title",neo4jLabs_synthetic_gpt4o,instance_id_39749,neo4jlabs_demo_db_movies
"Find the streams that have ""maximilian_dood"" as a chatter and play ""Resident Evil Village"".","MATCH (u:User {name: ""maximilian_dood""})-[:CHATTER]->(s:Stream)-[:PLAYS]->(g:Game {name: ""Resident Evil Village""}) RETURN s",neo4jLabs_synthetic_gemini,instance_id_33998,neo4jlabs_demo_db_twitch
"Which users have the highest betweenness centrality among those who have mentioned ""Neo4j"" in their tweets?","MATCH (u:User)-[:POSTS]->(t:Tweet) WHERE t.text CONTAINS 'Neo4j' WITH u, u.betweenness AS bc ORDER BY bc DESC RETURN u.screen_name, bc",neo4jLabs_synthetic_gemini,instance_id_34543,neo4jlabs_demo_db_twitter
What is the total revenue generated by orders shipped in the month of 'June'?,MATCH (o:Order)-[rel:ORDERS]->(p:Product) WHERE o.shippedDate STARTS WITH '1996-06' WITH toFloat(rel.unitPrice) * rel.quantity * (1 - toFloat(rel.discount)) AS revenuePerProduct RETURN sum(revenuePerProduct) AS totalRevenue,neo4jLabs_synthetic_gemini,instance_id_32117,neo4jlabs_demo_db_northwind
What are the 'sar_id' values of filings where the 'originator_bank' and 'beneficiary_bank' are the same?,MATCH (f:Filing) WHERE f.originator_bank = f.beneficiary_bank RETURN f.sar_id,neo4jLabs_synthetic_gemini,instance_id_29054,neo4jlabs_demo_db_fincen
List the top 5 genres that have been accessed by the package named 'Platinum'.,"MATCH (p:Package {name: 'Platinum'})-[:PROVIDES_ACCESS_TO]->(g:Genre) RETURN g.name AS GenreName, count(g) AS AccessCount ORDER BY AccessCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23529,neo4jlabs_demo_db_eoflix
List 3 movies with the tagline including the word 'real'.,"MATCH (m:Movie) WHERE m.tagline CONTAINS 'real' RETURN m.title, m.tagline LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_39990,neo4jlabs_demo_db_movies
What is the average quantity of products per order?,"MATCH (o:Order)-[:ORDERS]->(p:Product) WITH o.orderID AS orderID, count(p) AS productsCount RETURN avg(productsCount) AS averageProductsPerOrder",neo4jLabs_synthetic_gemini,instance_id_32137,neo4jlabs_demo_db_northwind
What is the highest number of roles played by an actor in a single movie?,MATCH (:Person)-[r:ACTED_IN]->(:Movie) WITH size(r.roles) AS roles_count RETURN max(roles_count) AS max_roles,neo4jLabs_synthetic_gemini,instance_id_32716,neo4jlabs_demo_db_movies
Which 3 movies with a tagline containing 'journey' were reviewed with a rating above 85?,"MATCH (m:Movie)-[r:REVIEWED]->() WHERE m.tagline CONTAINS 'journey' AND r.rating > 85 RETURN m.title, m.tagline, r.rating ORDER BY r.rating DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23752,neo4jlabs_demo_db_movies
Which entities are connected to the officer with icij_id 'CB195B5424E13A74A6F3BC719050A2B9'?,MATCH (o:Officer {icij_id: 'CB195B5424E13A74A6F3BC719050A2B9'})-[:officer_of]->(e:Entity) RETURN e,neo4jLabs_synthetic_gpt4turbo,instance_id_21152,neo4jlabs_demo_db_offshoreleaks
Which products have a unit price lower than the average unit price of all products?,"MATCH (p:Product) WITH avg(p.unitPrice) AS average_price MATCH (p:Product) WHERE p.unitPrice < average_price RETURN p.productName AS productName, p.unitPrice AS unitPrice",neo4jLabs_synthetic_gemini,instance_id_32136,neo4jlabs_demo_db_northwind
List the top 3 products that are part of the 'Beverages' category and have been ordered more than 10 times.,"MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Beverages'}) MATCH (o:Order)-[r:ORDERS]->(p) WITH p, COUNT(r) AS orderCount WHERE orderCount > 10 RETURN p.productName AS productName, orderCount ORDER BY orderCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45124,neo4jlabs_demo_db_northwind
List the first 3 movies that have been directed by more than one director.,"MATCH (m:Movie)<-[:DIRECTED]-(d:Director) WITH m, COUNT(d) AS directorCount WHERE directorCount > 1 RETURN m.title AS movieTitle ORDER BY m.title LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42034,neo4jlabs_demo_db_recommendations
"What is the average total view count of streams that have ""en"" as a language and are moderated by users who are part of a team and are VIPs of other streams?","MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE l.name = ""en"" MATCH (s)<-[:MODERATOR]-(u:User)-[:HAS_TEAM]->(:Team) WITH s, u WHERE (u)-[:VIP]->(:Stream) WITH s RETURN avg(s.total_view_count) AS average_view_count",neo4jLabs_synthetic_gemini,instance_id_33993,neo4jlabs_demo_db_twitch
"""What was the genre for the top rated movie with Harrison Ford in the cast?""","MATCH (p:Person {name: ""Harrison Ford""})-[:CAST_FOR]->(m:Movie)-[:IN_GENRE]->(g:Genre) RETURN g.name AS GenreName, m.title AS MovieTitle, m.average_vote AS Rating ORDER BY m.average_vote DESC LIMIT 1",neo4j_crowdsourced,instance_id_27394,neo4jlabs_demo_db_eoflix
"What is the average total view count of users who are VIPs of streams playing ""Rust"" and also chat on those streams?",MATCH (s:Stream)-[:PLAYS]->(g:Game {name: 'Rust'}) MATCH (s)-[:VIP]->(u:User) WHERE (u)-[:CHATTER]->(s) RETURN avg(u.total_view_count),neo4jLabs_synthetic_gemini,instance_id_34110,neo4jlabs_demo_db_twitch
What is the average amount of filings originating from Andorra and benefiting the Cayman Islands?,"MATCH (f:Filing) WHERE f.originator_iso = ""AND"" AND f.beneficiary_iso = ""CYM"" WITH avg(f.amount) AS average_amount RETURN average_amount",neo4jLabs_synthetic_gemini,instance_id_29043,neo4jlabs_demo_db_fincen
What are the top 5 tweets by 'Neo4j' that contain the hashtag 'education' and were created in 2021?,MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet)-[:TAGS]->(h:Hashtag {name: 'education'}) WHERE t.created_at >= datetime('2021-01-01T00:00:00Z') AND t.created_at < datetime('2022-01-01T00:00:00Z') RETURN t ORDER BY t.favorites DESC LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_43116,neo4jlabs_demo_db_twitter
Name 3 actors who have acted in the least voted movies.,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WITH p, m ORDER BY m.votes ASC LIMIT 3 RETURN p.name AS Actor",neo4jLabs_synthetic_gpt4turbo,instance_id_24007,neo4jlabs_demo_db_movies
"Find the users who are mentioned in tweets that also mention links shared by ""Neo4j"".",MATCH (neo4j:User {screen_name: 'neo4j'})-[:POSTS]->(tweet:Tweet)-[:CONTAINS]->(:Link) WITH tweet MATCH (tweet)-[:MENTIONS]->(mentionedUser:User) RETURN DISTINCT mentionedUser,neo4jLabs_synthetic_gemini,instance_id_34485,neo4jlabs_demo_db_twitter
Which person produced the movie with the lowest rating?,"MATCH (m:Movie)<-[r:REVIEWED]-() WITH m, min(r.rating) AS lowest_rating MATCH (m)<-[:PRODUCED]-(p:Person) WHERE EXISTS {   MATCH (m)<-[r:REVIEWED]-()    WHERE r.rating = lowest_rating } RETURN p.name",neo4jLabs_synthetic_gemini,instance_id_34387,neo4jlabs_demo_db_movies
Find the top 3 entities that are concerned in filings where the amount is above 500000.,"MATCH (f:Filing)-[:CONCERNS]->(e:Entity) WHERE f.amount > 500000 RETURN e, count(f) AS filings_count ORDER BY filings_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21581,neo4jlabs_demo_db_fincen
What is the average age of actors at the time of a movie's release?,"MATCH (p:Person)-[ai:ACTED_IN]->(m:Movie) WITH m, p, ai, m.released - p.born AS age RETURN avg(age) AS average_age",neo4jLabs_synthetic_gemini,instance_id_32763,neo4jlabs_demo_db_movies
"List the 'name' and 'country' of the entities that benefited from filings with 'amount' greater than 1000000, ordered by 'country' in ascending order.","MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WHERE f.amount > 1000000 RETURN e.name, e.country ORDER BY e.country ASC",neo4jLabs_synthetic_gemini,instance_id_29088,neo4jlabs_demo_db_fincen
Which intermediaries are associated with entities in South Africa?,"MATCH (i:Intermediary)-[:intermediary_of]->(e:Entity) WHERE e.countries = ""South Africa"" RETURN i.name AS IntermediaryName, e.name AS EntityName",neo4jLabs_synthetic_gpt4o,instance_id_44898,neo4jlabs_demo_db_offshoreleaks
"Which users are VIPs of streams that play games other than ""Apex Legends"" and ""Resident Evil Village""?","MATCH (u:User)-[:VIP]->(s:Stream)-[:PLAYS]->(g:Game) WHERE NOT g.name IN [""Apex Legends"", ""Resident Evil Village""] RETURN DISTINCT u.name",neo4jLabs_synthetic_gemini,instance_id_34188,neo4jlabs_demo_db_twitch
Identify officers linked to entities with a company number starting with '240'.,"MATCH (e:Entity)-[:officer_of]-(o:Officer) WHERE e.company_number STARTS WITH '240' RETURN o.name AS officer_name, e.name AS entity_name, e.company_number AS company_number",neo4jLabs_synthetic_gpt4o,instance_id_42518,neo4jlabs_demo_db_offshoreleaks
What are the names of the top 5 most expensive products?,"MATCH (p:Product) RETURN p.productName, p.unitPrice ORDER BY p.unitPrice DESC LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_30824,neo4jlabs_demo_db_northwind
List 5 actors who have acted in more than 10 movies.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WITH a, COUNT(m) AS movieCount WHERE movieCount > 10 RETURN a.name AS actorName, movieCount ORDER BY movieCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41958,neo4jlabs_demo_db_recommendations
List the top 5 streams that are associated with teams and have more than 10000 followers.,MATCH (s:Stream)-[:HAS_TEAM]->(:Team) WHERE s.followers > 10000 RETURN s ORDER BY s.followers DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24472,neo4jlabs_demo_db_twitch
"Which filings have an end date in 'Sep 25, 2015'?","MATCH (f:Filing) WHERE f.end_date = 'Sep 25, 2015' RETURN f",neo4jLabs_synthetic_gpt4o,instance_id_41273,neo4jlabs_demo_db_fincen
"What is the average runtime of movies directed by the same director as ""Toy Story 2""?","MATCH (ts2:Movie {title: ""Toy Story 2""}) <-[:DIRECTED]-(d:Director) WITH d MATCH (d)-[:DIRECTED]->(m:Movie) WITH avg(m.runtime) AS averageRuntime RETURN averageRuntime",neo4jLabs_synthetic_gemini,instance_id_29810,neo4jlabs_demo_db_recommendations
Which person has directed movies with the most consistent ratings?,"MATCH (p:Person)-[:DIRECTED]->(m:Movie)<-[:REVIEWED]-(r:Person) WITH p, stdev(r.rating) AS rating_stdev ORDER BY rating_stdev ASC RETURN p.name AS director_name, rating_stdev",neo4jLabs_synthetic_gemini,instance_id_34377,neo4jlabs_demo_db_movies
List the top 3 processes that listen on port 80.,"MATCH (p:Process)-[:LISTENS]->(port:Port {port: 80}) RETURN p.name, p.startTime, p.pid ORDER BY p.startTime DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44114,neo4jlabs_demo_db_network
List the first 3 users followed by 'neo4j' who have posted a tweet with more than 50 favorites.,MATCH (u:User {screen_name: 'neo4j'})-[:FOLLOWS]->(f:User)-[:POSTS]->(t:Tweet) WHERE t.favorites > 50 RETURN f LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24212,neo4jlabs_demo_db_twitter
List the movies where the plot mentions 'friendship' and the budget was under 20 million dollars.,"MATCH (m:Movie) WHERE m.plot CONTAINS 'friendship' AND m.budget < 20000000 RETURN m.title AS MovieTitle, m.plot AS Plot, m.budget AS Budget",neo4jLabs_synthetic_gpt4o,instance_id_42643,neo4jlabs_demo_db_recommendations
What is the most recent tweet posted by Neo4j?,MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet) RETURN t ORDER BY t.created_at DESC LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_34478,neo4jlabs_demo_db_twitter
Name the first 3 users who are chatters in the most streams with different games.,"MATCH (u:User)-[:CHATTER]->(s:Stream)-[:PLAYS]->(g:Game) WITH u, count(DISTINCT g) AS gamesCount ORDER BY gamesCount DESC RETURN u.name LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25450,neo4jlabs_demo_db_twitch
List the movies where the tagline contains the word 'limits'.,"MATCH (m:Movie) WHERE m.tagline CONTAINS 'limits' RETURN m.title, m.tagline, m.released",neo4jLabs_synthetic_gpt4turbo,instance_id_23278,neo4jlabs_demo_db_movies
List all movies with a title containing a number.,MATCH (m:Movie) WHERE m.title =~ '.*\d+.*' RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32657,neo4jlabs_demo_db_movies
List the top 5 actors by the number of movies they have cast in with a budget over 50 million USD.,"MATCH (p:Person)-[:CAST_FOR]->(m:Movie) WHERE m.budget > 50000000 RETURN p.name, count(m) AS movies_count ORDER BY movies_count DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23383,neo4jlabs_demo_db_eoflix
"""Which hashtags appear together in the most tweets?""","MATCH (:Tweet)-[:TAGS]->(h1:Hashtag), (:Tweet)-[:TAGS]->(h2:Hashtag) WHERE h1 <> h2 RETURN h1.name, h2.name, COUNT(*) AS tweetsTogether ORDER BY tweetsTogether DESC LIMIT 1",neo4j_crowdsourced,instance_id_27558,neo4jlabs_demo_db_twitter
What is the average freight cost of orders shipped to the same country as the customer's billing address?,MATCH (o:Order)-[:PURCHASED]->(c:Customer) WHERE o.shipCountry = c.country WITH avg(toFloat(o.freight)) AS averageFreight RETURN averageFreight,neo4jLabs_synthetic_gemini,instance_id_30799,neo4jlabs_demo_db_northwind
List the first 3 services that started before timestamp 1606597376483 and are running on a machine in zone 4.,MATCH (m:Machine)-[:RUNS]->(s:Service) WHERE s.startTime < 1606597376483 AND exists {   MATCH (m)-[:HOLDS]->(r:Rack {zone: 4}) } RETURN s ORDER BY s.startTime LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20270,neo4jlabs_demo_db_network
"""How many movies did Sam Jackson act in?""","MATCH (p:Person {name: ""Sam Jackson""})-[:ACTED_IN]->(m:Movie) RETURN COUNT(m) AS NumberOfMoviesActedIn",neo4j_crowdsourced,instance_id_27701,neo4jlabs_demo_db_movies
What are the top 5 movies with the highest IMDb rating that have been released after 2015?,MATCH (m:Movie) WHERE m.year > 2015 WITH m ORDER BY m.imdbRating DESC LIMIT 5 RETURN m.title AS movieTitle,neo4jLabs_synthetic_gemini,instance_id_29391,neo4jlabs_demo_db_recommendations
List the first 3 movies that have a 'status' of 'In Production'.,MATCH (m:Movie) WHERE m.status = 'In Production' RETURN m LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21109,neo4jlabs_demo_db_eoflix
List the first 3 movies with the highest number of directors.,"MATCH (p:Person)-[:CREW_FOR {job: ""Director""}]->(m:Movie) WITH m, COUNT(p) AS director_count ORDER BY director_count DESC LIMIT 3 RETURN m.title AS MovieTitle, director_count AS NumberOfDirectors",neo4jLabs_synthetic_gpt4o,instance_id_39388,neo4jlabs_demo_db_eoflix
Find the entities that are registered in the jurisdiction of 'Samoa'.,"MATCH (e:Entity) WHERE e.jurisdiction_description = 'Samoa' RETURN e.name AS entity_name, e.jurisdiction_description AS jurisdiction",neo4jLabs_synthetic_gpt4o,instance_id_44591,neo4jlabs_demo_db_offshoreleaks
Which country has the highest number of entities that are both `ORIGINATOR` and `BENEFITS` in different filings?,"MATCH (f:Filing) MATCH (f)-[:ORIGINATOR]->(e:Entity)<-[:BENEFITS]-(f) WITH e.country AS country, count(*) AS count RETURN country, count ORDER BY count DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_28315,neo4jlabs_demo_db_fincen
List the names of the streams that have at least one VIP.,MATCH (s:Stream)-[:VIP]->() RETURN DISTINCT s.name,neo4jLabs_synthetic_gemini,instance_id_34055,neo4jlabs_demo_db_twitch
List the names of users who have interacted with 'Neo4j'.,MATCH (me:Me {screen_name: 'neo4j'})-[:INTERACTS_WITH]->(user:User) RETURN user.name,neo4jLabs_synthetic_gpt4o,instance_id_43070,neo4jlabs_demo_db_twitter
List the first 5 movies with a director who has also acted in a movie.,"MATCH (d:Director)-[:DIRECTED]->(m:Movie) MATCH (d)-[:ACTED_IN]->(:Movie) RETURN m.title AS MovieTitle, d.name AS DirectorName LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_42409,neo4jlabs_demo_db_recommendations
"What is the average number of followers for streams that have ""en"" as a language?","MATCH (s:Stream)-[:HAS_LANGUAGE]->(:Language { name: ""en"" }) WITH avg(s.followers) AS average_followers RETURN average_followers",neo4jLabs_synthetic_gemini,instance_id_33958,neo4jlabs_demo_db_twitch
Find all movies that have been acted in by an actor born before 1950.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE a.born < date('1950-01-01') RETURN m.title AS MovieTitle, a.name AS ActorName",neo4jLabs_synthetic_gpt4o,instance_id_42022,neo4jlabs_demo_db_recommendations
List the first 3 orders made by 'Alfreds Futterkiste' with a freight cost greater than 10.,"MATCH (c:Customer {companyName: 'Alfreds Futterkiste'})-[:PURCHASED]->(o:Order) WHERE toFloat(o.freight) > 10 RETURN o.orderID, o.orderDate, o.freight ORDER BY o.orderDate LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45239,neo4jlabs_demo_db_northwind
List the movies with a revenue exceeding 100 million USD and a popularity below 10.,MATCH (m:Movie) WHERE m.revenue > 100000000 AND m.popularity < 10 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_20765,neo4jlabs_demo_db_eoflix
"What is the total amount of filings where the beneficiary bank is located in a country with a code starting with ""G""?","MATCH (f:Filing) WHERE f.beneficiary_bank_country STARTS WITH ""G"" RETURN sum(f.amount) AS total_amount",neo4jLabs_synthetic_gemini,instance_id_28251,neo4jlabs_demo_db_fincen
List the top 5 movies with the most extensive production crew.,"MATCH (m:Movie)<-[:CREW_FOR]-(p:Person) WITH m, COUNT(p) AS crew_count ORDER BY crew_count DESC LIMIT 5 RETURN m.title AS MovieTitle, crew_count AS CrewCount",neo4jLabs_synthetic_gpt4o,instance_id_39710,neo4jlabs_demo_db_eoflix
List the first 3 directors who have directed movies in the most genres.,"MATCH (p:Person)-[cf:CREW_FOR]->(m:Movie) WHERE cf.job = 'Director' WITH p, count(DISTINCT m.id) AS movieCount RETURN p.name, movieCount ORDER BY movieCount DESC LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_31891,neo4jlabs_demo_db_eoflix
"What is the text of the tweet with the most favorites posted by the user with screen name ""neo4j""?","MATCH (u:User {screen_name: ""neo4j""})-[:POSTS]->(t:Tweet) WITH t ORDER BY t.favorites DESC LIMIT 1 RETURN t.text",neo4jLabs_synthetic_gemini,instance_id_34707,neo4jlabs_demo_db_twitter
What is the average rating of movies released in the year 1999?,MATCH (m:Movie {released: 1999})<-[r:REVIEWED]-() WITH avg(r.rating) AS average_rating RETURN average_rating,neo4jLabs_synthetic_gemini,instance_id_34382,neo4jlabs_demo_db_movies
"""How many movies are there in the database?""",MATCH (m:Movie) RETURN count(m) AS NumberOfMovies,neo4j_crowdsourced,instance_id_27776,neo4jlabs_demo_db_movies
"""Is there a shortest path between Jerry Maguire and The Matrix?""","MATCH p=shortestPath((jm:Movie {title: ""Jerry Maguire""})-[*]-(matrix:Movie {title: ""The Matrix""})) RETURN p",neo4j_crowdsourced,instance_id_27769,neo4jlabs_demo_db_movies
List all movies produced by Joel Silver.,"MATCH (p:Person {name: ""Joel Silver""})-[:PRODUCED]->(m:Movie) RETURN m.title AS MovieTitle",neo4jLabs_synthetic_gpt4o,instance_id_39984,neo4jlabs_demo_db_movies
What are the IP addresses for interfaces connected to 'DC1-R-1' router?,MATCH (r:Router {name: 'DC1-R-1'})-[:ROUTES]->(i:Interface) RETURN i.ip AS InterfaceIP,neo4jLabs_synthetic_gpt4turbo,instance_id_20968,neo4jlabs_demo_db_network
List the first 3 movies where the main actor is also the director.,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie), (p)-[:DIRECTED]->(m) RETURN m.title AS MovieTitle, p.name AS PersonName LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25250,neo4jlabs_demo_db_recommendations
List the 5 oldest actors based on the 'born' property.,MATCH (a:Actor) WHERE a.born IS NOT NULL RETURN a ORDER BY a.born LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_26156,neo4jlabs_demo_db_recommendations
What is the total RAM of all types of machines grouped by their type in the DataCenter 'DC1'?,"MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(:Rack)-[:HOLDS]->(m:Machine)-[:TYPE]->(t:Type) RETURN t.type AS machineType, SUM(t.ram) AS totalRAM ORDER BY machineType",neo4jLabs_synthetic_gpt4o,instance_id_44036,neo4jlabs_demo_db_network
