question,cypher,data_source,instance_id,database_reference_alias
What is the PID of the Service that listens to the Port with port number 443?,MATCH (p:Port {port: 443})<-[:LISTENS]-(s:Service) RETURN s.pid,neo4jLabs_synthetic_gemini,instance_id_32411,neo4jlabs_demo_db_network
Which suppliers provide products with a unit price less than $10?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE p.unitPrice < 10 RETURN s.companyName AS SupplierName, p.productName AS ProductName, p.unitPrice AS UnitPrice",neo4jLabs_synthetic_gpt4o,instance_id_43977,neo4jlabs_demo_db_northwind
Identify the top 5 users with the most similar profiles to 'Neo4j' based on betweenness and following.,"MATCH (me:Me {screen_name: 'neo4j'})-[:SIMILAR_TO]-(user:User) RETURN user.screen_name, user.betweenness, user.following, me.betweenness, me.following,         (abs(user.betweenness - me.betweenness) + abs(user.following - me.following)) AS similarity_score ORDER BY similarity_score ASC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43180,neo4jlabs_demo_db_twitter
Identify officers who have a registered address in Samoa.,"MATCH (o:Officer)-[:registered_address]->(a:Address) WHERE a.countries = ""Samoa"" RETURN o.name AS officer_name, a.address AS registered_address",neo4jLabs_synthetic_gpt4o,instance_id_44941,neo4jlabs_demo_db_offshoreleaks
"Which movie has the highest revenue in the ""Animation"" genre?",MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Animation'}) WITH m ORDER BY m.revenue DESC LIMIT 1 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_31976,neo4jlabs_demo_db_eoflix
List the countries with entities that originated filings where the beneficiary entity is located in 'GBR'.,MATCH (f:Filing) WHERE f.beneficiary_iso = 'GBR' MATCH (f)-[:ORIGINATOR]->(oe:Entity)-[:COUNTRY]->(c:Country) RETURN DISTINCT c.name,neo4jLabs_synthetic_gemini,instance_id_28129,neo4jlabs_demo_db_fincen
List the first 3 persons who have directed a movie with a budget over 150 million USD.,MATCH (p:Person)-[r:CREW_FOR]->(m:Movie) WHERE r.job = 'Director' AND m.budget > 150000000 RETURN p LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23611,neo4jlabs_demo_db_eoflix
Show the first 3 movies released in the USA that have a revenue exceeding 500 million USD.,MATCH (m:Movie) WHERE 'USA' IN m.countries AND m.revenue > 500000000 RETURN m ORDER BY m.released LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_26130,neo4jlabs_demo_db_recommendations
List the top 5 most recent tweets that 'Neo4j' has posted.,"MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet) RETURN t.text, t.created_at ORDER BY t.created_at DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43144,neo4jlabs_demo_db_twitter
List the orders placed by customers who have never placed an order for products in the 'Meat/Poultry' category.,MATCH (meatPoultryCategory:Category {categoryName: 'Meat/Poultry'})-[:PART_OF]->(meatPoultryProduct:Product)<-[:ORDERS]-(:Order)<-[:PURCHASED]-(meatPoultryCustomers:Customer) WITH collect(DISTINCT meatPoultryCustomers.customerID) AS meatPoultryCustomerIds MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE NOT c.customerID IN meatPoultryCustomerIds RETURN DISTINCT o.orderID,neo4jLabs_synthetic_gemini,instance_id_32124,neo4jlabs_demo_db_northwind
Which entities have been concerned by filings with an amount over 1500000?,MATCH (f:Filing)-[:CONCERNS]->(e:Entity) WHERE f.amount > 1500000 RETURN e,neo4jLabs_synthetic_gpt4turbo,instance_id_22786,neo4jlabs_demo_db_fincen
What are the entities that have filed the most filings with a begin date in 2015?,"MATCH (e:Entity)-[:FILED]->(f:Filing) WHERE f.begin_date_format STARTS WITH '2015' WITH e, count(f) AS filingsCount ORDER BY filingsCount DESC RETURN e, filingsCount",neo4jLabs_synthetic_gpt4turbo,instance_id_22779,neo4jlabs_demo_db_fincen
List the first 3 tweets by 'neo4j' that have been tagged with a hashtag and mention another user.,"MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet)-[:TAGS]->(:Hashtag),       (t)-[:MENTIONS]->(:User) RETURN t LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24242,neo4jlabs_demo_db_twitter
List the movies that have been filmed in New York City and have a runtime longer than 2.5 hours.,"MATCH (m:Movie) WHERE m.runtime > 150 RETURN m.title, m.runtime",neo4jLabs_synthetic_gemini,instance_id_29615,neo4jlabs_demo_db_recommendations
Find all movies that have a tagline containing an exclamation mark.,MATCH (m:Movie) WHERE m.tagline CONTAINS '!' RETURN m,neo4jLabs_synthetic_gemini,instance_id_34235,neo4jlabs_demo_db_eoflix
List the actors born before 1960 who have acted in a movie with a rating above 80.,MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie)<-[review:REVIEWED]-(:Person) WHERE actor.born < 1960 AND review.rating > 80 RETURN DISTINCT actor.name,neo4jLabs_synthetic_gemini,instance_id_32828,neo4jlabs_demo_db_movies
Find the first 3 countries where the total amount of filings exceeds 1000000.,"MATCH (c:Country)<-[:COUNTRY]-(e:Entity)-[:FILED]->(f:Filing) WITH c, SUM(f.amount) AS totalAmount WHERE totalAmount > 1000000 RETURN c.name AS country, totalAmount ORDER BY totalAmount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41306,neo4jlabs_demo_db_fincen
Find all streams that have 'VIP' users with more than 5000 followers.,MATCH (s:Stream)-[:VIP]->(vip:User) WHERE vip.followers > 5000 RETURN s.name,neo4jLabs_synthetic_gemini,instance_id_33694,neo4jlabs_demo_db_twitch
How many types of machines have a RAM capacity of 256 or more?,MATCH (t:Type) WHERE t.ram >= 256 RETURN count(t) AS numberOfMachineTypes,neo4jLabs_synthetic_gpt4o,instance_id_43760,neo4jlabs_demo_db_network
"Which officers are nominees of 'NINGBO SUNRISE ENTERPRISES UNITED CO., LTD.' as per Offshore Leaks?","MATCH (o:Officer)-[:officer_of]->(e:Entity {name: 'NINGBO SUNRISE ENTERPRISES UNITED CO., LTD.'}) WHERE e.sourceID = 'Offshore Leaks' RETURN o.name AS OfficerName",neo4jLabs_synthetic_gpt4turbo,instance_id_21283,neo4jlabs_demo_db_offshoreleaks
List the top 5 movies with an IMDb rating above 8.0.,MATCH (m:Movie) WHERE m.imdbRating > 8.0 RETURN m ORDER BY m.imdbRating DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24742,neo4jlabs_demo_db_recommendations
Which country has the highest number of entities that filed filings with an amount greater than 1000000?,"MATCH (f:Filing) WHERE f.amount > 1000000 WITH f MATCH (f)<-[:FILED]-(e:Entity)-[:COUNTRY]->(c:Country) WITH c, count(DISTINCT e) AS entityCount ORDER BY entityCount DESC RETURN c.name AS countryName, entityCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_28212,neo4jlabs_demo_db_fincen
How many orders have been placed by customers in each region?,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WITH c.region AS region, count(o) AS orderCount RETURN region, orderCount",neo4jLabs_synthetic_gemini,instance_id_30776,neo4jlabs_demo_db_northwind
Find the movies that have a popularity score less than 10.,MATCH (m:Movie) WHERE m.popularity < 10 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32060,neo4jlabs_demo_db_eoflix
What is the average budget of movies released during summer blockbuster season?,MATCH (m:Movie) WHERE date(m.released) >= date('1900-05-01') AND date(m.released) <= date('1900-08-31') WITH avg(m.budget) AS averageBudget RETURN averageBudget,neo4jLabs_synthetic_gemini,instance_id_29405,neo4jlabs_demo_db_recommendations
"What is the 'disk' size of the 'Type' used by 'Machine' named ""DC1-RCK-1-1-M-1""?","MATCH (m:Machine {name: ""DC1-RCK-1-1-M-1""})-[:TYPE]->(t:Type) RETURN t.disk",neo4jLabs_synthetic_gemini,instance_id_31769,neo4jlabs_demo_db_network
What are the top 5 most ordered products by customers from 'Portland'?,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) WHERE c.city = 'Portland' RETURN p.productName, COUNT(o) AS orderCount ORDER BY orderCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_45083,neo4jlabs_demo_db_northwind
Which 3 beneficiary banks received the highest total amount in transactions from filings originated in 'United Kingdom'?,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WHERE f.originator_bank_country = 'United Kingdom' WITH e.name AS beneficiary_bank, SUM(f.amount) AS total_amount RETURN beneficiary_bank, total_amount ORDER BY total_amount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41422,neo4jlabs_demo_db_fincen
List all orders that include a product from the 'Beverages' category and a product from the 'Confections' category.,MATCH (o:Order)-[:ORDERS]->(p1:Product)-[:PART_OF]->(c1:Category {categoryName: 'Beverages'}) WITH o MATCH (o)-[:ORDERS]->(p2:Product)-[:PART_OF]->(c2:Category {categoryName: 'Confections'}) RETURN DISTINCT o.orderID,neo4jLabs_synthetic_gemini,instance_id_32531,neo4jlabs_demo_db_northwind
List the first 3 hashtags used in tweets that 'Me' posts.,MATCH (me:Me)-[:POSTS]->(tweet:Tweet)-[:TAGS]->(hashtag:Hashtag) RETURN hashtag.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24158,neo4jlabs_demo_db_twitter
What language does the stream '9linda' use?,MATCH (s:Stream {name: '9linda'})-[:HAS_LANGUAGE]->(l:Language) RETURN l.name,neo4jLabs_synthetic_gemini,instance_id_33763,neo4jlabs_demo_db_twitch
Which entities and intermediaries have the same country codes?,"MATCH (e:Entity), (i:Intermediary) WHERE e.country_codes = i.country_codes AND e.country_codes IS NOT NULL RETURN e, i",neo4jLabs_synthetic_gpt4turbo,instance_id_21319,neo4jlabs_demo_db_offshoreleaks
What are the first 3 processes running on machines within 'DC1-RCK-4-9'?,MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(rack:Rack {name: 'DC1-RCK-4-9'})-[:HOLDS]->(machine:Machine) MATCH (machine)-[:RUNS]->(process:Process) RETURN process LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20197,neo4jlabs_demo_db_network
Find the top 5 racks by zone that contain the most types of machines.,"MATCH (r:Rack)-[:HOLDS]->(m:Machine)-[:TYPE]->(t:Type) WITH r.zone AS zone, r.name AS rackName, COUNT(DISTINCT t) AS typeCount ORDER BY typeCount DESC RETURN zone, rackName, typeCount LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_20180,neo4jlabs_demo_db_network
List the first 3 tweets that include a link to 'https://twitter.com' and were favorited more than 100 times.,MATCH (t:Tweet)-[:CONTAINS]->(l:Link) WHERE l.url CONTAINS 'https://twitter.com' AND t.favorites > 100 RETURN t LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24826,neo4jlabs_demo_db_twitter
Which suppliers have products listed in more than three categories?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product)-[:PART_OF]->(c:Category) WITH s, count(DISTINCT c) AS numCategories WHERE numCategories > 3 RETURN s",neo4jLabs_synthetic_gpt4turbo,instance_id_21630,neo4jlabs_demo_db_northwind
List the top 5 adult films with the highest average votes.,"MATCH (a:Adult) WHERE a.average_vote IS NOT NULL RETURN a.title, a.average_vote ORDER BY a.average_vote DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_20696,neo4jlabs_demo_db_eoflix
Which 3 entities have been involved as beneficiaries in the most filings?,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WITH e, COUNT(f) AS num_filings ORDER BY num_filings DESC LIMIT 3 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_41779,neo4jlabs_demo_db_fincen
List the first 3 interfaces that connect to routers in zone 1.,MATCH (r:Router {zone: 1})-[:ROUTES]->(i:Interface) RETURN i.ip LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43962,neo4jlabs_demo_db_network
What are the company numbers for entities that have 'Defaulted' as their status?,MATCH (e:Entity {status: 'Defaulted'}) RETURN e.company_number AS CompanyNumber,neo4jLabs_synthetic_gpt4turbo,instance_id_21259,neo4jlabs_demo_db_offshoreleaks
What is the average budget of movies released in the USA?,MATCH (m:Movie) WHERE 'USA' IN m.countries RETURN avg(m.budget) AS averageBudget,neo4jLabs_synthetic_gemini,instance_id_29654,neo4jlabs_demo_db_recommendations
"""how many movies have Brad Pitt acted in already as of 2024? ""","MATCH (p:Person {name: ""Brad Pitt""})-[:ACTED_IN]->(m:Movie) WHERE m.released <= 2024 RETURN COUNT(m) AS BradPittMovieCount",neo4j_crowdsourced,instance_id_27411,neo4jlabs_demo_db_movies
What is the total number of filings where the originator entity's country is 'DEU' and the beneficiary entity's country is 'GBR'?,"MATCH (f:Filing)-[:ORIGINATOR]->(o:Entity)-[:COUNTRY]->(oc:Country),       (f)-[:BENEFITS]->(b:Entity)-[:COUNTRY]->(bc:Country) WHERE oc.code = 'DEU' AND bc.code = 'GBR' RETURN count(f)",neo4jLabs_synthetic_gemini,instance_id_28131,neo4jlabs_demo_db_fincen
List the top 5 filings by number where the filing began in 2015.,"MATCH (f:Filing) WHERE f.begin_date_format STARTS WITH ""2015"" RETURN f ORDER BY f.number DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41445,neo4jlabs_demo_db_fincen
What is the average quantity of products ordered per customer?,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[rel:ORDERS]->(p:Product) WITH c, sum(toInteger(rel.quantity)) AS orderQuantity WITH c, avg(orderQuantity) AS averageQuantity RETURN avg(averageQuantity)",neo4jLabs_synthetic_gemini,instance_id_30978,neo4jlabs_demo_db_northwind
What is the phone number of the supplier with companyName 'Exotic Liquids'?,"MATCH (s:Supplier {companyName: ""Exotic Liquids""}) RETURN s.phone",neo4jLabs_synthetic_gemini,instance_id_30885,neo4jlabs_demo_db_northwind
What is the IP address of the interface that connects to the egress router DC1-RE?,MATCH (egress:Egress {name: 'DC1-RE'})-[:ROUTES]->(interface:Interface) RETURN interface.ip,neo4jLabs_synthetic_gemini,instance_id_31606,neo4jlabs_demo_db_network
Identify entities with multiple registered addresses.,"MATCH (e:Entity)-[:registered_address]->(a:Address) WITH e, COUNT(a) AS addressCount WHERE addressCount > 1 RETURN e.name AS entityName, addressCount",neo4jLabs_synthetic_gpt4o,instance_id_44843,neo4jlabs_demo_db_offshoreleaks
Identify the first 3 streams that play a game named 'Rust' and have a VIP who is a user.,MATCH (s:Stream)-[:PLAYS]->(g:Game {name: 'Rust'}) MATCH (s)-[:VIP]->(:User) RETURN s ORDER BY s.createdAt LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_42944,neo4jlabs_demo_db_twitch
"""What is the schema of this database?""",CALL db.schema.visualization(),neo4j_crowdsourced,instance_id_27667,neo4jlabs_demo_db_movies
List the top 5 movies that have a plot description longer than 100 words.,"MATCH (m:Movie) WHERE size(split(m.plot, ' ')) > 100 RETURN m ORDER BY size(split(m.plot, ' ')) DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_25416,neo4jlabs_demo_db_recommendations
List three customers who have purchased orders shipped to France.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE o.shipCountry = 'France' RETURN c.companyName, c.contactName, c.phone LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21829,neo4jlabs_demo_db_northwind
"Find the users who are mentioned in the same tweets as ""Neo4j"".",MATCH (neo4j:User {screen_name: 'neo4j'}) MATCH (neo4j)<-[:MENTIONS]-(tweet:Tweet)-[:MENTIONS]->(other:User) WHERE neo4j <> other RETURN DISTINCT other,neo4jLabs_synthetic_gemini,instance_id_34563,neo4jlabs_demo_db_twitter
List the orders placed by customers located in the same city as 'Exotic Liquids'.,MATCH (s:Supplier {companyName: 'Exotic Liquids'}) WITH s.city AS supplierCity MATCH (c:Customer {city: supplierCity}) MATCH (c)-[:PURCHASED]->(o:Order) RETURN DISTINCT o,neo4jLabs_synthetic_gemini,instance_id_32138,neo4jlabs_demo_db_northwind
"What is the average number of followers for streams that have the language ""en"" and the game ""Rust""?","MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE l.name = ""en"" MATCH (s)-[:PLAYS]->(g:Game) WHERE g.name = ""Rust"" WITH avg(s.followers) AS averageFollowers RETURN averageFollowers",neo4jLabs_synthetic_gemini,instance_id_33871,neo4jlabs_demo_db_twitch
"What is the average number of followers for streams that have ""en"" as their language and play ""Dota 2""?","MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE l.name = ""en"" MATCH (s)-[:PLAYS]->(g:Game) WHERE g.name = ""Dota 2"" WITH avg(s.followers) AS average_followers RETURN average_followers",neo4jLabs_synthetic_gemini,instance_id_34041,neo4jlabs_demo_db_twitch
What are the top 3 software versions that the software 'RHEL' depends on?,"MATCH (s:Software {name: 'RHEL'})-[:DEPENDS_ON]->(v:Version) RETURN v.name AS VersionName, count(v) AS DependencyCount ORDER BY DependencyCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20286,neo4jlabs_demo_db_network
List the first 3 languages that have been used as original languages in more than 10 movies.,"MATCH (m:Movie)-[:ORIGINAL_LANGUAGE]->(l:Language) WITH l, COUNT(m) AS movieCount WHERE movieCount > 10 RETURN l.name AS language, movieCount ORDER BY movieCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44183,neo4jlabs_demo_db_eoflix
List 3 movies that have been reviewed with a summary mentioning 'funny'.,"MATCH (m:Movie)<-[:REVIEWED]-(p:Person) WHERE m.title IS NOT NULL AND any(summary IN ['Pretty funny at times', 'Silly, but fun', 'Fun, but a little far fetched'] WHERE summary CONTAINS 'funny') RETURN DISTINCT m.title LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_39499,neo4jlabs_demo_db_movies
What is the average unit price of products ordered by customers located in 'Germany'?,MATCH (c:Customer {country: 'Germany'})-[:PURCHASED]->(o:Order)-[oi:ORDERS]->(p:Product) WITH avg(toFloat(oi.unitPrice)) AS averageUnitPrice RETURN averageUnitPrice,neo4jLabs_synthetic_gemini,instance_id_32141,neo4jlabs_demo_db_northwind
Find all suppliers who supply products in both 'Beverages' and 'Condiments' categories.,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product)-[:PART_OF]->(c:Category) WHERE c.categoryName IN ['Beverages', 'Condiments'] WITH s, collect(c.categoryName) AS categories WHERE ALL(cat IN ['Beverages', 'Condiments'] WHERE cat IN categories) RETURN s",neo4jLabs_synthetic_gpt4turbo,instance_id_21769,neo4jlabs_demo_db_northwind
Identify the top 5 tweets that mention Neo4j and contain a link.,"MATCH (t:Tweet)-[:MENTIONS]->(u:User {name: ""Neo4j""}) WHERE EXISTS {   (t)-[:CONTAINS]->(:Link) } RETURN t ORDER BY t.favorites DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_24801,neo4jlabs_demo_db_twitter
"What is the name of the software that the version ""7.1"" belongs to?","MATCH (v:Version {name: ""7.1""})-[:VERSION]-(s:Software) RETURN s.name",neo4jLabs_synthetic_gemini,instance_id_32348,neo4jlabs_demo_db_network
List all processes that are instances of the 'RHEL' OS.,MATCH (os:OS {name: 'RHEL'})-[:INSTANCE]->(process:Process) RETURN process,neo4jLabs_synthetic_gpt4turbo,instance_id_20919,neo4jlabs_demo_db_network
"""How many movies was Tom Hanks in?""","MATCH (p:Person {name: ""Tom Hanks""})-[:ACTED_IN]->(m:Movie) RETURN COUNT(m) AS NumberOfMoviesTomHanksActedIn",neo4j_crowdsourced,instance_id_27657,neo4jlabs_demo_db_movies
List the top 5 streams that have a total view count greater than 5000000.,MATCH (s:Stream) WHERE s.total_view_count > 5000000 RETURN s ORDER BY s.total_view_count DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24414,neo4jlabs_demo_db_twitch
Find the entities that are connected to the officer with node_id 12160432 through the 'officer_of' relationship.,MATCH (o:Officer {node_id: 12160432})-[:officer_of]->(e) RETURN e.name,neo4jLabs_synthetic_gemini,instance_id_31013,neo4jlabs_demo_db_offshoreleaks
List all services that are listening on port 80.,MATCH (s:Service)-[:LISTENS]->(p:Port {port: 80}) RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_20248,neo4jlabs_demo_db_network
Give me the top 5 movies with the highest ratings.,"MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WITH m, avg(r.rating) AS average_rating ORDER BY average_rating DESC RETURN m.title, average_rating LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_33003,neo4jlabs_demo_db_movies
Which movies have a revenue to budget ratio greater than 2? Limit to 5 movies.,MATCH (m:Movie) WHERE m.revenue IS NOT NULL AND m.budget IS NOT NULL AND m.revenue / m.budget > 2 RETURN m LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_25015,neo4jlabs_demo_db_recommendations
"List the first 3 Intermediaries registered with the sourceID ""Panama Papers"".","MATCH (i:Intermediary) WHERE i.sourceID = ""Panama Papers"" RETURN i.name LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_30643,neo4jlabs_demo_db_offshoreleaks
Show me the top 5 most common countries for registered addresses.,"MATCH (e:Entity)-[r:registered_address]->(a:Address) WITH a.countries AS country, count(*) AS count RETURN country, count ORDER BY count DESC LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_30580,neo4jlabs_demo_db_offshoreleaks
What is the average unitPrice of products in the 'Beverages' category that are not discontinued?,MATCH (c:Category {categoryName: 'Beverages'})-[:PART_OF]->(p:Product) WHERE NOT p.discontinued WITH avg(p.unitPrice) AS averagePrice RETURN averagePrice,neo4jLabs_synthetic_gemini,instance_id_32584,neo4jlabs_demo_db_northwind
List the names of the teams that have streams with a follower count greater than the average follower count of all streams.,MATCH (s:Stream) WITH avg(s.followers) AS average_followers MATCH (t:Team)<-[:HAS_TEAM]-(s:Stream) WHERE s.followers > average_followers RETURN DISTINCT t.name AS team_name,neo4jLabs_synthetic_gemini,instance_id_34115,neo4jlabs_demo_db_twitch
Find the intermediaries who are 'intermediary_of' entities that have a 'registered_address' in 'Hong Kong'.,MATCH (i:Intermediary)-[:intermediary_of]->(e:Entity) MATCH (e)-[:registered_address]->(a:Address) WHERE a.countries = 'Hong Kong' RETURN DISTINCT i.name,neo4jLabs_synthetic_gemini,instance_id_30538,neo4jlabs_demo_db_offshoreleaks
What are the dependencies of the application 'webapp'?,MATCH (app:Application {name: 'webapp'})-[:DEPENDS_ON]->(dependency) RETURN dependency,neo4jLabs_synthetic_gpt4turbo,instance_id_20209,neo4jlabs_demo_db_network
Identify the top 5 users who are followed by 'Neo4j'.,MATCH (n:User {name: 'Neo4j'})-[:FOLLOWS]->(u:User) RETURN u ORDER BY u.followers DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24997,neo4jlabs_demo_db_twitter
Which movie has the most actors?,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WITH m, count(a) AS actorCount ORDER BY actorCount DESC LIMIT 1 RETURN m.title",neo4jLabs_synthetic_gemini,instance_id_29698,neo4jlabs_demo_db_recommendations
List the first 3 entities by the number of concerns they have in filings.,"MATCH (e:Entity)-[:CONCERNS]->(f:Filing) WITH e, count(f) AS concernsCount ORDER BY concernsCount DESC LIMIT 3 RETURN e, concernsCount",neo4jLabs_synthetic_gpt4turbo,instance_id_21580,neo4jlabs_demo_db_fincen
Show the top 5 oldest movies in the collection with the highest revenue.,"MATCH (m:Movie)-[:IN_COLLECTION]->(c:Collection) WITH m, c ORDER BY m.release_date ASC LIMIT 5 RETURN m.title AS MovieTitle, m.release_date AS ReleaseDate, m.revenue AS Revenue ORDER BY m.revenue DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39698,neo4jlabs_demo_db_eoflix
List the first 3 tweets that retweet tweets created on '2020-12-06'.,MATCH (originalTweet:Tweet)-[:RETWEETS]->(retweet:Tweet) WHERE date(originalTweet.created_at) = date('2020-12-06') RETURN retweet ORDER BY retweet.created_at LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43052,neo4jlabs_demo_db_twitter
Show all users followed by 'Me' with more than 10000 followers.,"MATCH (me:Me)-[:FOLLOWS]->(user:User) WHERE user.followers > 10000 RETURN user.screen_name, user.name, user.followers",neo4jLabs_synthetic_gpt4o,instance_id_43039,neo4jlabs_demo_db_twitter
Find 3 movies that have 'Toy Story' in their title.,"MATCH (m:Movie) WHERE m.title CONTAINS 'Toy Story' RETURN m.title, m.release_date, m.id LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44157,neo4jlabs_demo_db_eoflix
What is the total quantity of products supplied by the supplier of 'Aniseed Syrup'?,"MATCH (p:Product {productName: 'Aniseed Syrup'})-[:SUPPLIES]-(s:Supplier) WITH p, s MATCH (o:Order)-[:ORDERS]->(p) RETURN sum(o.quantity) AS totalQuantity",neo4jLabs_synthetic_gemini,instance_id_32126,neo4jlabs_demo_db_northwind
What addresses are registered to entities in the 'Panama Papers'?,MATCH (e:Entity)-[:registered_address]->(a:Address) WHERE e.sourceID = 'Panama Papers' RETURN a.address AS registered_address,neo4jLabs_synthetic_gpt4o,instance_id_44778,neo4jlabs_demo_db_offshoreleaks
List the first 5 streams that have the language 'en'.,"MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language {name: 'en'}) RETURN s.name, s.url, s.createdAt, s.followers, s.total_view_count ORDER BY s.createdAt LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43540,neo4jlabs_demo_db_twitch
Find all movies that have a runtime greater than the average runtime of all movies.,MATCH (m:Movie) WITH avg(m.runtime) AS avgRuntime MATCH (m:Movie) WHERE m.runtime > avgRuntime RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_31918,neo4jlabs_demo_db_eoflix
How many movies have a tagline that is longer than the average tagline length?,MATCH (m:Movie) WITH avg(size(m.tagline)) AS averageTaglineLength MATCH (m:Movie) WHERE size(m.tagline) > averageTaglineLength RETURN count(m),neo4jLabs_synthetic_gemini,instance_id_33125,neo4jlabs_demo_db_movies
"Which entities have benefited from filings where the originator bank is located in the same country as the entity with ID ""banca-privada-dandorra-sa""?",MATCH (e:Entity {id: 'banca-privada-dandorra-sa'})-[:COUNTRY]->(country:Country) MATCH (f:Filing) WHERE f.originator_iso = country.code MATCH (f)-[:BENEFITS]->(beneficiary:Entity) RETURN DISTINCT beneficiary.name,neo4jLabs_synthetic_gemini,instance_id_28223,neo4jlabs_demo_db_fincen
List the services that are running on machines with a CPU count of 8.,MATCH (m:Machine)-[:TYPE]->(t:Type) WHERE t.cpu = 8 MATCH (m)-[:RUNS]->(s:Service) RETURN DISTINCT s.name,neo4jLabs_synthetic_gemini,instance_id_31556,neo4jlabs_demo_db_network
"How many users moderate streams that have a total view count higher than 1,000,000?",MATCH (s:Stream) WHERE s.total_view_count > 1000000 WITH s MATCH (u:User)-[:MODERATOR]->(s) RETURN count(DISTINCT u),neo4jLabs_synthetic_gemini,instance_id_33798,neo4jlabs_demo_db_twitch
List the first 5 movies with a poster path ending in '.jpg'.,"MATCH (m:Movie) WHERE m.poster_path ENDS WITH '.jpg' RETURN m.title, m.poster_path LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44285,neo4jlabs_demo_db_eoflix
What are the top 3 countries by the number of entities that have filed filings with a beneficiary bank in 'France'?,"MATCH (e:Entity)-[:FILED]->(f:Filing {beneficiary_bank_country: 'France'}) WITH e, count(e) AS filings_count ORDER BY filings_count DESC LIMIT 3 MATCH (e)-[:COUNTRY]->(c:Country) RETURN c.name AS country_name, filings_count",neo4jLabs_synthetic_gpt4turbo,instance_id_26776,neo4jlabs_demo_db_fincen
What are the 'sar_id' values of the filings where the 'beneficiary_bank' is 'Barclays Bank Plc' and the 'originator_country' is 'Singapore'?,MATCH (f:Filing) WHERE f.beneficiary_bank = 'Barclays Bank Plc' AND f.originator_bank_country = 'Singapore' RETURN f.sar_id,neo4jLabs_synthetic_gemini,instance_id_29114,neo4jlabs_demo_db_fincen
Which machines are running applications that depend on the process '8966'?,MATCH (m:Machine)-[:RUNS]->(app:Application)-[:DEPENDS_ON]->(proc:Process {name: '8966'}) RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_20943,neo4jlabs_demo_db_network
List the top 3 genres that have movies with an average IMDb rating over 7.,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WHERE m.imdbRating > 7 WITH g, avg(m.imdbRating) AS avgRating ORDER BY avgRating DESC RETURN g.name AS Genre, avgRating LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24697,neo4jlabs_demo_db_recommendations
Which Filings have a beneficiary bank in 'Angola'?,MATCH (f:Filing) WHERE f.beneficiary_bank_country = 'Angola' RETURN f,neo4jLabs_synthetic_gpt4turbo,instance_id_21492,neo4jlabs_demo_db_fincen
List movies that are part of a genre with ID 10770.,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {id: 10770}) RETURN m.title AS MovieTitle, m.id AS MovieID",neo4jLabs_synthetic_gpt4o,instance_id_44171,neo4jlabs_demo_db_eoflix
"What is the average number of followers for streams that have the language ""ru"" and have at least one VIP who also plays ""Rust""?","MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE l.name = ""ru"" MATCH (s)-[:VIP]->(u:User)-[:MODERATOR]->(:Stream)-[:PLAYS]->(g:Game {name: ""Rust""}) WITH avg(s.followers) AS average_followers RETURN average_followers",neo4jLabs_synthetic_gemini,instance_id_33759,neo4jlabs_demo_db_twitch
What is the average number of favorites for tweets that mention users with a betweenness centrality greater than 100?,MATCH (t:Tweet)-[:MENTIONS]->(u:User) WHERE u.betweenness > 100 WITH avg(t.favorites) AS average_favorites RETURN average_favorites,neo4jLabs_synthetic_gemini,instance_id_34689,neo4jlabs_demo_db_twitter
What is the most common language spoken in movies?,"MATCH (m:Movie)-[:ORIGINAL_LANGUAGE]->(l:Language) WITH l.name AS Language, count(m) AS MovieCount ORDER BY MovieCount DESC RETURN Language, MovieCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_34225,neo4jlabs_demo_db_eoflix
"How many streams have a name that starts with the letter ""I""?",MATCH (s:Stream) WHERE s.name STARTS WITH 'I' RETURN count(s),neo4jLabs_synthetic_gemini,instance_id_34184,neo4jlabs_demo_db_twitch
List the first 5 machines that have a type with CPU greater than 16.,MATCH (m:Machine)-[:TYPE]->(t:Type) WHERE t.cpu > 16 RETURN m.name LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_43772,neo4jlabs_demo_db_network
What are the names of the top 3 entities by number of filings they have originated?,"MATCH (e:Entity)-[:FILED]->(f:Filing)-[:ORIGINATOR]->(e) WITH e, COUNT(f) AS num_filings ORDER BY num_filings DESC LIMIT 3 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_41420,neo4jlabs_demo_db_fincen
What is the average rating given by users to movies with a runtime greater than 180 minutes?,MATCH (movie:Movie) WHERE movie.runtime > 180 WITH avg(movie.average_vote) AS average_rating RETURN average_rating,neo4jLabs_synthetic_gemini,instance_id_31865,neo4jlabs_demo_db_eoflix
List the entities with a jurisdiction of 'SAM' and their jurisdiction descriptions.,"MATCH (e:Entity) WHERE e.jurisdiction = 'SAM' RETURN e.name, e.jurisdiction_description",neo4jLabs_synthetic_gpt4turbo,instance_id_21303,neo4jlabs_demo_db_offshoreleaks
List the top 5 products from 'Exotic Liquids' by units in stock.,"MATCH (s:Supplier {companyName: ""Exotic Liquids""})-[:SUPPLIES]->(p:Product) RETURN p.productName, p.unitsInStock ORDER BY p.unitsInStock DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21843,neo4jlabs_demo_db_northwind
Find the applications that are listening on port 80.,MATCH (app:Application)-[:LISTENS]->(port:Port) WHERE port.port = 80 RETURN app.name,neo4jLabs_synthetic_gemini,instance_id_31669,neo4jlabs_demo_db_network
List the customerIDs of customers who have ordered products with a unit price higher than the average unit price of all products.,MATCH (p:Product) WITH avg(p.unitPrice) AS averageUnitPrice MATCH (c:Customer)-[:PURCHASED]->(:Order)-[:ORDERS]->(p:Product) WHERE p.unitPrice > averageUnitPrice RETURN DISTINCT c.customerID,neo4jLabs_synthetic_gemini,instance_id_30771,neo4jlabs_demo_db_northwind
Name the top 5 movies that have an IMDb ID starting with 'tt'.,"MATCH (m:Movie) WHERE m.imdb_id STARTS WITH 'tt' RETURN m.title, m.imdb_id ORDER BY m.imdb_id LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23550,neo4jlabs_demo_db_eoflix
Which movies released in 1995 have an IMDb rating higher than 8.0?,MATCH (m:Movie) WHERE m.year = 1995 AND m.imdbRating > 8.0 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_29744,neo4jlabs_demo_db_recommendations
Find all networks routing through the interface with IP '10.2.8.254'.,MATCH (n:Network)-[:ROUTES]->(i:Interface {ip: '10.2.8.254'}) RETURN n,neo4jLabs_synthetic_gpt4turbo,instance_id_20314,neo4jlabs_demo_db_network
