question,cypher,data_source,instance_id,database_reference_alias
"List the movies that share at least two common genres with ""Boxtrolls, The"".","MATCH (m:Movie {title: ""Boxtrolls, The""})-[:IN_GENRE]->(g:Genre) WITH m, collect(g) AS genres MATCH (m2:Movie)-[:IN_GENRE]->(g2:Genre) WHERE g2 IN genres AND m2.title <> m.title WITH m2, size(genres) AS totalGenres, count(DISTINCT g2) AS commonGenres WHERE commonGenres >= 2 RETURN DISTINCT m2.title AS movieTitle",neo4jLabs_synthetic_gemini,instance_id_29809,neo4jlabs_demo_db_recommendations
List the first 3 movies that have a vote count greater than 500.,MATCH (m:Movie) WHERE m.vote_count > 500 RETURN m ORDER BY m.vote_count DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23404,neo4jlabs_demo_db_eoflix
What is the name of the movie with the highest revenue and based on a comic book?,"MATCH (m:Movie)-[:HAS_KEYWORD]->(k:Keyword) WHERE k.name = ""comic book"" WITH m ORDER BY m.revenue DESC LIMIT 1 RETURN m.title",neo4jLabs_synthetic_gemini,instance_id_31889,neo4jlabs_demo_db_eoflix
List all the users who are both 'CHATTER' and 'MODERATOR' for the same stream.,MATCH (user:User)-[:CHATTER]->(stream:Stream)<-[:MODERATOR]-(user) RETURN DISTINCT user.name,neo4jLabs_synthetic_gemini,instance_id_33692,neo4jlabs_demo_db_twitch
List the 3 streams where the streamer has the longest ongoing stream based on the creation date.,"MATCH (s:Stream) RETURN s.name, s.createdAt ORDER BY s.createdAt ASC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43582,neo4jlabs_demo_db_twitch
What is the average `amount` of filings where the `originator_bank` is located in the same country as the entity listed as `filer_org_name`?,MATCH (f:Filing)-[:FILED]->(e:Entity) WHERE f.originator_bank_country = e.country RETURN avg(f.amount) AS average_amount,neo4jLabs_synthetic_gemini,instance_id_28300,neo4jlabs_demo_db_fincen
List all movies directed by a person with the name 'Joel Silver'.,MATCH (p:Person {name: 'Joel Silver'})-[:DIRECTED]->(m:Movie) RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_23655,neo4jlabs_demo_db_movies
List the top 5 movies with the lowest imdbVotes.,"MATCH (m:Movie) RETURN m.title, m.imdbVotes ORDER BY m.imdbVotes ASC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41951,neo4jlabs_demo_db_recommendations
What is the original name of the entity with node_id 10000002?,MATCH (e:Entity {node_id: 10000002}) RETURN e.original_name,neo4jLabs_synthetic_gpt4o,instance_id_44900,neo4jlabs_demo_db_offshoreleaks
What are the names of the services that are dependent on the process with pid 8966?,MATCH (p:Process {pid: 8966})-[:DEPENDS_ON]->(s:Service) RETURN s.name AS service_name,neo4jLabs_synthetic_gemini,instance_id_31653,neo4jlabs_demo_db_network
What are the filings with a beneficiary bank from 'China' and an amount over 150000?,MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE c.name = 'China' AND f.amount > 150000 RETURN f,neo4jLabs_synthetic_gpt4o,instance_id_41331,neo4jlabs_demo_db_fincen
"List the first 5 names of Officers associated with the country ""Samoa"".","MATCH (o:Officer)  WHERE o.countries = ""Samoa"" WITH DISTINCT o.name AS officer_name RETURN  officer_name LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_30671,neo4jlabs_demo_db_offshoreleaks
What is the title of the movie with the lowest number of votes?,MATCH (m:Movie) RETURN m.title ORDER BY m.votes ASC LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_33061,neo4jlabs_demo_db_movies
Which tweets by 'neo4j' have been retweeted and also contain a link?,"MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet)-[:CONTAINS]->(l:Link) WHERE exists{(t)-[:RETWEETS]->(:Tweet)} RETURN t, l",neo4jLabs_synthetic_gpt4turbo,instance_id_24980,neo4jlabs_demo_db_twitter
Which actor has acted in movies directed by both Martin Scorsese and Christopher Nolan?,"MATCH (m1:Movie)<-[:DIRECTED]-(d1:Director {name: ""Martin Scorsese""}) MATCH (m2:Movie)<-[:DIRECTED]-(d2:Director {name: ""Christopher Nolan""}) MATCH (a:Actor)-[:ACTED_IN]->(m1) MATCH (a)-[:ACTED_IN]->(m2) RETURN DISTINCT a.name",neo4jLabs_synthetic_gemini,instance_id_29616,neo4jlabs_demo_db_recommendations
"Which movie has the most crew members with a job of ""Director""?","MATCH (m:Movie)<-[cr:CREW_FOR]-(p:Person) WHERE cr.job = 'Director' WITH m, count(p) AS crew_count ORDER BY crew_count DESC RETURN m.title, crew_count LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_31961,neo4jlabs_demo_db_eoflix
"""Which actor acted in Anchorman?""","MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.title = ""Anchorman"" RETURN p.name",neo4j_crowdsourced,instance_id_27857,neo4jlabs_demo_db_movies
List the movies with a release date after 2010.,MATCH (m:Movie) WHERE m.release_date > date('2010-01-01') RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_34197,neo4jlabs_demo_db_eoflix
List the top 5 actors based on the number of leading roles they have had in movies.,"MATCH (p:Person)-[r:CAST_FOR]->(m:Movie) WHERE r.order = 0 RETURN p.name, count(m) AS leading_roles ORDER BY leading_roles DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23170,neo4jlabs_demo_db_eoflix
List the top 3 movies reviewed by the youngest reviewers.,"MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WITH p, m, r, p.born AS birthYear ORDER BY birthYear DESC LIMIT 3 RETURN m.title AS movieTitle, m.released AS releaseYear, r.rating AS reviewRating, p.name AS reviewerName ORDER BY reviewRating DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_40124,neo4jlabs_demo_db_movies
List the top 5 languages with the highest number of streams using them.,"MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WITH l, count(*) AS streamCount ORDER BY streamCount DESC LIMIT 5 RETURN l.name AS language, streamCount",neo4jLabs_synthetic_gemini,instance_id_34180,neo4jlabs_demo_db_twitch
Which intermediaries have an active status?,"MATCH (i:Intermediary) WHERE i.status = 'ACTIVE' RETURN i.name AS intermediary_name, i.countries AS countries, i.address AS address",neo4jLabs_synthetic_gpt4o,instance_id_42531,neo4jlabs_demo_db_offshoreleaks
"Which Entities are connected by the ""same_as"" relationship?","MATCH (e1:Entity)-[r:same_as]->(e2:Entity) RETURN e1.name, e2.name",neo4jLabs_synthetic_gemini,instance_id_31376,neo4jlabs_demo_db_offshoreleaks
Which actors were born in the same year as Keanu Reeves?,MATCH (p:Person {name: 'Keanu Reeves'}) WITH p.born AS birthYear MATCH (other:Person) WHERE other.born = birthYear AND EXISTS((other)-[:ACTED_IN]->(:Movie)) RETURN other.name AS actorName,neo4jLabs_synthetic_gemini,instance_id_32692,neo4jlabs_demo_db_movies
List the first 3 movies with a revenue of zero.,"MATCH (m:Movie) WHERE m.revenue = 0 RETURN m.title, m.release_date ORDER BY m.release_date LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44318,neo4jlabs_demo_db_eoflix
Which entities are intermediaries of 'Top Games Holdings Inc.'?,MATCH (i:Intermediary)-[:intermediary_of]->(e:Entity {name: 'Top Games Holdings Inc.'}) RETURN i,neo4jLabs_synthetic_gpt4turbo,instance_id_21348,neo4jlabs_demo_db_offshoreleaks
Name the top 5 movies that have been produced in more than 3 countries.,"MATCH (m:Movie)-[:PRODUCED_IN_COUNTRY]->(c:Country) WITH m, COUNT(c) AS countryCount WHERE countryCount > 3 RETURN m.title AS movieTitle, countryCount ORDER BY countryCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39714,neo4jlabs_demo_db_eoflix
Which Ports are being listened to by the Application named 'webapp'?,MATCH (app:Application {name: 'webapp'})-[:LISTENS]->(port:Port) RETURN port.port,neo4jLabs_synthetic_gemini,instance_id_32434,neo4jlabs_demo_db_network
Which type of machines are held in rack 'DC1-RCK-1-1'?,MATCH (r:Rack {name: 'DC1-RCK-1-1'})-[:HOLDS]->(m:Machine)-[:TYPE]->(t:Type) RETURN t.name AS MachineType,neo4jLabs_synthetic_gpt4turbo,instance_id_20972,neo4jlabs_demo_db_network
List the names of people who have acted in movies with more than 150 votes.,MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.votes > 150 RETURN DISTINCT p.name,neo4jLabs_synthetic_gemini,instance_id_32719,neo4jlabs_demo_db_movies
List the profile image URLs of the top 3 users who have mentioned 'Neo4j' in their tweets.,MATCH (u:User)-[:POSTS]->(t:Tweet)-[:MENTIONS]->(m:Me {screen_name: 'neo4j'}) RETURN u.profile_image_url ORDER BY t.created_at DESC LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_42941,neo4jlabs_demo_db_twitter
List the actors who have acted in both 'Comedy' and 'Drama' movies.,MATCH (actor:Actor)-[:ACTED_IN]->(comedy:Movie)-[:IN_GENRE]->(genre:Genre) WHERE genre.name = 'Comedy' WITH actor MATCH (actor)-[:ACTED_IN]->(drama:Movie)-[:IN_GENRE]->(genre2:Genre) WHERE genre2.name = 'Drama' RETURN DISTINCT actor.name,neo4jLabs_synthetic_gemini,instance_id_29798,neo4jlabs_demo_db_recommendations
What is the average vote for the video 'Jonah: A VeggieTales Movie'?,MATCH (v:Video {title: 'Jonah: A VeggieTales Movie'}) RETURN v.average_vote,neo4jLabs_synthetic_gemini,instance_id_34352,neo4jlabs_demo_db_eoflix
List all movies with a rating of exactly 85 in the 'REVIEWED' relationship.,MATCH (:Person)-[r:REVIEWED]->(m:Movie) WHERE r.rating = 85 RETURN m.title,neo4jLabs_synthetic_gpt4o,instance_id_39841,neo4jlabs_demo_db_movies
Name 3 persons who have produced the most movies.,"MATCH (p:Person)-[:PRODUCED]->(m:Movie) RETURN p.name, count(m) AS movies_produced ORDER BY movies_produced DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23963,neo4jlabs_demo_db_movies
"What is the total amount of filings filed by ""The Bank of New York Mellon Corp.""?","MATCH (e:Entity {name: ""The Bank of New York Mellon Corp.""})-[:FILED]->(f:Filing) WITH count(f) AS totalFilings RETURN totalFilings",neo4jLabs_synthetic_gemini,instance_id_28257,neo4jlabs_demo_db_fincen
"Find the movies that have a status of ""Released"".","MATCH (m:Movie {status: ""Released""}) RETURN m",neo4jLabs_synthetic_gemini,instance_id_31971,neo4jlabs_demo_db_eoflix
"""Who acted in the second matrix movie""","MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title: ""The Matrix Reloaded""}) RETURN p.name",neo4j_crowdsourced,instance_id_27863,neo4jlabs_demo_db_movies
"What is the name of the package that provides access to the ""Comedy"" genre?","MATCH (g:Genre) WHERE g.name = ""Comedy"" MATCH (p:Package)-[:PROVIDES_ACCESS_TO]->(g) RETURN p.name",neo4jLabs_synthetic_gemini,instance_id_34611,neo4jlabs_demo_db_eoflix
Identify the intermediaries with a status of 'ACTIVE'.,"MATCH (i:Intermediary) WHERE i.status = 'ACTIVE' RETURN i.name AS intermediary_name, i.countries AS countries, i.address AS address, i.sourceID AS sourceID",neo4jLabs_synthetic_gpt4o,instance_id_44582,neo4jlabs_demo_db_offshoreleaks
What is the most common country for entities with a 'Defaulted' status?,"MATCH (e:Entity{status: 'Defaulted'}) WITH e.countries AS country, count(*) AS count RETURN country, count ORDER BY count DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_30943,neo4jlabs_demo_db_offshoreleaks
Which machine type has the lowest RAM to disk ratio among all machines in the data center?,"MATCH (dc:DataCenter)-[:CONTAINS]->(rack:Rack)-[:HOLDS]->(machine:Machine)-[:TYPE]->(type:Type) WITH machine, type,  toFloat(type.ram)/type.disk AS ratio RETURN type.name, ratio ORDER BY ratio ASC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_31724,neo4jlabs_demo_db_network
Which people have reviewed and also produced the movie titled 'The Matrix Revolutions'?,MATCH (p:Person)-[:REVIEWED]->(m:Movie {title: 'The Matrix Revolutions'}) WHERE exists{ (p)-[:PRODUCED]->(m) } RETURN p.name,neo4jLabs_synthetic_gpt4turbo,instance_id_23660,neo4jlabs_demo_db_movies
List the filings with an amount greater than 1000000 where the originator entity is located in a different country than the beneficiary entity.,"MATCH (f:Filing)-[:ORIGINATOR]->(o:Entity), (f:Filing)-[:BENEFITS]->(b:Entity) WHERE f.amount > 1000000 AND o.country <> b.country RETURN f.sar_id",neo4jLabs_synthetic_gemini,instance_id_28176,neo4jlabs_demo_db_fincen
List the first 3 filings that originated from an entity in China.,"MATCH (e:Entity)-[:COUNTRY]->(c:Country {name: ""China""}) MATCH (e)-[:FILED]->(f:Filing) RETURN f ORDER BY f.begin LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_22757,neo4jlabs_demo_db_fincen
Display streams that have a language set to 'en' and were created before 2012.,MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language {name: 'en'}) WHERE s.createdAt < datetime('2012-01-01T00:00:00Z') RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_25745,neo4jlabs_demo_db_twitch
Name the top 5 production companies that have produced movies with a runtime longer than 150 minutes.,"MATCH (p:ProductionCompany)<-[:PRODUCED_BY]-(m:Movie) WHERE m.runtime > 150 RETURN p.name, COUNT(m) AS movie_count ORDER BY movie_count DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39451,neo4jlabs_demo_db_eoflix
Find all movies released before 2000 with an average vote greater than 8.,MATCH (m:Movie) WHERE m.release_date < date('2000-01-01') AND m.average_vote > 8 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_20635,neo4jlabs_demo_db_eoflix
What are the names of the top 3 entities with the most officers associated with them?,"MATCH (e:Entity)<-[r:officer_of]-(o:Officer) WITH e.name AS entity_name, size(collect(o.node_id)) AS officer_count ORDER BY officer_count DESC LIMIT 3 RETURN entity_name",neo4jLabs_synthetic_gemini,instance_id_30543,neo4jlabs_demo_db_offshoreleaks
What is the IP address of the interface that connects to the network with IP '10.4'?,MATCH (n:Network {ip: '10.4'})-[:ROUTES]->(i:Interface) RETURN i.ip,neo4jLabs_synthetic_gemini,instance_id_31647,neo4jlabs_demo_db_network
Which routers are located in zone 2?,MATCH (r:Router) WHERE r.zone = 2 RETURN r.name,neo4jLabs_synthetic_gpt4o,instance_id_44048,neo4jlabs_demo_db_network
List the top 5 customers based in London.,"MATCH (c:Customer {city: ""London""}) RETURN c.companyName, c.contactName, c.contactTitle, c.address, c.postalCode, c.phone, c.fax LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_45302,neo4jlabs_demo_db_northwind
Which data center contains the egress named 'DC1-RE'?,MATCH (dc:DataCenter)-[:CONTAINS]->(e:Egress {name: 'DC1-RE'}) RETURN dc.name,neo4jLabs_synthetic_gpt4turbo,instance_id_20319,neo4jlabs_demo_db_network
List the first 5 categories that do not have any discontinued products.,MATCH (c:Category) WHERE NOT exists {   MATCH (c)<-[:PART_OF]-(p:Product)   WHERE p.discontinued = true } RETURN c LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21694,neo4jlabs_demo_db_northwind
List the first 3 users who follow 'Neo4j' and are located in 'Graphs Are Everywhere'.,"MATCH (u:User)-[:FOLLOWS]->(m:Me {name: 'Neo4j', location: 'Graphs Are Everywhere'}) RETURN u LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24220,neo4jlabs_demo_db_twitter
List the names of people born between 1950 and 1960.,MATCH (p:Person) WHERE p.born >= 1950 AND p.born <= 1960 RETURN p.name,neo4jLabs_synthetic_gemini,instance_id_32889,neo4jlabs_demo_db_movies
What is the average release year of movies with a tagline longer than 30 characters?,MATCH (m:Movie) WHERE size(m.tagline) > 30 RETURN avg(m.released),neo4jLabs_synthetic_gemini,instance_id_32613,neo4jlabs_demo_db_movies
Find all movies where the main language is English and have a budget over 50 million dollars.,"MATCH (m:Movie) WHERE ""English"" IN m.languages AND m.budget > 50000000 RETURN m.title AS title, m.budget AS budget, m.languages AS languages",neo4jLabs_synthetic_gpt4o,instance_id_42145,neo4jlabs_demo_db_recommendations
List the top 5 IP addresses of interfaces connected to the router named 'DC1-R-1'.,MATCH (r:Router {name: 'DC1-R-1'})-[:ROUTES]->(i:Interface) RETURN i.ip LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_44109,neo4jlabs_demo_db_network
List all movies with a revenue greater than 1 billion dollars.,MATCH (m:Movie) WHERE m.revenue > 1000000000 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_25182,neo4jlabs_demo_db_recommendations
List the first 5 products that are part of the 'Meat/Poultry' category and have been discontinued.,MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Meat/Poultry'}) WHERE p.discontinued = true RETURN p LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_22040,neo4jlabs_demo_db_northwind
List the top 5 entities by the number of filings concerning them in 2013.,"MATCH (f:Filing)-[:CONCERNS]->(e:Entity) WHERE f.begin >= datetime('2013-01-01T00:00:00Z') AND f.end <= datetime('2013-12-31T23:59:59Z') WITH e, count(f) AS filingsCount ORDER BY filingsCount DESC LIMIT 5 RETURN e.name, filingsCount",neo4jLabs_synthetic_gpt4turbo,instance_id_21372,neo4jlabs_demo_db_fincen
What are the first 3 racks that hold switches with an IP starting with '10.1'?,MATCH (r:Rack)-[:HOLDS]->(s:Switch) WHERE s.ip STARTS WITH '10.1' RETURN r.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20234,neo4jlabs_demo_db_network
List the names of entities that were defaulted before 2014.,MATCH (e:Entity) WHERE e.status = 'Defaulted' AND e.inactivation_date < '01-JAN-2014' RETURN e.name,neo4jLabs_synthetic_gpt4turbo,instance_id_21315,neo4jlabs_demo_db_offshoreleaks
List the first 3 genres of the movie 'Jumanji'.,MATCH (m:Movie {title: 'Jumanji'}) WITH m MATCH (m)-[:IN_GENRE]->(g:Genre) RETURN g.name LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_34316,neo4jlabs_demo_db_eoflix
List the top 3 products that are in stock and not discontinued.,"MATCH (p:Product) WHERE p.unitsInStock > 0 AND p.discontinued = false RETURN p.productName, p.unitsInStock ORDER BY p.unitsInStock DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44969,neo4jlabs_demo_db_northwind
List the top 5 filings by amount where the beneficiary bank is 'Barclays Bank Plc'.,MATCH (f:Filing) WHERE f.beneficiary_bank = 'Barclays Bank Plc' RETURN f ORDER BY f.amount DESC LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_41372,neo4jlabs_demo_db_fincen
Find the top 5 tweets mentioning 'neo4j' with the most favorites.,MATCH (t:Tweet)-[:MENTIONS]->(u:User) WHERE u.name = 'Neo4j' RETURN t ORDER BY t.favorites DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24852,neo4jlabs_demo_db_twitter
What is the average number of words in the note property of entities?,"MATCH (e:Entity)  WITH size(split(e.note, ' ')) AS words RETURN avg(words) AS average_words",neo4jLabs_synthetic_gemini,instance_id_30606,neo4jlabs_demo_db_offshoreleaks
List the first 3 movies that have been rated by the highest number of users.,"MATCH (m:Movie)<-[:RATED]-(u:User) WITH m, COUNT(u) AS user_count ORDER BY user_count DESC LIMIT 3 RETURN m.title AS MovieTitle, user_count AS NumberOfRatings",neo4jLabs_synthetic_gpt4o,instance_id_44500,neo4jlabs_demo_db_eoflix
List all 'Other' nodes connected to entities and their connection types.,"MATCH (o:Other)-[r:connected_to]->(e:Entity) RETURN o, r, e",neo4jLabs_synthetic_gpt4turbo,instance_id_21166,neo4jlabs_demo_db_offshoreleaks
Find the top 5 countries where the entities have filed the least number of filings.,"MATCH (e:Entity)-[:FILED]->(f:Filing) MATCH (e)-[:COUNTRY]->(c:Country) WITH c.name AS country, COUNT(f) AS filings_count ORDER BY filings_count ASC LIMIT 5 RETURN country, filings_count",neo4jLabs_synthetic_gpt4o,instance_id_41109,neo4jlabs_demo_db_fincen
List the movies that have a plot mentioning 'kingdom'.,"MATCH (m:Movie) WHERE m.plot CONTAINS 'kingdom' RETURN m.title AS MovieTitle, m.plot AS Plot",neo4jLabs_synthetic_gpt4o,instance_id_42791,neo4jlabs_demo_db_recommendations
How many 'Interface' nodes are connected to other 'Interface' nodes?,MATCH (i:Interface)-[:CONNECTS]-(j:Interface) WITH count(DISTINCT i) AS connected_interface_count RETURN connected_interface_count,neo4jLabs_synthetic_gemini,instance_id_31755,neo4jlabs_demo_db_network
"List the names of all services that are dependencies of the application ""webserver"".","MATCH (app:Application {name: ""webserver""})-[:DEPENDS_ON]->(service:Service) RETURN service.name",neo4jLabs_synthetic_gemini,instance_id_32358,neo4jlabs_demo_db_network
"List all teams that have at least two streams with more than 5,000 followers each.","MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WHERE s.followers > 5000 WITH t, count(*) AS streamCount WHERE streamCount >= 2 RETURN t.name",neo4jLabs_synthetic_gemini,instance_id_33918,neo4jlabs_demo_db_twitch
Identify the top 5 users based on the number of posts they have made.,"MATCH (u:User)-[:POSTS]->(t:Tweet) WITH u, COUNT(t) AS post_count ORDER BY post_count DESC LIMIT 5 RETURN u.screen_name AS username, post_count",neo4jLabs_synthetic_gpt4o,instance_id_43139,neo4jlabs_demo_db_twitter
List the directors who have directed movies with a runtime longer than 3 hours.,MATCH (m:Movie) WHERE m.runtime > 180 MATCH (d:Director)-[:DIRECTED]->(m) RETURN DISTINCT d.name,neo4jLabs_synthetic_gemini,instance_id_29531,neo4jlabs_demo_db_recommendations
Which 3 categories have the most products with units in stock over 50?,"MATCH (p:Product)-[:PART_OF]->(c:Category) WHERE p.unitsInStock > 50 RETURN c.categoryName, count(p) AS ProductCount ORDER BY ProductCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_22000,neo4jlabs_demo_db_northwind
What is the total amount of filings where the originator entity is located in 'DEU' and the beneficiary entity is located in 'GBR'?,"MATCH (f:Filing)-[:ORIGINATOR]->(o:Entity),       (f)-[:BENEFITS]->(b:Entity) WHERE o.country = 'DEU' AND b.country = 'GBR' RETURN sum(f.amount) AS total_amount",neo4jLabs_synthetic_gemini,instance_id_28077,neo4jlabs_demo_db_fincen
What are the top 5 filings based on the number of beneficiaries they concern?,"MATCH (f:Filing)-[:CONCERNS]->(e:Entity) WITH f, count(e) as beneficiary_count ORDER BY beneficiary_count DESC LIMIT 5 RETURN f.sar_id AS filing_id, beneficiary_count",neo4jLabs_synthetic_gpt4o,instance_id_41432,neo4jlabs_demo_db_fincen
"Find the movie with the lowest rating that has the word ""Welcome"" in its tagline.","MATCH (m:Movie) WHERE m.tagline CONTAINS 'Welcome' RETURN m.title, m.rating ORDER BY m.rating LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32616,neo4jlabs_demo_db_movies
Show the top 5 people by the number of movies they have directed.,"MATCH (p:Person)-[:DIRECTED]->(m:Movie) WITH p, count(m) AS moviesDirected ORDER BY moviesDirected DESC LIMIT 5 RETURN p.name, moviesDirected",neo4jLabs_synthetic_gpt4turbo,instance_id_23671,neo4jlabs_demo_db_movies
What is the name of the movie with the highest budget?,"MATCH (m:Movie) RETURN m.title, m.budget ORDER BY m.budget DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29626,neo4jlabs_demo_db_recommendations
"""Which movies had more than 50 actors?""","MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WITH m, count(p) AS actorCount WHERE actorCount > 50 RETURN m.title, actorCount",neo4j_crowdsourced,instance_id_27668,neo4jlabs_demo_db_movies
Find the top 5 entities that have the most filings concerning entities in their own country.,"MATCH (e:Entity)-[:FILED]->(f:Filing)-[:CONCERNS]->(c:Entity) MATCH (e)-[:COUNTRY]->(ec:Country) MATCH (c)-[:COUNTRY]->(cc:Country) WHERE ec.code = cc.code WITH e, COUNT(f) AS filing_count ORDER BY filing_count DESC LIMIT 5 RETURN e.name AS entity_name, filing_count",neo4jLabs_synthetic_gpt4o,instance_id_41299,neo4jlabs_demo_db_fincen
Show details of customers who have placed more than 5 orders.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WITH c, count(o) AS ordersCount WHERE ordersCount > 5 RETURN c",neo4jLabs_synthetic_gpt4turbo,instance_id_20450,neo4jlabs_demo_db_northwind
"What is the average number of favorites for tweets that mention users who have a similarity score greater than 0.9 to ""Neo4j""?","MATCH (me:Me {name: 'Neo4j'})-[:SIMILAR_TO]->(similarUser:User) WHERE similarUser.score > 0.9 WITH me, collect(similarUser) AS similarUsers UNWIND similarUsers AS su MATCH (tweet:Tweet)-[:MENTIONS]->(su) RETURN avg(tweet.favorites)",neo4jLabs_synthetic_gemini,instance_id_34544,neo4jlabs_demo_db_twitter
List the top 5 orders with the highest quantity ordered.,"MATCH (o:Order)-[r:ORDERS]->(p:Product) RETURN o.orderID, SUM(r.quantity) AS TotalQuantity ORDER BY TotalQuantity DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_20485,neo4jlabs_demo_db_northwind
"""Who is director that Tom Hanks worked most with?""","MATCH (tom:Person {name: ""Tom Hanks""})-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(director:Person) RETURN director.name, COUNT(*) AS collaborations ORDER BY collaborations DESC LIMIT 1",neo4j_crowdsourced,instance_id_27538,neo4jlabs_demo_db_movies
"List the streams that have chatters with the name 'itsbigchase' and more than 100,000 total views.","MATCH (u:User {name: 'itsbigchase'})-[:CHATTER]->(s:Stream) WHERE s.total_view_count > 100000 RETURN s.name AS stream_name, s.url AS stream_url, s.total_view_count AS total_views",neo4jLabs_synthetic_gpt4o,instance_id_43313,neo4jlabs_demo_db_twitch
Find all users who mention 'neo4j' in their tweets and are located in 'Graphs Are Everywhere'.,"MATCH (u:User {location: 'Graphs Are Everywhere'})-[:POSTS]->(t:Tweet)-[:MENTIONS]->(m:User {name: 'Neo4j'}) RETURN u, t",neo4jLabs_synthetic_gpt4turbo,instance_id_24245,neo4jlabs_demo_db_twitter
What is the average quantity of products ordered by the customer with customerID equal to 'ALFKI'?,"MATCH (c:Customer {customerID: 'ALFKI'})-[:PURCHASED]->(o:Order)-[orders:ORDERS]->(p:Product) WITH c, avg(toFloat(orders.quantity)) AS averageQuantity RETURN averageQuantity",neo4jLabs_synthetic_gemini,instance_id_32600,neo4jlabs_demo_db_northwind
"""which product was ordered most by a single customer? And who was this customer?""","MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[r:ORDERS]->(p:Product) RETURN p.productName, c.companyName, SUM(r.quantity) AS totalQuantity ORDER BY totalQuantity DESC LIMIT 1",neo4j_crowdsourced,instance_id_27349,neo4jlabs_demo_db_northwind
What is the average number of votes for movies released in the year 2010?,MATCH (m:Movie {released: 2010}) WITH avg(m.votes) AS average_votes RETURN average_votes,neo4jLabs_synthetic_gemini,instance_id_34376,neo4jlabs_demo_db_movies
"What is the tagline of the movie ""Toy Story""?","MATCH (m:Movie {title: ""Toy Story""}) RETURN m.tagline",neo4jLabs_synthetic_gemini,instance_id_31822,neo4jlabs_demo_db_eoflix
Name the top 3 Applications that depend on Process '8966'.,MATCH (p:Process {pid: 8966})<-[:DEPENDS_ON]-(a:Application) RETURN a.name AS application_name ORDER BY a.startTime DESC LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43850,neo4jlabs_demo_db_network
What are the names of suppliers based in the UK?,MATCH (s:Supplier) WHERE s.country = 'UK' RETURN s.companyName AS supplierName,neo4jLabs_synthetic_gpt4o,instance_id_45397,neo4jlabs_demo_db_northwind
List the types of companies found in the 'Other' node category.,MATCH (o:Other) RETURN DISTINCT o.type,neo4jLabs_synthetic_gpt4turbo,instance_id_21353,neo4jlabs_demo_db_offshoreleaks
What are the discontinued products?,"MATCH (p:Product) WHERE p.discontinued = true RETURN p.productName, p.productID",neo4jLabs_synthetic_gpt4turbo,instance_id_22062,neo4jlabs_demo_db_northwind
List the orders that include products with a quantity ordered greater than the average quantity ordered for that product.,"MATCH (o:Order)-[orders:ORDERS]->(p:Product) WITH p, avg(orders.quantity) AS avg_quantity MATCH (o:Order)-[orders:ORDERS]->(p) WHERE orders.quantity > avg_quantity RETURN DISTINCT o",neo4jLabs_synthetic_gemini,instance_id_30801,neo4jlabs_demo_db_northwind
Name the first 3 adult films with the highest average vote.,"MATCH (a:Adult) RETURN a.title, a.average_vote ORDER BY a.average_vote DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44189,neo4jlabs_demo_db_eoflix
"Which machines are running the application ""webserver""?",MATCH (app:Application {name: 'webserver'})<-[:RUNS]-(machine:Machine) RETURN machine.name,neo4jLabs_synthetic_gemini,instance_id_31579,neo4jlabs_demo_db_network
What are the top 3 entities with the most filings that benefit entities in 'United Kingdom'?,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country {name: 'United Kingdom'}) WITH e, count(f) AS filingsCount ORDER BY filingsCount DESC LIMIT 3 RETURN e, filingsCount",neo4jLabs_synthetic_gpt4turbo,instance_id_26802,neo4jlabs_demo_db_fincen
Which 3 countries have the largest number of entities that are originators in filings?,"MATCH (c:Country)<-[:COUNTRY]-(e:Entity)<-[:ORIGINATOR]-(f:Filing) WITH c.name AS country, COUNT(DISTINCT e.id) AS num_originators ORDER BY num_originators DESC LIMIT 3 RETURN country, num_originators",neo4jLabs_synthetic_gpt4o,instance_id_41157,neo4jlabs_demo_db_fincen
How many zones are there in the 'DC1' DataCenter?,MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(z:Zone) RETURN count(z) AS NumberOfZones,neo4jLabs_synthetic_gpt4turbo,instance_id_20967,neo4jlabs_demo_db_network
What are the URLs of the first 3 streams that have no chatters?,MATCH (s:Stream) WHERE NOT (s)<-[:CHATTER]-(:User) RETURN s.url ORDER BY s.createdAt LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43275,neo4jlabs_demo_db_twitch
List the top 3 oldest movies in the database.,MATCH (m:Movie) WHERE m.release_date IS NOT NULL RETURN m ORDER BY m.release_date ASC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23511,neo4jlabs_demo_db_eoflix
List the top 5 streams with the most chatters who are users.,"MATCH (s:Stream)<-[:CHATTER]-(u:User) WITH s, COUNT(u) AS chatterCount ORDER BY chatterCount DESC LIMIT 5 RETURN s.name AS streamName, chatterCount",neo4jLabs_synthetic_gpt4o,instance_id_42932,neo4jlabs_demo_db_twitch
List the streams where 'romandoduik' is a chatter.,MATCH (u:User {name: 'romandoduik'})-[:CHATTER]->(s:Stream) RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_25476,neo4jlabs_demo_db_twitch
"What is the total amount of filings originated by entities located in Singapore where the beneficiary entity is located in the same country as ""The Bank of New York Mellon Corp.""?","MATCH (e:Entity {name: ""The Bank of New York Mellon Corp.""})-[:COUNTRY]->(country:Country) WITH country.code AS beneficiary_country MATCH (f:Filing)-[:BENEFITS]->(be:Entity)-[:COUNTRY]->(bc:Country) WHERE bc.code = beneficiary_country  MATCH (f)-[:ORIGINATOR]->(oe:Entity)-[:COUNTRY]->(oc:Country {name: ""Singapore""}) RETURN sum(f.amount) AS total_amount",neo4jLabs_synthetic_gemini,instance_id_29074,neo4jlabs_demo_db_fincen
Find all countries that have at least one entity located within their borders.,"MATCH (e:Entity)-[:COUNTRY]->(c:Country) WITH c, count(e) AS entityCount WHERE entityCount >= 1 RETURN c.name AS countryName",neo4jLabs_synthetic_gemini,instance_id_28240,neo4jlabs_demo_db_fincen
List the product names of the products in the order with the highest freight cost.,MATCH (o:Order) WITH o ORDER BY toFloat(o.freight) DESC LIMIT 1 MATCH (o)-[:ORDERS]->(p:Product) RETURN p.productName,neo4jLabs_synthetic_gemini,instance_id_30873,neo4jlabs_demo_db_northwind
"""Which relationships among movies are in the database and which are their properties?""","MATCH ()-[r]->(:Movie) RETURN DISTINCT type(r) AS RelationshipType, keys(r) AS Properties",neo4j_crowdsourced,instance_id_27772,neo4jlabs_demo_db_movies
Which hashtags are used by users who have a high number of 'followers'?,MATCH (u:User)-[:POSTS]->(t:Tweet)-[:TAGS]->(h:Hashtag) WHERE u.followers > 5000 RETURN DISTINCT h.name,neo4jLabs_synthetic_gemini,instance_id_33852,neo4jlabs_demo_db_twitter
What is the name of the entity that is the `CONCERNS` in the filing with the earliest `begin_date`?,MATCH (f:Filing) WITH f ORDER BY f.begin_date ASC LIMIT 1 MATCH (f)-[:CONCERNS]->(e:Entity) RETURN e.name,neo4jLabs_synthetic_gemini,instance_id_28326,neo4jlabs_demo_db_fincen
Which 3 suppliers have products listed in both 'Beverages' and 'Condiments' categories?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product)-[:PART_OF]->(c:Category) WHERE c.categoryName IN ['Beverages', 'Condiments'] WITH s, count(DISTINCT c) AS categoriesCount WHERE categoriesCount = 2 RETURN s LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21866,neo4jlabs_demo_db_northwind
