question,cypher,data_source,instance_id,database_reference_alias
Which top 5 countries are most frequently listed as the beneficiary bank country in filings?,"MATCH (f:Filing) WHERE f.beneficiary_bank_country IS NOT NULL RETURN f.beneficiary_bank_country AS Country, count(f) AS FilingsCount ORDER BY FilingsCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21528,neo4jlabs_demo_db_fincen
"List the names of all softwares that have a dependency on the application ""webserver"".",MATCH (app:Application {name: 'webserver'})<-[:DEPENDS_ON]-(software:Software) RETURN DISTINCT software.name,neo4jLabs_synthetic_gemini,instance_id_32353,neo4jlabs_demo_db_network
What languages are spoken in the movie with the highest budget?,MATCH (m:Movie) WITH m ORDER BY m.budget DESC LIMIT 1 MATCH (m)-[:SPOKEN_IN_LANGUAGE]->(l:Language) RETURN l.name,neo4jLabs_synthetic_gemini,instance_id_34624,neo4jlabs_demo_db_eoflix
What is the average incorporation year for all Entities registered in Hong Kong?,"MATCH (e:Entity {countries: ""Hong Kong""}) WITH toInteger(substring(e.incorporation_date, 0, 4)) AS incorporationYear RETURN avg(incorporationYear) AS averageIncorporationYear",neo4jLabs_synthetic_gemini,instance_id_30626,neo4jlabs_demo_db_offshoreleaks
Which Zone routes to Interface with IP '10.2.8.254'?,MATCH (z:Zone)-[:ROUTES]->(i:Interface {ip: '10.2.8.254'}) RETURN z,neo4jLabs_synthetic_gpt4turbo,instance_id_20111,neo4jlabs_demo_db_network
Who are the actors born in the same year as Tom Hanks?,"MATCH (tomHanks:Person {name: ""Tom Hanks""}) MATCH (otherPerson:Person) WHERE otherPerson.born = tomHanks.born RETURN otherPerson.name",neo4jLabs_synthetic_gemini,instance_id_32807,neo4jlabs_demo_db_movies
Identify the first 3 users who are VIPs in streams with a name containing 'big'.,MATCH (u:User)-[:VIP]->(s:Stream) WHERE s.name CONTAINS 'big' RETURN u LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24544,neo4jlabs_demo_db_twitch
"Find the streams that are both moderated and have VIP users, and list their names.",MATCH (s:Stream)-[:MODERATOR]->() MATCH (s)-[:VIP]->() RETURN s.name,neo4jLabs_synthetic_gemini,instance_id_34085,neo4jlabs_demo_db_twitch
Which products have 'unitsInStock' exactly 0 and are not discontinued?,"MATCH (p:Product) WHERE p.unitsInStock = 0 AND p.discontinued = false RETURN p.productName, p.productID",neo4jLabs_synthetic_gpt4o,instance_id_45343,neo4jlabs_demo_db_northwind
"What are the names of the entities that the officer with name ""MOSSFON SUBSCRIBERS LTD."" is an officer of?","MATCH (o:Officer {name: ""MOSSFON SUBSCRIBERS LTD.""})-[r:officer_of]->(e:Entity) RETURN e.name",neo4jLabs_synthetic_gemini,instance_id_30574,neo4jlabs_demo_db_offshoreleaks
Which suppliers have supplied products that are currently discontinued?,MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE p.discontinued = true RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_22077,neo4jlabs_demo_db_northwind
Show the top 5 actors who have acted in movies with at least three different directors.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(d:Director) WITH a, m, count(DISTINCT d) AS numDirectors WHERE numDirectors >= 3 RETURN a.name, count(DISTINCT m) AS moviesWithThreeDirectors ORDER BY moviesWithThreeDirectors DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21188,neo4jlabs_demo_db_recommendations
List the top 3 tweets that mention 'Neo4j' and have more than 100 favorites.,MATCH (t:Tweet)-[:MENTIONS]->(u:User {name: 'Neo4j'}) WHERE t.favorites > 100 RETURN t ORDER BY t.favorites DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24249,neo4jlabs_demo_db_twitter
"List the ""countries"" values of all Entities that are linked to an Intermediary with the ""status"" of ""SUSPENDED"".",MATCH (i:Intermediary {status: 'SUSPENDED'})-[:intermediary_of]->(e:Entity) RETURN DISTINCT e.countries,neo4jLabs_synthetic_gemini,instance_id_31393,neo4jlabs_demo_db_offshoreleaks
What is the average runtime of movies released before 1980?,MATCH (m:Movie) WHERE m.year < 1980 RETURN avg(m.runtime) AS average_runtime,neo4jLabs_synthetic_gemini,instance_id_29337,neo4jlabs_demo_db_recommendations
Which 3 suppliers have the least number of products listed?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WITH s, count(p) AS numProducts ORDER BY numProducts ASC LIMIT 3 RETURN s.companyName, numProducts",neo4jLabs_synthetic_gpt4turbo,instance_id_21704,neo4jlabs_demo_db_northwind
Which streams have a language named after a country code 'en'?,"MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language {name: 'en'}) RETURN s.name AS stream_name, s.url AS stream_url",neo4jLabs_synthetic_gpt4o,instance_id_43548,neo4jlabs_demo_db_twitch
"What is the most common language spoken in movies, excluding English?","MATCH (m:Movie)-[:ORIGINAL_LANGUAGE]->(l:Language) WHERE l.id <> 'en' WITH l.name AS language, count(*) AS count ORDER BY count DESC RETURN language, count LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32004,neo4jlabs_demo_db_eoflix
List all products with 'unitPrice' less than 5.,"MATCH (p:Product) WHERE p.unitPrice < 5 RETURN p.productName, p.unitPrice",neo4jLabs_synthetic_gpt4o,instance_id_45341,neo4jlabs_demo_db_northwind
Find the top 3 processes with the earliest start times.,"MATCH (p:Process) RETURN p.name, p.startTime ORDER BY p.startTime ASC LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_31720,neo4jlabs_demo_db_network
"What is the total number of streams that have at least one moderator and one VIP who are different users and belong to a team created before 2017 and have more than 50,000 followers?","MATCH (s:Stream) WHERE (s)-[:MODERATOR]->(:User) AND (s)-[:VIP]->(:User) MATCH (s)-[:MODERATOR]->(m:User), (s)-[:VIP]->(v:User) WHERE m <> v MATCH (s)-[:HAS_TEAM]->(t:Team) WHERE t.createdAt < datetime('2017-01-01T00:00:00Z') AND s.followers > 50000 WITH DISTINCT s RETURN count(s) AS streamCount",neo4jLabs_synthetic_gemini,instance_id_33824,neo4jlabs_demo_db_twitch
"Find the shortest path between the stream with the highest follower count and the game ""Rust"".",MATCH (s:Stream) WITH s ORDER BY s.followers DESC LIMIT 1 MATCH p = shortestPath((s)-[*]-(g:Game {name: 'Rust'})) RETURN p,neo4jLabs_synthetic_gemini,instance_id_34123,neo4jlabs_demo_db_twitch
"Find the users who follow ""Neo4j"" and have posted tweets using the ""Buffer"" source.",MATCH (neo:User {name: 'Neo4j'}) MATCH (follower:User)-[:FOLLOWS]->(neo) MATCH (follower)-[:POSTS]->(tweet:Tweet)-[:USING]->(source:Source {name: 'Buffer'}) RETURN DISTINCT follower.screen_name,neo4jLabs_synthetic_gemini,instance_id_34702,neo4jlabs_demo_db_twitter
List the first 3 adult films with a tagline containing the word 'sex'.,MATCH (a:Adult) WHERE a.tagline CONTAINS 'sex' RETURN a LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20843,neo4jlabs_demo_db_eoflix
How many filings are there with an originator bank from 'United Kingdom'?,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country {name: 'United Kingdom'}) RETURN count(f) AS number_of_filings,neo4jLabs_synthetic_gpt4o,instance_id_41334,neo4jlabs_demo_db_fincen
List the first 3 movies that have an 'average_vote' greater than 8.,"MATCH (m:Movie) WHERE m.average_vote > 8 RETURN m.title, m.average_vote ORDER BY m.average_vote DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44390,neo4jlabs_demo_db_eoflix
Which 3 customers have ordered the most products from the 'Dairy Products' category?,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product)-[:PART_OF]->(cat:Category {categoryName: ""Dairy Products""}) WITH c, count(p) AS products_ordered ORDER BY products_ordered DESC LIMIT 3 RETURN c.companyName, products_ordered",neo4jLabs_synthetic_gpt4turbo,instance_id_20382,neo4jlabs_demo_db_northwind
List the top 5 IP addresses of interfaces connected to the router named 'DC1-R-1'.,MATCH (r:Router {name: 'DC1-R-1'})-[:ROUTES]->(i:Interface) RETURN i.ip AS IPAddress LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_20102,neo4jlabs_demo_db_network
What are the 'ip' addresses of 'Switch' nodes in 'rack' 1?,MATCH (r:Rack {rack: 1})-[ :HOLDS ]->(s:Switch) RETURN s.ip,neo4jLabs_synthetic_gemini,instance_id_31597,neo4jlabs_demo_db_network
What are the first 5 movies that have no revenue recorded?,"MATCH (m:Movie) WHERE m.revenue IS NULL OR m.revenue = 0 RETURN m.title, m.id LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44242,neo4jlabs_demo_db_eoflix
List 3 movies released in 1995.,MATCH (m:Movie) WHERE m.year = 1995 RETURN m.title LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_42482,neo4jlabs_demo_db_recommendations
List the names of countries where the beneficiary bank of the filing is located. Limit to top 5 results.,MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country) RETURN DISTINCT c.name LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21199,neo4jlabs_demo_db_fincen
List the top 5 packages by the number of subscriptions associated with them.,"MATCH (p:Package)<-[:FOR_PACKAGE]-(s:Subscription) RETURN p.name AS PackageName, count(s) AS SubscriptionsCount ORDER BY SubscriptionsCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23164,neo4jlabs_demo_db_eoflix
"What are the names of the teams that have streams with more than 5,000 followers and have at least one VIP who also plays ""Rust"" and have at least one moderator and have at least one chatter?","MATCH (s:Stream) WHERE s.followers > 5000 MATCH (s)-[:HAS_TEAM]->(t:Team),   (s)-[:VIP]->(vip)-[:PLAYS]->(g:Game { name: ""Rust"" }),   (s)-[:MODERATOR]->(:User),   (s)-[:CHATTER]->(:User) RETURN DISTINCT t.name",neo4jLabs_synthetic_gemini,instance_id_33764,neo4jlabs_demo_db_twitch
How many entities have a registered address in a country that is different from their own country?,MATCH (e:Entity)-[:registered_address]->(a:Address) WHERE e.countries <> a.countries RETURN count(DISTINCT e) AS count,neo4jLabs_synthetic_gemini,instance_id_30612,neo4jlabs_demo_db_offshoreleaks
List the screen names of users who have a 'betweenness' score greater than 800 and have posted tweets containing links.,MATCH (user:User)-[:POSTS]->(tweet:Tweet)-[:CONTAINS]->(link:Link) WHERE user.betweenness > 800 RETURN DISTINCT user.screen_name,neo4jLabs_synthetic_gemini,instance_id_34680,neo4jlabs_demo_db_twitter
"Find the streams that have ""maximilian_dood"" as a moderator and have ""en"" as their language.",MATCH (u:User {name: 'maximilian_dood'})-[:MODERATOR]->(s:Stream) MATCH (s)-[:HAS_LANGUAGE]->(l:Language {name: 'en'}) RETURN s,neo4jLabs_synthetic_gemini,instance_id_34034,neo4jlabs_demo_db_twitch
List the first 3 packages that provide access to the 'Drama' genre.,MATCH (p:Package)-[:PROVIDES_ACCESS_TO]->(g:Genre {name: 'Drama'}) RETURN p.name LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_44335,neo4jlabs_demo_db_eoflix
What is the tagline of the video 'Jonah: A VeggieTales Movie'?,MATCH (v:Video {title: 'Jonah: A VeggieTales Movie'}) RETURN v.tagline,neo4jLabs_synthetic_gemini,instance_id_34351,neo4jlabs_demo_db_eoflix
What is the average revenue generated by movies released in each decade?,"MATCH (m:Movie) WITH m, 10 * (m.release_date.year / 10) AS decade WITH decade, avg(m.revenue) AS average_revenue RETURN decade, average_revenue ORDER BY decade",neo4jLabs_synthetic_gemini,instance_id_31926,neo4jlabs_demo_db_eoflix
Find the 3 streams with the most distinct languages used.,"MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WITH s, count(DISTINCT l) AS languageCount RETURN s.name AS streamName, languageCount ORDER BY languageCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43596,neo4jlabs_demo_db_twitch
List the top 5 movies based on popularity.,MATCH (m:Movie) RETURN m ORDER BY m.popularity DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23148,neo4jlabs_demo_db_eoflix
What is the average unitsOnOrder of products supplied by the supplier with companyName equal to 'Exotic Liquids'?,MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE s.companyName = 'Exotic Liquids' RETURN avg(p.unitsOnOrder),neo4jLabs_synthetic_gemini,instance_id_32545,neo4jlabs_demo_db_northwind
List the first 5 actors who have acted in movies directed by a director born in Nebraska.,"MATCH (d:Director)-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(a:Actor) WHERE d.bornIn CONTAINS ""Nebraska"" RETURN DISTINCT a.name LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_42498,neo4jlabs_demo_db_recommendations
Find entities that have been both struck off and inactivated in the same year.,"MATCH (e:Entity) WHERE e.struck_off_date IS NOT NULL AND e.inactivation_date IS NOT NULL   AND substring(e.struck_off_date, 7) = substring(e.inactivation_date, 7) RETURN e",neo4jLabs_synthetic_gpt4turbo,instance_id_21169,neo4jlabs_demo_db_offshoreleaks
What is the average IMDb rating of movies based on books?,MATCH (m:Movie) RETURN avg(m.imdbRating) AS average_rating,neo4jLabs_synthetic_gemini,instance_id_29773,neo4jlabs_demo_db_recommendations
List 3 movies reviewed with the summary 'An amazing journey'.,MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE r.summary = 'An amazing journey' RETURN m.title LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_40010,neo4jlabs_demo_db_movies
List all officers with the country code 'KOR'.,MATCH (o:Officer {country_codes: 'KOR'}) RETURN o,neo4jLabs_synthetic_gpt4turbo,instance_id_21307,neo4jlabs_demo_db_offshoreleaks
What are the 'sar_id' values of the filings that benefited the entity with ID 'barclays-bank-plc-london-england-gbr'?,MATCH (e:Entity {id: 'barclays-bank-plc-london-england-gbr'})<-[:BENEFITS]-(f:Filing) RETURN f.sar_id,neo4jLabs_synthetic_gemini,instance_id_29078,neo4jlabs_demo_db_fincen
What is the average 'amount' of filings for each distinct 'originator_bank_country'?,"MATCH (f:Filing) WITH f.originator_bank_country AS originator_bank_country, avg(f.amount) AS average_amount RETURN originator_bank_country, average_amount",neo4jLabs_synthetic_gemini,instance_id_29099,neo4jlabs_demo_db_fincen
Find the filings where the originator entity and beneficiary entity are both located in landlocked countries.,MATCH (filing:Filing) MATCH (filing)-[:ORIGINATOR]->(originator:Entity) MATCH (originator)-[:COUNTRY]->(originatorCountry:Country) WHERE originatorCountry.tld IS NULL MATCH (filing)-[:BENEFITS]->(beneficiary:Entity) MATCH (beneficiary)-[:COUNTRY]->(beneficiaryCountry:Country) WHERE beneficiaryCountry.tld IS NULL RETURN filing,neo4jLabs_synthetic_gemini,instance_id_29224,neo4jlabs_demo_db_fincen
What is the maximum amount filed between 2006-01-01T00:00:00Z and 2006-12-31T00:00:00Z?,MATCH (f:Filing) WHERE f.begin >= datetime('2006-01-01T00:00:00Z') AND f.begin <= datetime('2006-12-31T00:00:00Z') RETURN max(f.amount) AS max_amount,neo4jLabs_synthetic_gemini,instance_id_29035,neo4jlabs_demo_db_fincen
List the top 5 teams by the number of streams they have.,"MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WITH t, count(s) AS stream_count ORDER BY stream_count DESC LIMIT 5 RETURN t.name AS team_name, stream_count",neo4jLabs_synthetic_gpt4o,instance_id_43269,neo4jlabs_demo_db_twitch
How many movies were released in each year?,"MATCH (m:Movie) WITH m.year AS releaseYear, count(m) AS movieCount RETURN releaseYear, movieCount ORDER BY releaseYear",neo4jLabs_synthetic_gemini,instance_id_29308,neo4jlabs_demo_db_recommendations
List the first 3 orders that were placed in 1997 and required a freight charge over $25.,"MATCH (o:Order) WHERE o.orderDate STARTS WITH '1997' AND toFloat(o.freight) > 25 RETURN o.orderID, o.orderDate, o.freight ORDER BY o.orderDate LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44646,neo4jlabs_demo_db_northwind
Identify the first 3 links contained in tweets that have been favorited more than 200 times.,MATCH (t:Tweet)-[:CONTAINS]->(l:Link) WHERE t.favorites > 200 RETURN l.url LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24975,neo4jlabs_demo_db_twitter
Which person acted in the movie written by the person born in 1949?,MATCH (p:Person {born: 1949})-[:WROTE]->(m:Movie)<-[:ACTED_IN]-(actor:Person) RETURN actor.name,neo4jLabs_synthetic_gemini,instance_id_34359,neo4jlabs_demo_db_movies
List the first 5 directors who have a biography listed in their profile.,MATCH (d:Director) WHERE d.bio IS NOT NULL RETURN d LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21186,neo4jlabs_demo_db_recommendations
List the `supplierID` and the number of different categories they supply products for.,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product)-[:PART_OF]->(c:Category) WITH s, count(DISTINCT c) AS categoryCount RETURN s.supplierID, categoryCount",neo4jLabs_synthetic_gemini,instance_id_30838,neo4jlabs_demo_db_northwind
Which 3 movies have the lowest average vote and more than 100 vote counts?,MATCH (m:Movie) WHERE m.vote_count > 100 RETURN m ORDER BY m.average_vote ASC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23626,neo4jlabs_demo_db_eoflix
Identify the streams where 'itsbigchase' is both a moderator and VIP.,MATCH (u:User {name: 'itsbigchase'}) MATCH (s:Stream)-[:MODERATOR]->(u) WHERE exists{ (s)-[:VIP]->(u) } RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_25489,neo4jlabs_demo_db_twitch
Show the top 5 genres of movies that have been rated by the most users.,"MATCH (u:User)-[:RATED]->(m:Movie)-[:IN_GENRE]->(g:Genre) WITH g, count(DISTINCT u) AS userCount ORDER BY userCount DESC RETURN g.name AS Genre, userCount LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_24767,neo4jlabs_demo_db_recommendations
What is the total number of Entities registered in Hong Kong?,MATCH (e:Entity) WHERE e.countries CONTAINS 'Hong Kong' RETURN count(*) AS numberOfEntities,neo4jLabs_synthetic_gemini,instance_id_30724,neo4jlabs_demo_db_offshoreleaks
"""are the routers connected to servers""","MATCH (r:Router)-[:ROUTES]->(:Interface)-[:CONNECTS]->(:Interface)<-[:ROUTES]-(m:Machine) RETURN DISTINCT r.name AS RouterName, m.name AS MachineName",neo4j_crowdsourced,instance_id_27852,neo4jlabs_demo_db_network
Which products have a unitsOnOrder of zero and are discontinued?,"MATCH (p:Product) WHERE p.unitsOnOrder = 0 AND p.discontinued = true RETURN p.productName, p.productID",neo4jLabs_synthetic_gpt4turbo,instance_id_21685,neo4jlabs_demo_db_northwind
What is the average amount of filings concerning entities located in the same country as the entity with ID 'cimb-bank-berhad'?,MATCH (e1:Entity {id: 'cimb-bank-berhad'})-[:COUNTRY]->(c:Country) MATCH (e1)-[:CONCERNS]->(f:Filing)-[:CONCERNS]->(e2:Entity)-[:COUNTRY]->(c) RETURN avg(f.amount) AS average_amount,neo4jLabs_synthetic_gemini,instance_id_29080,neo4jlabs_demo_db_fincen
What are the top 5 filings by the shortest duration from begin to end date?,"MATCH (f:Filing) WITH f, duration.inSeconds(f.begin, f.end) AS duration ORDER BY duration ASC LIMIT 5 RETURN f.sar_id AS SAR_ID, f.begin AS BeginDate, f.end AS EndDate, duration",neo4jLabs_synthetic_gpt4o,instance_id_41365,neo4jlabs_demo_db_fincen
List the top 3 originator banks with the most filings involving transactions above $1 million.,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WHERE f.amount > 1000000 RETURN e.name AS originator_bank, COUNT(f) AS num_filings ORDER BY num_filings DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41464,neo4jlabs_demo_db_fincen
List the names of the teams that have streams with a creation date before 2015.,MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WHERE s.createdAt < datetime('2015-01-01T00:00:00.000000Z') RETURN DISTINCT t.name,neo4jLabs_synthetic_gemini,instance_id_34189,neo4jlabs_demo_db_twitch
Which officers have addresses registered in 'Bahamas'?,"MATCH (o:Officer)-[:registered_address]->(a:Address) WHERE a.countries = 'Bahamas' RETURN o.name AS officer_name, a.address AS registered_address",neo4jLabs_synthetic_gpt4o,instance_id_44916,neo4jlabs_demo_db_offshoreleaks
"How many Officers have the country_codes ""KOR""?",MATCH (o:Officer {country_codes: 'KOR'}) RETURN count(o),neo4jLabs_synthetic_gemini,instance_id_30739,neo4jlabs_demo_db_offshoreleaks
What are the top 3 previous versions of the version '7.1' in the schema?,MATCH path=(v:Version {name: '7.1'})-[:PREVIOUS*1..3]->(prev:Version) RETURN prev.name AS PreviousVersion ORDER BY length(path) ASC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20145,neo4jlabs_demo_db_network
Name the top 3 users who are moderators for more than one stream.,"MATCH (u:User)-[:MODERATOR]->(s:Stream) WITH u, count(s) AS streams_count WHERE streams_count > 1 RETURN u.name, streams_count ORDER BY streams_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25480,neo4jlabs_demo_db_twitch
What is the jurisdiction of the entity with ibcRUC '25249'?,MATCH (n:Entity) WHERE n.ibcRUC = '25249' RETURN n.jurisdiction,neo4jLabs_synthetic_gemini,instance_id_31005,neo4jlabs_demo_db_offshoreleaks
List the first 3 actors who have played roles in both comedy and action movies.,"MATCH (a:Actor)-[:ACTED_IN]->(m1:Movie)-[:IN_GENRE]->(g1:Genre {name: ""Comedy""}),       (a)-[:ACTED_IN]->(m2:Movie)-[:IN_GENRE]->(g2:Genre {name: ""Action""}) RETURN DISTINCT a.name LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42747,neo4jlabs_demo_db_recommendations
Find the products that have a quantity on order greater than the total quantity ordered for those products in the past.,"MATCH (o:Order)-[rel:ORDERS]->(p:Product) WITH p.productID AS productID, sum(rel.quantity) AS totalQuantityOrdered MATCH (p:Product) WHERE p.unitsOnOrder > totalQuantityOrdered RETURN p.productName",neo4jLabs_synthetic_gemini,instance_id_30983,neo4jlabs_demo_db_northwind
"Find the top 3 `beneficiary_bank` values with the lowest average filing `number` where the `originator_bank_country` is ""Germany"" and the `amount` is greater than 10000.","MATCH (f:Filing) WHERE f.originator_bank_country = ""Germany"" AND f.amount > 10000 WITH f.beneficiary_bank AS beneficiary_bank, avg(f.number) AS average_number ORDER BY average_number ASC LIMIT 3 RETURN beneficiary_bank, average_number",neo4jLabs_synthetic_gemini,instance_id_28307,neo4jlabs_demo_db_fincen
Find all games played by streams that have at least one VIP who is also a chatter in another stream.,MATCH (s:Stream)-[:PLAYS]->(g:Game) MATCH (s)-[:VIP]->(v:User)-[:CHATTER]->(other:Stream) WHERE s <> other RETURN DISTINCT g.name,neo4jLabs_synthetic_gemini,instance_id_33915,neo4jlabs_demo_db_twitch
Which Entities have filed more than 3 Filings?,"MATCH (e:Entity)-[:FILED]->(f:Filing) WITH e, COUNT(f) AS num_filings WHERE num_filings > 3 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_41177,neo4jlabs_demo_db_fincen
What are the countries associated with the top 5 entities with the earliest incorporation dates?,"MATCH (e:Entity) WHERE e.incorporation_date IS NOT NULL RETURN e.name, e.countries, e.incorporation_date ORDER BY e.incorporation_date ASC LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_30583,neo4jlabs_demo_db_offshoreleaks
Identify the applications running on machine named DC1-RCK-1-1-M-1.,MATCH (m:Machine {name: 'DC1-RCK-1-1-M-1'})-[:RUNS]->(a:Application) RETURN a.name,neo4jLabs_synthetic_gpt4o,instance_id_43874,neo4jlabs_demo_db_network
"What is the name of the entity with id ""barclays-bank-plc-london-england-gbr""?",MATCH (e:Entity {id: 'barclays-bank-plc-london-england-gbr'}) RETURN e.name,neo4jLabs_synthetic_gemini,instance_id_28142,neo4jlabs_demo_db_fincen
List the top 5 tweets that include a link and were posted by users following 'Neo4j'.,MATCH (u:User)-[:FOLLOWS]->(m:Me {name: 'Neo4j'})-[:POSTS]->(t:Tweet)-[:CONTAINS]->(l:Link) RETURN t ORDER BY t.created_at DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24830,neo4jlabs_demo_db_twitter
Which suppliers supply more than five different products?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WITH s, count(DISTINCT p) AS numProducts WHERE numProducts > 5 RETURN s",neo4jLabs_synthetic_gpt4turbo,instance_id_21668,neo4jlabs_demo_db_northwind
Find the streams that have moderators who are also chatters of the same stream.,MATCH (s:Stream)<-[:MODERATOR]-(m) WHERE EXISTS((s)<-[:CHATTER]-(m)) RETURN DISTINCT s.name AS stream_name,neo4jLabs_synthetic_gemini,instance_id_34014,neo4jlabs_demo_db_twitch
List the first 3 interfaces that connect to routers in zone 1.,MATCH (r:Router {zone: 1})-[:ROUTES]->(i:Interface) RETURN i LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20525,neo4jlabs_demo_db_network
List all officers named 'KIM SOO IN'.,MATCH (o:Officer {name: 'KIM SOO IN'}) RETURN o,neo4jLabs_synthetic_gpt4turbo,instance_id_21179,neo4jlabs_demo_db_offshoreleaks
List the first 3 tweets from 'neo4j' that contain links to external websites.,"MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet)-[:CONTAINS]->(l:Link) RETURN t, l.url LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24203,neo4jlabs_demo_db_twitter
List entities that have filed more than 30 filings.,"MATCH (e:Entity)-[:FILED]->(f:Filing) WITH e, COUNT(f) AS num_filings WHERE num_filings > 30 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_39121,neo4jlabs_demo_db_fincen
List the top 5 users that 'Neo4j' retweeted and who have a following of more than 10000.,MATCH (neo:User {screen_name: 'neo4j'})-[:POSTS]->(tweet:Tweet)-[:RETWEETS]->(retweet:Tweet)-[:POSTS]-(retweetedUser:User) WHERE retweetedUser.following > 10000 RETURN retweetedUser ORDER BY retweetedUser.following DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24835,neo4jlabs_demo_db_twitter
List all movies released after 2000 and their respective ratings.,"MATCH (m:Movie) WHERE m.released > 2000 WITH m OPTIONAL MATCH (p:Person)-[r:REVIEWED]->(m) RETURN m.title, r.rating",neo4jLabs_synthetic_gemini,instance_id_34362,neo4jlabs_demo_db_movies
Which 3 movies have the most expensive poster paths registered?,"MATCH (m:Movie) WHERE m.poster_path IS NOT NULL RETURN m.title, m.poster_path ORDER BY m.poster_path DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44394,neo4jlabs_demo_db_eoflix
What are the top 5 most ordered products in terms of quantity?,"MATCH (:Order)-[o:ORDERS]->(p:Product) RETURN p.productName AS productName, SUM(o.quantity) AS totalQuantity ORDER BY totalQuantity DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_45227,neo4jlabs_demo_db_northwind
What are the names of entities that have a note stating they were closed due to liquidation?,MATCH (e:Entity) WHERE e.note = 'Closed date stands for Liquidation date.' RETURN e.name,neo4jLabs_synthetic_gpt4turbo,instance_id_21118,neo4jlabs_demo_db_offshoreleaks
What are the Versions dependent on the Software 'RHEL'?,MATCH (s:Software {name: 'RHEL'})-[:DEPENDS_ON]->(v:Version) RETURN v.name AS VersionName,neo4jLabs_synthetic_gpt4turbo,instance_id_20202,neo4jlabs_demo_db_network
What are the top 3 countries with the highest number of filings where the beneficiary entity is located in 'GBR'?,"MATCH (f:Filing)-[:BENEFITS]->(be:Entity)-[:COUNTRY]->(c:Country {code: 'GBR'}) WITH f.originator_iso AS country_code, count(*) AS filing_count ORDER BY filing_count DESC LIMIT 3 RETURN country_code, filing_count",neo4jLabs_synthetic_gemini,instance_id_28138,neo4jlabs_demo_db_fincen
List the services running on machines in rack 'DC1-RCK-1-10'.,MATCH (rack:Rack {name: 'DC1-RCK-1-10'})-[:HOLDS]->(machine:Machine)-[:RUNS]->(service:Service) RETURN service.name,neo4jLabs_synthetic_gpt4o,instance_id_43904,neo4jlabs_demo_db_network
List the top 5 movies with the lowest votes.,MATCH (m:Movie) WHERE m.votes IS NOT NULL RETURN m ORDER BY m.votes ASC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23836,neo4jlabs_demo_db_movies
"""Which language has the most streams and users associated with it?""","MATCH (l:Language)<-[:HAS_LANGUAGE]-(entity) WITH l.name AS Language, COUNT(entity) AS Associations RETURN Language ORDER BY Associations DESC LIMIT 1",neo4j_crowdsourced,instance_id_27617,neo4jlabs_demo_db_twitch
"What is the total amount of filings where the originator bank name contains the word ""Bank"" and the beneficiary bank name contains the word ""Limited""?",MATCH (f:Filing) WHERE f.originator_bank CONTAINS 'Bank' AND f.beneficiary_bank CONTAINS 'Limited' WITH sum(f.amount) AS totalAmount RETURN totalAmount,neo4jLabs_synthetic_gemini,instance_id_28230,neo4jlabs_demo_db_fincen
List all types of machines in rack 'DC1-RCK-1-1' and their disk sizes.,"MATCH (rack:Rack {name: 'DC1-RCK-1-1'})-[:HOLDS]->(machine:Machine)-[:TYPE]->(type:Type) RETURN machine.name AS machine_name, type.disk AS disk_size",neo4jLabs_synthetic_gpt4o,instance_id_43950,neo4jlabs_demo_db_network
Retrieve the first 3 countries connected to entities that are beneficiaries in filings with amounts over 1000000.,MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE f.amount > 1000000 RETURN DISTINCT c.name LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_41127,neo4jlabs_demo_db_fincen
Which products have a reorderLevel of 25 or higher?,"MATCH (p:Product) WHERE p.reorderLevel >= 25 RETURN p.productName, p.productID, p.reorderLevel",neo4jLabs_synthetic_gpt4turbo,instance_id_21835,neo4jlabs_demo_db_northwind
List the top 5 entities that benefited from the highest number of filings.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WITH e, count(f) AS numberOfFilings ORDER BY numberOfFilings DESC RETURN e.name, numberOfFilings LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_28086,neo4jlabs_demo_db_fincen
Which 5 customers have orders with the required date in the year 1997?,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE o.requiredDate STARTS WITH '1997' RETURN c.companyName AS customerName, COUNT(o) AS orderCount ORDER BY orderCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44561,neo4jlabs_demo_db_northwind
What are the country_codes of the address with node_id 14048584?,MATCH (a:Address {node_id: 14048584}) RETURN a.country_codes,neo4jLabs_synthetic_gemini,instance_id_31008,neo4jlabs_demo_db_offshoreleaks
What is the average budget of movies that feature both Tom Hanks and Tim Allen in the cast?,MATCH (tom:Person {name: 'Tom Hanks'}) MATCH (tim:Person {name: 'Tim Allen'}) MATCH (tom)-[:CAST_FOR]->(movie:Movie)<-[:CAST_FOR]-(tim) WITH avg(movie.budget) AS average_budget RETURN average_budget,neo4jLabs_synthetic_gemini,instance_id_31910,neo4jlabs_demo_db_eoflix
List the first 3 movies that were part of more than one collection.,"MATCH (m:Movie)-[:IN_COLLECTION]->(c:Collection) WITH m, count(c) AS num_collections WHERE num_collections > 1 RETURN m LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21001,neo4jlabs_demo_db_eoflix
List the first 5 suppliers that have provided products to more than three different customers.,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product)<-[:ORDERS]-(o:Order)<-[:PURCHASED]-(c:Customer) WITH s, count(DISTINCT c) AS distinctCustomers WHERE distinctCustomers > 3 RETURN s LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_22004,neo4jlabs_demo_db_northwind
Find the first 3 users who have retweeted tweets posted by 'neo4j'.,MATCH (u:User {screen_name: 'neo4j'})-[:POSTS]->(t:Tweet)<-[:RETWEETS]-(rt:Tweet)<-[:POSTS]-(ru:User) RETURN ru LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24238,neo4jlabs_demo_db_twitter
"Find the filings where the 'originator_bank' starts with the letter ""D"" and the 'beneficiary_bank' starts with the letter ""B"".","MATCH (f:Filing) WHERE f.originator_bank STARTS WITH ""D"" AND f.beneficiary_bank STARTS WITH ""B"" RETURN f",neo4jLabs_synthetic_gemini,instance_id_29235,neo4jlabs_demo_db_fincen
List the top 3 movies where the homepage URL includes 'disney'.,"MATCH (m:Movie) WHERE m.homepage CONTAINS 'disney' RETURN m.title, m.homepage, m.popularity ORDER BY m.popularity DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44391,neo4jlabs_demo_db_eoflix
"How many streams are moderated by users who have ""Chase"" in their name?",MATCH (u:User)-[:MODERATOR]->(s:Stream) WHERE u.name CONTAINS 'Chase' RETURN count(DISTINCT s),neo4jLabs_synthetic_gemini,instance_id_33706,neo4jlabs_demo_db_twitch
Name the top 5 directors who also reviewed the movies they directed.,"MATCH (d:Person)-[:DIRECTED]->(m:Movie)<-[:REVIEWED]-(d) RETURN d.name AS Director, count(m) AS MoviesReviewedAndDirected ORDER BY MoviesReviewedAndDirected DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23744,neo4jlabs_demo_db_movies
