question,cypher,data_source,instance_id,database_reference_alias
Name the first 3 movies with a tagline that includes the word 'real' and were released before 2000.,MATCH (m:Movie) WHERE m.tagline CONTAINS 'real' AND m.released < 2000 RETURN m.title ORDER BY m.released ASC LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_40036,neo4jlabs_demo_db_movies
Give me the 3 movies with the lowest ratings.,"MATCH (m:Movie)<-[r:REVIEWED]-(p:Person) WITH m.title AS movieTitle, collect(r.rating) AS ratings UNWIND ratings AS rating WITH movieTitle, avg(rating) AS averageRating ORDER BY averageRating ASC RETURN movieTitle, averageRating LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_32915,neo4jlabs_demo_db_movies
Find all customers who have ordered products from more than one category.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product)-[:PART_OF]->(cat:Category) WITH c, collect(DISTINCT cat.categoryName) AS categories WHERE size(categories) > 1 RETURN c.companyName",neo4jLabs_synthetic_gemini,instance_id_32534,neo4jlabs_demo_db_northwind
List the top 3 genres most frequently associated with videos.,"MATCH (v:Video)-[:IN_GENRE]->(g:Genre) RETURN g.name AS Genre, count(v) AS VideoCount ORDER BY VideoCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23498,neo4jlabs_demo_db_eoflix
What is the average age of directors at the time of their death?,MATCH (director:Director) WHERE director.died IS NOT NULL WITH avg(director.died.year - director.born.year) AS averageAge RETURN averageAge,neo4jLabs_synthetic_gemini,instance_id_29625,neo4jlabs_demo_db_recommendations
What are the top 3 filings in terms of amount that occurred in 2016?,MATCH (f:Filing) WHERE f.begin >= datetime('2016-01-01T00:00:00Z') AND f.end <= datetime('2016-12-31T23:59:59Z') RETURN f ORDER BY f.amount DESC LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_41237,neo4jlabs_demo_db_fincen
What is the average budget of movies directed by Steven Spielberg?,"MATCH (d:Person {name: ""Steven Spielberg""})-[:CREW_FOR {job: ""Director""}]->(m:Movie) WITH avg(m.budget) AS average_budget RETURN average_budget",neo4jLabs_synthetic_gemini,instance_id_31890,neo4jlabs_demo_db_eoflix
What are the most common country codes associated with the entities?,"MATCH (e:Entity) RETURN e.country_codes AS country_code, COUNT(*) AS count ORDER BY count DESC LIMIT 10",neo4jLabs_synthetic_gpt4o,instance_id_44581,neo4jlabs_demo_db_offshoreleaks
Show the names of Entities that have originator banks in 'Singapore'.,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WHERE f.originator_bank_country = 'Singapore' RETURN e.name,neo4jLabs_synthetic_gpt4turbo,instance_id_21395,neo4jlabs_demo_db_fincen
"Find the movie with the highest rating that has the word ""football"" in its review summary.","MATCH (m:Movie)<-[r:REVIEWED]-(p:Person) WHERE r.summary CONTAINS 'football' WITH m, r ORDER BY r.rating DESC LIMIT 1 RETURN m AS movie, r.rating AS rating",neo4jLabs_synthetic_gemini,instance_id_32656,neo4jlabs_demo_db_movies
What is the `valid_until` date for the entity with `ibcRUC` '25249'?,MATCH (e:Entity {ibcRUC: '25249'}) RETURN e.valid_until,neo4jLabs_synthetic_gemini,instance_id_30593,neo4jlabs_demo_db_offshoreleaks
Find the top 3 languages used by streams with more than 1000000 followers.,"MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE s.followers > 1000000 RETURN l.name, count(s) AS stream_count ORDER BY stream_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24413,neo4jlabs_demo_db_twitch
Find the movies that have been directed by directors who have also acted in them.,"MATCH (d:Director)-[:DIRECTED]->(m:Movie), (d)-[:ACTED_IN]->(m) RETURN DISTINCT m.title AS movieTitle",neo4jLabs_synthetic_gemini,instance_id_29533,neo4jlabs_demo_db_recommendations
List the top 5 movies with the smallest budgets.,MATCH (m:Movie) WHERE m.budget IS NOT NULL RETURN m ORDER BY m.budget ASC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_26153,neo4jlabs_demo_db_recommendations
List the top 5 movies that have been directed by someone born in 1967.,"MATCH (director:Person)-[:DIRECTED]->(movie:Movie) WHERE director.born = 1967 RETURN movie.title AS title, movie.released AS released ORDER BY movie.votes DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39778,neo4jlabs_demo_db_movies
"What is the average rating for the movie ""Toy Story""?",MATCH (m:Movie {title: 'Toy Story'})<-[r:RATED]-(u:User) WITH avg(r.rating) AS average_rating RETURN average_rating,neo4jLabs_synthetic_gemini,instance_id_29620,neo4jlabs_demo_db_recommendations
List the intermediaries that are connected to entities with a status of 'Defaulted'.,MATCH (e:Entity)-[:intermediary_of]-(i:Intermediary) WHERE e.status = 'Defaulted' RETURN DISTINCT i.name AS IntermediaryName,neo4jLabs_synthetic_gpt4o,instance_id_44750,neo4jlabs_demo_db_offshoreleaks
What is the total number of streams that have at least one moderator and one VIP who are different users?,"MATCH (s:Stream)-[:MODERATOR]->(moderator:User),       (s)-[:VIP]->(vip:User) WHERE moderator <> vip RETURN count(DISTINCT s) AS streamCount",neo4jLabs_synthetic_gemini,instance_id_33908,neo4jlabs_demo_db_twitch
What are the top 5 most ordered products by customers from 'Berlin'?,"MATCH (c:Customer {city: 'Berlin'})-[:PURCHASED]->(o:Order)-[r:ORDERS]->(p:Product) RETURN p.productName, SUM(r.quantity) AS TotalQuantityOrdered ORDER BY TotalQuantityOrdered DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_20552,neo4jlabs_demo_db_northwind
What is the average number of followers for streams that belong to a team?,MATCH (s:Stream)-[:HAS_TEAM]->(:Team) RETURN avg(s.followers) AS averageFollowers,neo4jLabs_synthetic_gemini,instance_id_33693,neo4jlabs_demo_db_twitch
List officers with the same ID based on 'Paradise Papers - Malta corporate registry'.,"MATCH (o1:Officer)-[:same_id_as {sourceID: 'Paradise Papers - Malta corporate registry'}]->(o2:Officer) RETURN o1.name AS Officer1, o2.name AS Officer2",neo4jLabs_synthetic_gpt4o,instance_id_44801,neo4jlabs_demo_db_offshoreleaks
How many entities were inactivated in February 2013?,MATCH (e:Entity) WHERE e.inactivation_date STARTS WITH '18-FEB-2013' RETURN count(e) AS InactivatedEntitiesCount,neo4jLabs_synthetic_gpt4turbo,instance_id_21208,neo4jlabs_demo_db_offshoreleaks
What are the top 3 filings with the highest number of entities involved as originators from the same sector?,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WITH f, COUNT(e) AS originator_count ORDER BY originator_count DESC LIMIT 3 RETURN f.sar_id AS filing_id, originator_count",neo4jLabs_synthetic_gpt4o,instance_id_41121,neo4jlabs_demo_db_fincen
"Which officers have been linked to the entity 'NINGBO SUNRISE ENTERPRISES UNITED CO., LTD.'?","MATCH (o:Officer)-[:officer_of]->(e:Entity {name: 'NINGBO SUNRISE ENTERPRISES UNITED CO., LTD.'}) RETURN o.name AS OfficerName",neo4jLabs_synthetic_gpt4turbo,instance_id_21964,neo4jlabs_demo_db_offshoreleaks
What is the total revenue generated by orders placed in the first quarter of 1997?,"MATCH (o:Order)-[rel:ORDERS]->(p:Product) WHERE o.orderDate >= '1997-01-01' AND o.orderDate <= '1997-03-31' WITH o, toFloat(rel.unitPrice) * toInteger(rel.quantity) * (1 - toFloat(rel.discount)) AS revenuePerProduct WITH o, sum(revenuePerProduct) AS orderRevenue RETURN sum(orderRevenue) AS totalRevenue",neo4jLabs_synthetic_gemini,instance_id_30968,neo4jlabs_demo_db_northwind
Identify the top 3 entities based on the total amount of filings where the beneficiary bank's country is 'United Kingdom'.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WHERE f.beneficiary_bank_country = 'United Kingdom' WITH e, SUM(f.amount) AS totalAmount RETURN e.name AS entityName, totalAmount ORDER BY totalAmount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41444,neo4jlabs_demo_db_fincen
What is the most common genre among the top 10 highest-grossing movies?,"MATCH (m:Movie) WITH m ORDER BY m.revenue DESC LIMIT 10 WITH m MATCH (m)-[:IN_GENRE]->(g:Genre) WITH g, count(m) AS movieCount ORDER BY movieCount DESC LIMIT 1 RETURN g.name AS mostCommonGenre",neo4jLabs_synthetic_gemini,instance_id_34207,neo4jlabs_demo_db_eoflix
What is the name of the movie with the highest vote count that was released after 2010?,"MATCH (m:Movie) WHERE m.release_date > date('2010-01-01') RETURN m.title AS movie_title, m.vote_count AS vote_count ORDER BY vote_count DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_34628,neo4jlabs_demo_db_eoflix
Give me the top 10 movies with the most votes and a rating higher than 85.,"MATCH (m:Movie)<-[r:REVIEWED]-() WHERE r.rating > 85 WITH m, count(m) AS numVotes ORDER BY numVotes DESC LIMIT 10 RETURN m.title, numVotes",neo4jLabs_synthetic_gemini,instance_id_32920,neo4jlabs_demo_db_movies
Find all machines running an OS that started after timestamp 1606000000000.,MATCH (m:Machine)-[:RUNS]->(os:OS) WHERE os.startTime > 1606000000000 RETURN m.name,neo4jLabs_synthetic_gpt4o,instance_id_44061,neo4jlabs_demo_db_network
Display the first 3 users with the highest following who follow 'Neo4j'.,MATCH (u:User)-[:FOLLOWS]->(me:Me {name: 'Neo4j'}) RETURN u ORDER BY u.following DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24354,neo4jlabs_demo_db_twitter
Which actors have acted in movies directed by the person who directed the movie with the lowest number of votes?,MATCH (m:Movie) WITH m ORDER BY m.votes ASC LIMIT 1 MATCH (m)<-[:DIRECTED]-(d:Person) MATCH (d)-[:DIRECTED]->(movie:Movie) MATCH (movie)<-[:ACTED_IN]-(a:Person) RETURN DISTINCT a.name AS actorName,neo4jLabs_synthetic_gemini,instance_id_32881,neo4jlabs_demo_db_movies
List the first 3 movies that have been produced by 'Pixar Animation Studios' and have a budget over 50 million USD.,MATCH (m:Movie)-[:PRODUCED_BY]->(pc:ProductionCompany {name: 'Pixar Animation Studios'}) WHERE m.budget > 50000000 RETURN m LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23616,neo4jlabs_demo_db_eoflix
"What is the average budget of movies in the ""Comedy"" genre?",MATCH (g:Genre {name: 'Comedy'})<-[:IN_GENRE]-(m:Movie) WITH avg(m.budget) AS averageBudget RETURN averageBudget,neo4jLabs_synthetic_gemini,instance_id_29868,neo4jlabs_demo_db_recommendations
List the top 5 tweets by 'Neo4j' based on favorites.,MATCH (u:User {name: 'Neo4j'})-[:POSTS]->(t:Tweet) RETURN t ORDER BY t.favorites DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24955,neo4jlabs_demo_db_twitter
"""영화 매트릭스에 출연한 배우는 누구야?""","MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.title = ""매트릭스"" RETURN p.name",neo4j_crowdsourced,instance_id_27594,neo4jlabs_demo_db_movies
List all types of machines that have a CPU count of at least 8.,"MATCH (t:Type) WHERE t.cpu >= 8 RETURN t.name AS machineType, t.cpu AS cpuCount",neo4jLabs_synthetic_gpt4o,instance_id_43836,neo4jlabs_demo_db_network
Show the 3 streams with the most users as chatters.,"MATCH (s:Stream)<-[:CHATTER]-(u:User) WITH s, COUNT(u) AS chatterCount ORDER BY chatterCount DESC LIMIT 3 RETURN s.name AS streamName, chatterCount",neo4jLabs_synthetic_gpt4o,instance_id_43339,neo4jlabs_demo_db_twitch
List the first 3 movies that have a homepage and were released after 2010.,MATCH (m:Movie) WHERE m.homepage IS NOT NULL AND m.release_date > date('2010-01-01') RETURN m ORDER BY m.release_date LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23548,neo4jlabs_demo_db_eoflix
List the top 5 movies with the most imdbVotes.,MATCH (m:Movie) WHERE m.imdbVotes IS NOT NULL RETURN m ORDER BY m.imdbVotes DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_26166,neo4jlabs_demo_db_recommendations
What are the top 5 filings by amount in 2015?,MATCH (f:Filing) WHERE f.begin >= datetime('2015-01-01T00:00:00Z') AND f.end <= datetime('2015-12-31T23:59:59Z') RETURN f ORDER BY f.amount DESC LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_41180,neo4jlabs_demo_db_fincen
Name 3 people who were born after 1980 and have directed a movie.,MATCH (p:Person)-[:DIRECTED]->(:Movie) WHERE p.born > 1980 RETURN p.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24118,neo4jlabs_demo_db_movies
How many different versions of the software 'RHEL' are used by processes running in the data center?,"MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(:Rack)-[:HOLDS]->(m:Machine)-[:RUNS]->(p:Process) MATCH (p)-[:INSTANCE]->(:Software {name: 'RHEL'}) WITH DISTINCT p, p.name AS version RETURN count(version)",neo4jLabs_synthetic_gemini,instance_id_31733,neo4jlabs_demo_db_network
Which director has the highest average movie IMDB votes?,"MATCH (d:Director)-[:DIRECTED]->(m:Movie) WITH d, avg(m.imdbVotes) AS averageVotes RETURN d.name AS directorName, averageVotes ORDER BY averageVotes DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29609,neo4jlabs_demo_db_recommendations
"List the names of all machines that are holding a switch with an IP address starting with ""10.2"".","MATCH (s:Switch) WHERE s.ip STARTS WITH ""10.2"" MATCH (s)<-[:HOLDS]-(r:Rack)-[:HOLDS]->(m:Machine) RETURN m.name",neo4jLabs_synthetic_gemini,instance_id_32351,neo4jlabs_demo_db_network
List the products with a unitsInStock less than 15.,"MATCH (p:Product) WHERE p.unitsInStock < 15 RETURN p.productName, p.unitsInStock",neo4jLabs_synthetic_gpt4o,instance_id_45361,neo4jlabs_demo_db_northwind
Which service provider has the most entities with a 'Defaulted' status?,"MATCH (e:Entity {status: 'Defaulted'}) WITH e.service_provider AS service_provider, count(e) AS entity_count ORDER BY entity_count DESC RETURN service_provider, entity_count LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_30944,neo4jlabs_demo_db_offshoreleaks
What is the average number of entities per address?,"MATCH ()-[r:registered_address]->(a:Address) WITH count(*) AS num_addresses, count(DISTINCT startNode(r).node_id) AS num_entities RETURN round(toFloat(num_entities) / num_addresses, 2) AS avg_entities_per_address",neo4jLabs_synthetic_gemini,instance_id_30616,neo4jlabs_demo_db_offshoreleaks
Which 3 products have never been ordered?,MATCH (p:Product) WHERE NOT exists{ (p)<-[:ORDERS]-(:Order) } RETURN p.productName LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21713,neo4jlabs_demo_db_northwind
List the 3 oldest directors based on their birth date.,"MATCH (d:Director) RETURN d.name, d.born ORDER BY d.born ASC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42770,neo4jlabs_demo_db_recommendations
Find the first 3 orders that required shipping after '1997-01-01'.,MATCH (o:Order) WHERE o.requiredDate > '1997-01-01' RETURN o ORDER BY o.requiredDate LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_22114,neo4jlabs_demo_db_northwind
What are the names of all genres represented in the 'Toy Story Collection'?,MATCH (c:Collection {name: 'Toy Story Collection'})<-[:IN_COLLECTION]-(m:Movie)-[:IN_GENRE]->(g:Genre) RETURN DISTINCT g.name AS genre_name,neo4jLabs_synthetic_gpt4o,instance_id_44454,neo4jlabs_demo_db_eoflix
Find the top 5 streams with the highest total view count.,MATCH (s:Stream) RETURN s ORDER BY s.total_view_count DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24429,neo4jlabs_demo_db_twitch
List the first 3 entities that have filed the most number of filings with a beneficiary bank in 'Barclays Bank Plc'.,"MATCH (e:Entity)-[:FILED]->(f:Filing {beneficiary_bank: 'Barclays Bank Plc'}) WITH e, count(f) AS filingsCount ORDER BY filingsCount DESC LIMIT 3 RETURN e",neo4jLabs_synthetic_gpt4turbo,instance_id_21568,neo4jlabs_demo_db_fincen
What is the incorporation_date of the entity with the internal_id '1000022'?,MATCH (e:Entity {internal_id: '1000022'}) RETURN e.incorporation_date,neo4jLabs_synthetic_gemini,instance_id_30900,neo4jlabs_demo_db_offshoreleaks
"""Which actors played in the most movies?""","MATCH (p:Person)-[:ACTED_IN]->(m:Movie) RETURN p.name, COUNT(m) AS movies_count ORDER BY movies_count DESC LIMIT 1",neo4j_crowdsourced,instance_id_27357,neo4jlabs_demo_db_movies
List the 3 filings with the shortest duration from beginning to end.,"MATCH (f:Filing) WITH f, duration.between(f.begin, f.end) AS duration ORDER BY duration ASC LIMIT 3 RETURN f.sar_id AS SAR_ID, f.begin AS Begin_Date, f.end AS End_Date, duration",neo4jLabs_synthetic_gpt4o,instance_id_41476,neo4jlabs_demo_db_fincen
Show the streams with the most languages.,"MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WITH s, COUNT(l) AS languageCount ORDER BY languageCount DESC RETURN s.name AS streamName, languageCount LIMIT 10",neo4jLabs_synthetic_gpt4o,instance_id_43593,neo4jlabs_demo_db_twitch
Identify the top 3 processes by PID that depend on the 'java' service.,"MATCH (p:Process)-[:DEPENDS_ON]->(s:Service {name: 'java'}) RETURN p.name AS processName, p.pid AS processPID ORDER BY p.pid DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44131,neo4jlabs_demo_db_network
Find the actors who have worked on movies with more than 4 actors.,"MATCH (m:Movie)<-[:ACTED_IN]-(a:Person) WITH m, count(a) AS actorCount WHERE actorCount > 4 WITH m MATCH (m)<-[:ACTED_IN]-(a:Person) RETURN DISTINCT a.name",neo4jLabs_synthetic_gemini,instance_id_32983,neo4jlabs_demo_db_movies
Which machine type has the highest RAM capacity?,MATCH (t:Type) RETURN t.type ORDER BY t.ram DESC LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_31695,neo4jlabs_demo_db_network
List all movies directed by a person born in France.,"MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE p.bornIn = ""France"" RETURN m.title AS MovieTitle, m.year AS ReleaseYear, p.name AS DirectorName",neo4jLabs_synthetic_gpt4o,instance_id_42126,neo4jlabs_demo_db_recommendations
"What is the average number of followers for streams that play ""Just Chatting""?","MATCH (s:Stream)-[:PLAYS]->(g:Game {name: ""Just Chatting""}) RETURN avg(s.followers)",neo4jLabs_synthetic_gemini,instance_id_34088,neo4jlabs_demo_db_twitch
Name the first 3 Machines held in Rack 'DC1-RCK-1-1'.,MATCH (rack:Rack {name: 'DC1-RCK-1-1'})-[:HOLDS]->(machine:Machine) RETURN machine.name LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43848,neo4jlabs_demo_db_network
List the first 3 filings where the beneficiary bank country is 'Spain' and the amount is over 5 million USD.,MATCH (f:Filing) WHERE f.beneficiary_bank_country = 'Spain' AND f.amount > 5000000 RETURN f ORDER BY f.begin LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_41794,neo4jlabs_demo_db_fincen
List the movies released before 1985.,MATCH (m:Movie) WHERE m.released < 1985 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32912,neo4jlabs_demo_db_movies
Find the tweets that are replies to tweets that mention users followed by Neo4j.,MATCH (neo4j:User {screen_name: 'neo4j'})-[:FOLLOWS]->(followedUser:User) WITH followedUser MATCH (followedUser)<-[:MENTIONS]-(mentionedTweet:Tweet) WITH mentionedTweet MATCH (replyTweet:Tweet)-[:REPLY_TO]->(mentionedTweet) RETURN DISTINCT replyTweet,neo4jLabs_synthetic_gemini,instance_id_34510,neo4jlabs_demo_db_twitter
What are the details of entities that have an incorporation date in 2006?,"MATCH (e:Entity) WHERE e.incorporation_date CONTAINS '2006' RETURN e.name AS entity_name, e.countries AS countries, e.ibcRUC AS ibcRUC, e.valid_until AS valid_until,         e.country_codes AS country_codes, e.service_provider AS service_provider, e.address AS address,         e.inactivation_date AS inactivation_date, e.struck_off_date AS struck_off_date, e.status AS status,         e.jurisdiction_description AS jurisdiction_description, e.incorporation_date AS incorporation_date,         e.original_name AS original_name, e.jurisdiction AS jurisdiction, e.internal_id AS internal_id,         e.lastEditTimestamp AS lastEditTimestamp, e.node_id AS node_id, e.sourceID AS sourceID,         e.former_name AS former_name, e.company_type AS company_type, e.tax_stat_description AS tax_stat_description,         e.note AS note, e.dorm_date AS dorm_date, e.type AS type, e.closed_date AS closed_date,         e.company_number AS company_number, e.comments AS comments, e.entity_number AS entity_number",neo4jLabs_synthetic_gpt4o,instance_id_44953,neo4jlabs_demo_db_offshoreleaks
"""What keywords are most often associated with comedies?""","MATCH (:Genre {name: ""Comedy""})<-[:IN_GENRE]-(m)-[:HAS_KEYWORD]->(k:Keyword) RETURN k.name AS Keyword, COUNT(*) AS Frequency ORDER BY Frequency DESC",neo4j_crowdsourced,instance_id_27391,neo4jlabs_demo_db_eoflix
What is the total RAM available on all machines that are running the 'logstash' application?,MATCH (app:Application {name: 'logstash'})-[:RUNS]->(machine:Machine)-[:TYPE]->(type:Type) RETURN sum(type.ram) AS total_ram,neo4jLabs_synthetic_gemini,instance_id_32383,neo4jlabs_demo_db_network
List the top 5 streams with the highest number of followers.,"MATCH (s:Stream) RETURN s.name, s.followers ORDER BY s.followers DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43570,neo4jlabs_demo_db_twitch
What is the minimum total view count among streams that have at least one 'CHATTER'?,MATCH (s:Stream)-[:CHATTER]->() WITH min(s.total_view_count) AS min_view_count RETURN min_view_count,neo4jLabs_synthetic_gemini,instance_id_33673,neo4jlabs_demo_db_twitch
Show entities that are connected to 'ANTAM ENTERPRISES N.V.'.,MATCH (e:Entity {name: 'ANTAM ENTERPRISES N.V.'})-[:connected_to]->(connectedEntities:Entity) RETURN connectedEntities,neo4jLabs_synthetic_gpt4turbo,instance_id_21350,neo4jlabs_demo_db_offshoreleaks
List all movies with a revenue greater than their budget.,MATCH (m:Movie) WHERE m.revenue > m.budget RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_31993,neo4jlabs_demo_db_eoflix
Find the first 3 orders that were shipped within Germany.,"MATCH (o:Order)-[:ORDERS]->(p:Product) WHERE o.shipCountry = 'Germany' RETURN o.orderID, o.shipName, o.shipCity, o.shipPostalCode, o.shipAddress, o.shipCountry, o.shipRegion, o.shippedDate ORDER BY o.shippedDate LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44715,neo4jlabs_demo_db_northwind
"What is the average amount of filings where the originator entity's name contains ""Corp.""?",MATCH (e:Entity)-[:ORIGINATOR]->(f:Filing) WHERE e.name CONTAINS 'Corp.' WITH avg(f.amount) AS averageAmount RETURN averageAmount,neo4jLabs_synthetic_gemini,instance_id_28079,neo4jlabs_demo_db_fincen
What is the average number of years between an actor's birth and their first movie role?,"MATCH (p:Person)-[r:ACTED_IN]->(m:Movie) WITH p, m.released - p.born AS years_since_birth WITH p, min(years_since_birth) AS years_to_first_role RETURN avg(years_to_first_role) AS average_years_to_first_role",neo4jLabs_synthetic_gemini,instance_id_32992,neo4jlabs_demo_db_movies
What is the total number of entities in the dataset?,MATCH (n:Entity) RETURN count(*) AS totalEntities,neo4jLabs_synthetic_gemini,instance_id_30621,neo4jlabs_demo_db_offshoreleaks
Which machines are running the version '7.1' of any software?,MATCH (m:Machine)-[:RUNS]->(:Software)-[:VERSION]->(v:Version {name: '7.1'}) RETURN m.name AS MachineName,neo4jLabs_synthetic_gpt4turbo,instance_id_20237,neo4jlabs_demo_db_network
What Ports are listened to by the 'crm' application?,MATCH (app:Application {name: 'crm'})-[:LISTENS]->(port:Port) RETURN port,neo4jLabs_synthetic_gpt4turbo,instance_id_20116,neo4jlabs_demo_db_network
Which 3 users have the highest number of chatter relationships?,"MATCH (u:User) WITH u, count{(u)-[:CHATTER]->()} AS chatterCount ORDER BY chatterCount DESC LIMIT 3 RETURN u.name, chatterCount",neo4jLabs_synthetic_gpt4turbo,instance_id_25534,neo4jlabs_demo_db_twitch
Show the first 5 movies that were originally titled differently from their English title.,MATCH (m:Movie) WHERE m.title <> m.original_title AND m.original_language = 'en' RETURN m LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23508,neo4jlabs_demo_db_eoflix
List the movies with more than 1000 votes.,MATCH (m:Movie) WHERE m.votes > 1000 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_33096,neo4jlabs_demo_db_movies
Who are the top 5 users with similar screen names to 'Neo4j'?,MATCH (u:User) WHERE u.screen_name CONTAINS 'Neo4j' RETURN u ORDER BY u.screen_name LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24504,neo4jlabs_demo_db_twitter
"What is the average budget of movies directed by ""Graham Annable""?","MATCH (d:Director {name: ""Graham Annable""})-[:DIRECTED]->(m:Movie) WITH avg(m.budget) AS averageBudget RETURN averageBudget",neo4jLabs_synthetic_gemini,instance_id_29314,neo4jlabs_demo_db_recommendations
What are the names of the entities that have a 'same_company_as' relationship with entities that have a 'service_provider' of 'Portcullis Trustnet'?,MATCH (e1:Entity)-[:same_company_as]->(e2:Entity) WHERE e2.service_provider = 'Portcullis Trustnet' RETURN e1.name,neo4jLabs_synthetic_gemini,instance_id_30705,neo4jlabs_demo_db_offshoreleaks
List the first 5 Switches in Rack 1.,MATCH (r:Rack {name: 'DC1-RCK-1-1'})-[:HOLDS]->(s:Switch) RETURN s LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_20125,neo4jlabs_demo_db_network
"Which entities have filed filings where the originator bank is ""Banca Privada Dandorra S.A."" and the beneficiary bank is located in the Cayman Islands?","MATCH (f:Filing)-[:FILED]-(e:Entity) WHERE f.originator_bank = ""Banca Privada Dandorra S.A."" AND f.beneficiary_bank_country = ""Cayman Islands"" RETURN e.name",neo4jLabs_synthetic_gemini,instance_id_28338,neo4jlabs_demo_db_fincen
"""Youngest actors""","MATCH (p:Person)-[:ACTED_IN]->(m:Movie) RETURN p.name AS ActorName, p.born AS BirthYear ORDER BY p.born DESC LIMIT 1",neo4j_crowdsourced,instance_id_27409,neo4jlabs_demo_db_movies
List the first 3 people born in 1964.,"MATCH (p:Person) WHERE p.born = 1964 RETURN p.name, p.born ORDER BY p.name LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_39834,neo4jlabs_demo_db_movies
What is the name of the movie with the highest box office gross that was not nominated for an Academy Award?,MATCH (m:Movie) WITH max(m.revenue) AS maxRevenue MATCH (m:Movie) WHERE m.revenue = maxRevenue RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32044,neo4jlabs_demo_db_eoflix
"""directors Tom Hanks work with""","MATCH (p:Person {name: ""Tom Hanks""})-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(coActors:Person) RETURN coActors.name AS CoActorName, m.title AS MovieTitle",neo4j_crowdsourced,instance_id_27607,neo4jlabs_demo_db_movies
Find the top 5 customers from the 'USA'.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE c.country = 'USA' WITH c, COUNT(o) AS orderCount ORDER BY orderCount DESC LIMIT 5 RETURN c.companyName AS customerName, orderCount",neo4jLabs_synthetic_gpt4o,instance_id_44625,neo4jlabs_demo_db_northwind
"What is the average amount of filings originating from the country with code ""SGP""?","MATCH (c:Country {code: ""SGP""}) MATCH (c)-[:COUNTRY]->(e:Entity)-[:ORIGINATOR]->(f:Filing) WITH avg(f.amount) AS averageAmount RETURN averageAmount",neo4jLabs_synthetic_gemini,instance_id_28361,neo4jlabs_demo_db_fincen
Which orders contain the product 'Chai'?,"MATCH (p:Product {productName: 'Chai'})<-[:ORDERS]-(o:Order) RETURN o.orderID AS orderID, o.orderDate AS orderDate, o.shipName AS shipName, o.shipCity AS shipCity, o.shipCountry AS shipCountry",neo4jLabs_synthetic_gpt4o,instance_id_44685,neo4jlabs_demo_db_northwind
What are the names of officers who have 'E72326DEA50F1A9C2876E112AAEB42BC' as their icij_id?,MATCH (o:Officer {icij_id: 'E72326DEA50F1A9C2876E112AAEB42BC'}) RETURN o.name,neo4jLabs_synthetic_gpt4turbo,instance_id_21142,neo4jlabs_demo_db_offshoreleaks
List the first 3 movies with the most unique spoken languages.,"MATCH (m:Movie)-[:SPOKEN_IN_LANGUAGE]->(l:Language) WITH m, count(DISTINCT l) AS uniqueLanguages ORDER BY uniqueLanguages DESC LIMIT 3 RETURN m.title AS MovieTitle, uniqueLanguages",neo4jLabs_synthetic_gpt4o,instance_id_39725,neo4jlabs_demo_db_eoflix
List the first 5 movies produced by a person born in 1967.,MATCH (p:Person)-[:PRODUCED]->(m:Movie) WHERE p.born = 1967 RETURN m.title AS MovieTitle ORDER BY m.released LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_39846,neo4jlabs_demo_db_movies
Which 3 movies have changed their status from 'In Production' to 'Released'?,MATCH (m:Movie) WHERE m.status = 'Released' AND exists {     MATCH (m2:Movie {id: m.id})     WHERE m2.status = 'In Production' } RETURN m LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23261,neo4jlabs_demo_db_eoflix
Who are the originators in filings where the beneficiary bank country is 'United Kingdom' and the amount is over 1000000?,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WHERE f.beneficiary_bank_country = 'United Kingdom' AND f.amount > 1000000 RETURN e.name AS originator_name,neo4jLabs_synthetic_gpt4o,instance_id_41329,neo4jlabs_demo_db_fincen
Find all movies that were released after the year 2000 and have an average vote greater than 8.0. (first 3),MATCH (m:Movie) WHERE date(m.release_date) > date('2000-01-01') AND m.average_vote > 8.0 RETURN m.title ORDER BY m.average_vote DESC LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_31878,neo4jlabs_demo_db_eoflix
Find all movies where a person named 'Nancy Meyers' acted.,MATCH (p:Person {name: 'Nancy Meyers'})-[:ACTED_IN]->(m:Movie) RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_23683,neo4jlabs_demo_db_movies
"Find the streams that have ""rajjix"" as a chatter and have ""en"" as their language.",MATCH (s:Stream) MATCH (s)-[:HAS_LANGUAGE]->(l:Language {name: 'en'}) MATCH (u:User {name: 'rajjix'})-[:CHATTER]->(s) RETURN DISTINCT s.name AS stream_name,neo4jLabs_synthetic_gemini,instance_id_34047,neo4jlabs_demo_db_twitch
What is the total revenue generated by movies directed by Steven Spielberg?,"MATCH (d:Director {name: ""Steven Spielberg""})-[:DIRECTED]->(m:Movie) WITH sum(m.revenue) AS totalRevenue RETURN totalRevenue",neo4jLabs_synthetic_gemini,instance_id_29799,neo4jlabs_demo_db_recommendations
What are the movies in which 'Pixar Animation Studios' served as a production company and have a popularity score above 20?,"MATCH (m:Movie)-[:PRODUCED_BY]->(pc:ProductionCompany {name: ""Pixar Animation Studios""}) WHERE m.popularity > 20 RETURN m.title AS MovieTitle, m.popularity AS PopularityScore",neo4jLabs_synthetic_gpt4o,instance_id_44452,neo4jlabs_demo_db_eoflix
What are the first 3 filings with the highest number of entities listed as concerns from different countries?,"MATCH (f:Filing)-[:CONCERNS]->(e:Entity)-[:COUNTRY]->(c:Country) WITH f, count(DISTINCT c.code) AS country_count ORDER BY country_count DESC, f.begin ASC LIMIT 3 RETURN f.sar_id AS filing_id, country_count",neo4jLabs_synthetic_gpt4o,instance_id_41393,neo4jlabs_demo_db_fincen
List 3 movies that have been reviewed with a summary mentioning 'funny'.,"MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE r.summary CONTAINS 'funny' RETURN m.title AS MovieTitle, r.summary AS ReviewSummary LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23997,neo4jlabs_demo_db_movies
Which suppliers have a contact title of 'Purchasing Manager' and supply products with a unit price above 50?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE s.contactTitle = 'Purchasing Manager' AND p.unitPrice > 50 RETURN s.companyName, s.contactName, p.productName, p.unitPrice",neo4jLabs_synthetic_gpt4turbo,instance_id_21876,neo4jlabs_demo_db_northwind
Who has the highest number of follows among persons?,"MATCH (p:Person)-[:FOLLOWS]->(f:Person) RETURN f.name AS person, COUNT(p) AS followers ORDER BY followers DESC LIMIT 1",neo4jLabs_synthetic_gpt4o,instance_id_39929,neo4jlabs_demo_db_movies
List all orders that include products from at least 3 different categories.,"MATCH (o:Order)-[:ORDERS]->(p:Product)-[:PART_OF]->(c:Category) WITH o.orderID AS orderId, collect(DISTINCT c.categoryID) AS categories WHERE size(categories) >= 3 RETURN orderId",neo4jLabs_synthetic_gemini,instance_id_32526,neo4jlabs_demo_db_northwind
List all movies released between 1990 and 2000 that have more than 100 votes.,"MATCH (m:Movie) WHERE m.released >= 1990 AND m.released <= 2000 AND m.votes > 100 RETURN m.title, m.released, m.votes",neo4jLabs_synthetic_gpt4o,instance_id_39845,neo4jlabs_demo_db_movies
Find the first 5 movies with a tagline containing the word 'love'.,MATCH (m:Movie) WHERE m.tagline CONTAINS 'love' RETURN m LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_20655,neo4jlabs_demo_db_eoflix
