question,cypher,data_source,instance_id,database_reference_alias
Which 3 products have the highest units in stock?,"MATCH (p:Product) RETURN p.productName, p.unitsInStock ORDER BY p.unitsInStock DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_22053,neo4jlabs_demo_db_northwind
"How many streams have a description that contains the word ""Welcome""?",MATCH (s:Stream) WHERE s.description CONTAINS 'Welcome' RETURN count(s),neo4jLabs_synthetic_gemini,instance_id_34142,neo4jlabs_demo_db_twitch
Find all actors who have worked as both 'Actor' and 'Director' on different movies.,"MATCH (p:Person)-[:CAST_FOR]->(m1:Movie)  WHERE (p)-[:CREW_FOR]->(:Movie {title: m1.title}) WITH p, COUNT(DISTINCT m1) AS num_movies_acted_and_directed WHERE num_movies_acted_and_directed >= 2 RETURN p.name AS actor_name",neo4jLabs_synthetic_gemini,instance_id_31932,neo4jlabs_demo_db_eoflix
What is the name of the Process that has the most incoming connections from other Processes?,"MATCH (p:Process)<-[r:DEPENDS_ON]-(other:Process) WITH p, count(r) AS incoming_count ORDER BY incoming_count DESC LIMIT 1 RETURN p.name AS process_name",neo4jLabs_synthetic_gemini,instance_id_32469,neo4jlabs_demo_db_network
Retrieve the first 3 filings with an originator bank country of 'Angola' and a beneficiary bank country of 'Singapore'.,MATCH (f:Filing) WHERE f.originator_bank_country = 'Angola' AND f.beneficiary_bank_country = 'Singapore' RETURN f ORDER BY f.begin LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_41107,neo4jlabs_demo_db_fincen
What is the average unitPrice of products in the order with orderID equal to '10465'?,MATCH (o:Order {orderID: '10465'})-[:ORDERS]->(p:Product) WITH avg(toFloat(p.unitPrice)) AS averagePrice RETURN averagePrice,neo4jLabs_synthetic_gemini,instance_id_32572,neo4jlabs_demo_db_northwind
List the original addresses associated with the sourceID 'Panama Papers'.,MATCH (a:Address)-[:registered_address]-(e:Entity) WHERE e.sourceID = 'Panama Papers' RETURN a.original_address,neo4jLabs_synthetic_gpt4o,instance_id_44857,neo4jlabs_demo_db_offshoreleaks
Find all movies that have a plot mentioning 'hero'.,"MATCH (m:Movie) WHERE m.plot CONTAINS 'hero' RETURN m.title, m.plot",neo4jLabs_synthetic_gpt4o,instance_id_42154,neo4jlabs_demo_db_recommendations
Which people have acted in more than 5 movies?,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WITH p, count(m) AS actedMovieCount WHERE actedMovieCount > 5 RETURN p.name, actedMovieCount",neo4jLabs_synthetic_gemini,instance_id_32635,neo4jlabs_demo_db_movies
Name the first 5 users who are VIPs in streams with descriptions mentioning 'fun'.,MATCH (s:Stream)-[:VIP]->(u:User) WHERE s.description CONTAINS 'fun' RETURN u.name LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_43260,neo4jlabs_demo_db_twitch
List the top 5 highest rated movies.,"MATCH (m:Movie)<-[r:REVIEWED]-() WITH m, avg(r.rating) AS average_rating ORDER BY average_rating DESC LIMIT 5 RETURN m.title, average_rating",neo4jLabs_synthetic_gemini,instance_id_32900,neo4jlabs_demo_db_movies
List the top 5 customers based on the number of unique products ordered.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) WITH c, COUNT(DISTINCT p) AS uniqueProductsOrdered ORDER BY uniqueProductsOrdered DESC LIMIT 5 RETURN c.companyName, uniqueProductsOrdered",neo4jLabs_synthetic_gpt4turbo,instance_id_20418,neo4jlabs_demo_db_northwind
How many machines are in the 'DC1' DataCenter's zone 2?,MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(r:Rack {zone: 2})-[:HOLDS]->(m:Machine) RETURN count(m) AS NumberOfMachinesInZone2,neo4jLabs_synthetic_gpt4turbo,instance_id_20914,neo4jlabs_demo_db_network
"List the first 5 sources used in tweets that mention ""Neo4j"".",MATCH (t:Tweet)-[:USING]->(s:Source) WHERE t.text CONTAINS 'Neo4j' RETURN s.name LIMIT 5,neo4jLabs_synthetic_gemini,instance_id_34525,neo4jlabs_demo_db_twitter
What is the total number of products with `discontinued` status set to 'True'?,MATCH (p:Product {discontinued: true}) RETURN count(p) AS totalProducts,neo4jLabs_synthetic_gemini,instance_id_32147,neo4jlabs_demo_db_northwind
What are the top 5 most popular movies based on the 'popularity' property?,"MATCH (m:Movie) RETURN m.title, m.popularity ORDER BY m.popularity DESC LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_31819,neo4jlabs_demo_db_eoflix
Show the first 5 countries with the highest number of filings involving transactions involving multiple countries.,"MATCH (f:Filing) WHERE f.originator_bank_country <> f.beneficiary_bank_country WITH f MATCH (f)-[:ORIGINATOR]->(e1:Entity)-[:COUNTRY]->(c1:Country),        (f)-[:BENEFITS]->(e2:Entity)-[:COUNTRY]->(c2:Country) WHERE c1 <> c2 WITH c1, count(f) AS num_filings RETURN c1.name AS country, num_filings ORDER BY num_filings DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41118,neo4jlabs_demo_db_fincen
"Find the average difference between the `end_date` and the `begin_date` for filings where the `beneficiary_country` is ""Afghanistan"".","MATCH (f:Filing) WHERE f.beneficiary_country = ""Afghanistan"" RETURN avg(duration.between(date(f.begin_date_format), date(f.end_date_format)))",neo4jLabs_synthetic_gemini,instance_id_28319,neo4jlabs_demo_db_fincen
What are the first 5 movies where the main actor has also directed the film?,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(a) RETURN m.title AS MovieTitle, a.name AS ActorDirector LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_24664,neo4jlabs_demo_db_recommendations
List the top 3 filings with the highest number of entities involved as originators from different sectors.,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WITH f, count(DISTINCT e) AS numEntities ORDER BY numEntities DESC LIMIT 3 RETURN f, numEntities",neo4jLabs_synthetic_gpt4turbo,instance_id_21614,neo4jlabs_demo_db_fincen
List all products with a unit price between $50 and $100.,"MATCH (p:Product) WHERE p.unitPrice >= 50 AND p.unitPrice <= 100 RETURN p.productName, p.unitPrice",neo4jLabs_synthetic_gpt4o,instance_id_45182,neo4jlabs_demo_db_northwind
Identify machines that run an OS started at or after timestamp 1606165629748.,MATCH (m:Machine)-[:RUNS]->(os:OS) WHERE os.startTime >= 1606165629748 RETURN m.name,neo4jLabs_synthetic_gpt4o,instance_id_43845,neo4jlabs_demo_db_network
Find all movies that have a different original title and title. (first 3),"MATCH (m:Movie) WHERE m.original_title <> m.title RETURN m.title, m.original_title LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_31850,neo4jlabs_demo_db_eoflix
Find the entities that have a 'officer_of' relationship with the officer with node_id 12160432.,MATCH (o:Officer {node_id: 12160432}) MATCH (e:Entity)<-[:officer_of]-(o) RETURN e,neo4jLabs_synthetic_gemini,instance_id_30997,neo4jlabs_demo_db_offshoreleaks
What are the details of products that are part of the 'Grains/Cereals' category and have been ordered more than 50 times?,"MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Grains/Cereals'}),       (o:Order)-[r:ORDERS]->(p) WHERE r.quantity > 50 RETURN p.productName AS productName, p.quantityPerUnit AS quantityPerUnit, p.unitsOnOrder AS unitsOnOrder,         p.supplierID AS supplierID, p.productID AS productID, p.discontinued AS discontinued,         p.categoryID AS categoryID, p.reorderLevel AS reorderLevel, p.unitsInStock AS unitsInStock,         p.unitPrice AS unitPrice, SUM(r.quantity) AS totalOrdered",neo4jLabs_synthetic_gpt4o,instance_id_44707,neo4jlabs_demo_db_northwind
List the names of 3 persons who have the name starting with 'L'.,MATCH (p:Person) WHERE p.name STARTS WITH 'L' RETURN p.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23908,neo4jlabs_demo_db_movies
Retrieve the first 3 filings where the beneficiary bank country is 'Singapore' and the amount is above 200000.,MATCH (f:Filing) WHERE f.beneficiary_bank_country = 'Singapore' AND f.amount > 200000 RETURN f LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21576,neo4jlabs_demo_db_fincen
What is the budget for the adult film 'Erotic Nights of the Living Dead'?,MATCH (a:Adult {title: 'Erotic Nights of the Living Dead'}) RETURN a.budget,neo4jLabs_synthetic_gemini,instance_id_34436,neo4jlabs_demo_db_eoflix
List the `name`s of the entities that are connected to filings with an `amount` less than 1000 through the `CONCERNS` relationship.,MATCH (f:Filing)-[:CONCERNS]->(e:Entity) WHERE f.amount < 1000 RETURN DISTINCT e.name,neo4jLabs_synthetic_gemini,instance_id_28314,neo4jlabs_demo_db_fincen
Which actors have starred in both movies and TV shows?,MATCH (p:Person)-[:CAST_FOR]->(:Movie) MATCH (p)-[:CAST_FOR]->(:Video) RETURN DISTINCT p.name,neo4jLabs_synthetic_gemini,instance_id_31637,neo4jlabs_demo_db_eoflix
What are the names of other entities with type 'LIMITED LIABILITY COMPANY'?,MATCH (o:Other {type: 'LIMITED LIABILITY COMPANY'}) RETURN o.name,neo4jLabs_synthetic_gpt4turbo,instance_id_21227,neo4jlabs_demo_db_offshoreleaks
What are the types of machines that are running applications named 'cms'?,MATCH (app:Application {name: 'cms'})<-[:RUNS]-(machine:Machine)-[:TYPE]->(type:Type) RETURN DISTINCT type.name AS MachineType,neo4jLabs_synthetic_gpt4o,instance_id_43949,neo4jlabs_demo_db_network
Which users have the highest average rating given to movies? (minimum 3 ratings),"MATCH (u:User)-[r:RATED]->(m:Movie) WITH u, avg(r.rating) AS avgRating, count(r) AS numRatings WHERE numRatings >= 3 RETURN u.name AS userName, avgRating ORDER BY avgRating DESC LIMIT 1",neo4jLabs_synthetic_gpt4o,instance_id_42756,neo4jlabs_demo_db_recommendations
"Find all users who chatter in streams that use the English language and have ""Music"" in their description.","MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE l.name = ""en"" AND s.description CONTAINS ""Music"" MATCH (u:User)-[:CHATTER]->(s) RETURN DISTINCT u.name",neo4jLabs_synthetic_gemini,instance_id_33897,neo4jlabs_demo_db_twitch
What is the average unit price of products in the 'Beverages' category?,MATCH (c:Category {categoryName: 'Beverages'})-[:PART_OF]->(p:Product) WITH avg(p.unitPrice) AS averagePrice RETURN averagePrice,neo4jLabs_synthetic_gemini,instance_id_32483,neo4jlabs_demo_db_northwind
Display all Filings where the originator and beneficiary banks are from 'Singapore'.,MATCH (f:Filing) WHERE f.originator_bank_country = 'Singapore' AND f.beneficiary_bank_country = 'Singapore' RETURN f,neo4jLabs_synthetic_gpt4turbo,instance_id_21491,neo4jlabs_demo_db_fincen
"What genre is the movie ""Boxtrolls, The""?","MATCH (m:Movie {title: ""Boxtrolls, The""})-[:IN_GENRE]->(g:Genre) RETURN g.name",neo4jLabs_synthetic_gemini,instance_id_29729,neo4jlabs_demo_db_recommendations
List the first 5 countries connected to entities that have filed more than 10 filings.,"MATCH (e:Entity)-[:FILED]->(f:Filing) WITH e, count(f) AS filingsCount WHERE filingsCount > 10 MATCH (e)-[:COUNTRY]->(c:Country) RETURN DISTINCT c LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21579,neo4jlabs_demo_db_fincen
List all actors born in the USA who have acted in at least two movies.,"MATCH (a:Actor {bornIn: 'USA'})-[:ACTED_IN]->(m:Movie) WITH a, count(m) AS movies_count WHERE movies_count >= 2 RETURN a.name, movies_count",neo4jLabs_synthetic_gpt4turbo,instance_id_25365,neo4jlabs_demo_db_recommendations
List the top 5 actors by the number of movies they have cast in.,"MATCH (p:Person)-[:CAST_FOR]->(m:Movie) WITH p, count(m) AS movie_count ORDER BY movie_count DESC LIMIT 5 RETURN p.name AS actor_name, movie_count",neo4jLabs_synthetic_gpt4o,instance_id_39420,neo4jlabs_demo_db_eoflix
List all products that are part of the 'Beverages' category.,"MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Beverages'}) RETURN p.productName AS ProductName, p.productID AS ProductID, p.unitPrice AS UnitPrice, p.unitsInStock AS UnitsInStock",neo4jLabs_synthetic_gpt4o,instance_id_45223,neo4jlabs_demo_db_northwind
Name the first 3 people who have reviewed a movie with a tagline stating 'Welcome to the Real World'.,MATCH (p:Person)-[:REVIEWED]->(m:Movie {tagline: 'Welcome to the Real World'}) RETURN p.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23889,neo4jlabs_demo_db_movies
What are the top 5 movies with the most votes in descending order?,"MATCH (m:Movie) RETURN m.title, m.votes ORDER BY m.votes DESC LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_33024,neo4jlabs_demo_db_movies
What is the average number of 'statuses' for users who follow more than 1000 other users?,MATCH (user:User)-[:FOLLOWS]->(:User) WHERE user.following > 1000 RETURN avg(user.statuses),neo4jLabs_synthetic_gemini,instance_id_34499,neo4jlabs_demo_db_twitter
"List the products that have a reorder level greater than 20, are not discontinued, and are supplied by suppliers based in the USA.",MATCH (p:Product)-[:SUPPLIES]-(s:Supplier) WHERE p.reorderLevel > 20 AND p.discontinued = false AND s.country = 'USA' RETURN p.productName,neo4jLabs_synthetic_gemini,instance_id_32287,neo4jlabs_demo_db_northwind
Find all movies where the original language is 'en' and have a tagline included.,MATCH (m:Movie)-[:ORIGINAL_LANGUAGE]->(l:Language {id: 'en'}) WHERE m.tagline IS NOT NULL RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_23585,neo4jlabs_demo_db_eoflix
Find the top 5 movies with the most votes.,"MATCH (m:Movie) RETURN m.title, m.votes ORDER BY m.votes DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_40016,neo4jlabs_demo_db_movies
Which customers (show `customerID` and `companyName`) have placed orders that include at least one product with a `quantity` greater than 100?,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[or:ORDERS]->(p:Product) WHERE or.quantity > 100 RETURN DISTINCT c.customerID, c.companyName",neo4jLabs_synthetic_gemini,instance_id_30849,neo4jlabs_demo_db_northwind
What is the average disk size of machines running the application 'webserver'?,MATCH (app:Application {name: 'webserver'})-[:RUNS]->(m:Machine)-[:TYPE]->(t:Type) RETURN avg(t.disk),neo4jLabs_synthetic_gemini,instance_id_31690,neo4jlabs_demo_db_network
List the names of the top 5 users who are VIPs in the most number of different streams.,"MATCH (u:User)-[:VIP]->(s:Stream) WITH u, count(DISTINCT s) AS vipCount ORDER BY vipCount DESC LIMIT 5 RETURN u.name AS UserName, vipCount",neo4jLabs_synthetic_gpt4turbo,instance_id_25483,neo4jlabs_demo_db_twitch
List the top 3 movies with the least votes.,"MATCH (m:Movie) RETURN m.title, m.votes ORDER BY m.votes ASC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_39473,neo4jlabs_demo_db_movies
"List the first 3 filings where the originator iso code is ""AND"".",MATCH (f:Filing) WHERE f.originator_iso = 'AND' RETURN f.id LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_28249,neo4jlabs_demo_db_fincen
List the top 3 customers who have ordered products in the 'Meat/Poultry' category.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product)-[:PART_OF]->(cat:Category {categoryName: 'Meat/Poultry'}) WITH c, COUNT(o) AS ordersCount ORDER BY ordersCount DESC LIMIT 3 RETURN c.companyName, ordersCount",neo4jLabs_synthetic_gpt4turbo,instance_id_20592,neo4jlabs_demo_db_northwind
What is the total number of users who are VIPs for at least three different streams and are also moderators for at least one stream and use the Russian language?,"MATCH (user:User)-[:VIP]->(stream:Stream) WITH user, count(DISTINCT stream) AS vipCount WHERE vipCount >= 3 MATCH (user)-[:MODERATOR]->(:Stream) MATCH (user)-[:CHATTER]->(:Stream)-[:HAS_LANGUAGE]->(language:Language {name: 'ru'}) RETURN count(DISTINCT user) AS totalUsers",neo4jLabs_synthetic_gemini,instance_id_33822,neo4jlabs_demo_db_twitch
What is the jurisdiction of the entity with the most recent inactivation_date?,MATCH (e:Entity) RETURN e.jurisdiction ORDER BY e.inactivation_date DESC LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_30949,neo4jlabs_demo_db_offshoreleaks
What is the average amount of filings benefiting entities in the United Kingdom?,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE c.code = ""GBR"" WITH avg(f.amount) AS average_amount RETURN average_amount",neo4jLabs_synthetic_gemini,instance_id_28995,neo4jlabs_demo_db_fincen
Name the first 5 movies that have been rated by at least 50 users.,"MATCH (m:Movie)<-[:RATED]-(u:User) WITH m, COUNT(u) AS userCount WHERE userCount >= 50 RETURN m.title AS movieTitle ORDER BY userCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44439,neo4jlabs_demo_db_eoflix
List the orders that include products from more than 5 different categories.,"MATCH (o:Order)-[:ORDERS]->(p:Product)-[:PART_OF]->(c:Category) WITH o, count(DISTINCT c) AS distinctCategories WHERE distinctCategories > 5 RETURN o.orderID",neo4jLabs_synthetic_gemini,instance_id_32135,neo4jlabs_demo_db_northwind
List the first 3 products that have never been reordered (reorder level = 0).,"MATCH (p:Product) WHERE p.reorderLevel = 0 RETURN p.productName, p.productID LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45322,neo4jlabs_demo_db_northwind
Find the top 5 most expensive products supplied by 'Exotic Liquids'.,"MATCH (s:Supplier {companyName: 'Exotic Liquids'})-[:SUPPLIES]->(p:Product) RETURN p.productName, p.unitPrice ORDER BY p.unitPrice DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44972,neo4jlabs_demo_db_northwind
Identify the top 3 filings with the largest number of transactions.,"MATCH (f:Filing) RETURN f.sar_id, f.number ORDER BY f.number DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41323,neo4jlabs_demo_db_fincen
List the first 3 tweets that mention the user with the highest betweenness.,MATCH (u:User) WITH u ORDER BY u.betweenness DESC LIMIT 1 MATCH (t:Tweet)-[:MENTIONS]->(u) RETURN t LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24859,neo4jlabs_demo_db_twitter
List the roles of actors in the top 5 movies with the most votes.,"MATCH (m:Movie)<-[:ACTED_IN]-(p:Person) WITH m, p, m.votes AS votes, m.title AS title, p.name AS actor, collect(p.roles) AS roles ORDER BY votes DESC LIMIT 5 RETURN title, actor, roles",neo4jLabs_synthetic_gpt4o,instance_id_40086,neo4jlabs_demo_db_movies
Which machines are running services that started after timestamp 1606597376483?,MATCH (m:Machine)-[:RUNS]->(s:Service) WHERE s.startTime > 1606597376483 RETURN m.name,neo4jLabs_synthetic_gpt4o,instance_id_44020,neo4jlabs_demo_db_network
List the top 5 most recently added products to the database.,MATCH (p:Product) RETURN p ORDER BY p.productID DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21925,neo4jlabs_demo_db_northwind
Which director has directed movies in the most genres?,"MATCH (d:Director)-[:DIRECTED]->(m:Movie)-[:IN_GENRE]->(g:Genre) WITH d, collect(DISTINCT g.name) AS genres WITH d, size(genres) AS genreCount ORDER BY genreCount DESC RETURN d.name, genreCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29835,neo4jlabs_demo_db_recommendations
What is the average runtime of romantic comedies?,MATCH (m:Movie)-[:IN_GENRE]->(g1:Genre {name: 'Romance'}) MATCH (m)-[:IN_GENRE]->(g2:Genre {name: 'Comedy'}) RETURN avg(m.runtime),neo4jLabs_synthetic_gemini,instance_id_34297,neo4jlabs_demo_db_eoflix
List all movies that have been reviewed with a summary including 'amazing journey'.,"MATCH (m:Movie)<-[:REVIEWED {summary: 'An amazing journey'}]-(p:Person) RETURN m.title AS MovieTitle, p.name AS ReviewerName",neo4jLabs_synthetic_gpt4turbo,instance_id_23306,neo4jlabs_demo_db_movies
List the top 3 filings by amount that involve an originator bank from 'Singapore'.,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country {name: 'Singapore'}) RETURN f.sar_id, f.amount ORDER BY f.amount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41790,neo4jlabs_demo_db_fincen
Find all users who are 'VIP' to streams with a total view count greater than 1 million.,MATCH (s:Stream)-[:VIP]->(u:User) WHERE s.total_view_count > 1000000 RETURN DISTINCT u.name,neo4jLabs_synthetic_gemini,instance_id_33689,neo4jlabs_demo_db_twitch
List the names of all processes running on machines in zone 2.,MATCH (r:Rack {zone: 2})-[:HOLDS]->(m:Machine)-[:RUNS]->(p:Process) RETURN p.name,neo4jLabs_synthetic_gemini,instance_id_32360,neo4jlabs_demo_db_network
List the first 3 movies with the most different directors involved.,"MATCH (m:Movie)<-[:DIRECTED]-(d:Director) WITH m, count(d) as directorCount ORDER BY directorCount DESC LIMIT 3 RETURN m.title as MovieTitle, directorCount",neo4jLabs_synthetic_gpt4o,instance_id_42659,neo4jlabs_demo_db_recommendations
Find the actors who have starred in movies with a budget lower than $1 million.,MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.budget < 1000000 RETURN DISTINCT a.name,neo4jLabs_synthetic_gemini,instance_id_29581,neo4jlabs_demo_db_recommendations
Name the top 5 countries based on the number of languages spoken in their produced movies.,"MATCH (c:Country)<-[:PRODUCED_IN_COUNTRY]-(m:Movie)-[:SPOKEN_IN_LANGUAGE]->(l:Language) WITH c, COUNT(DISTINCT l) AS languages_spoken RETURN c.name AS country, languages_spoken ORDER BY languages_spoken DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23158,neo4jlabs_demo_db_eoflix
"List the movies with the review summary containing the phrase ""Pretty funny"".",MATCH (m:Movie)<-[r:REVIEWED]-() WHERE r.summary CONTAINS 'Pretty funny' RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32699,neo4jlabs_demo_db_movies
What is the average number of Ports per Service?,"MATCH (s:Service)-[:LISTENS]->(p:Port) WITH s, size(collect(p)) AS portsCount RETURN avg(portsCount) AS averagePortsPerService",neo4jLabs_synthetic_gemini,instance_id_32410,neo4jlabs_demo_db_network
"Show me the movies with a tagline containing the word ""Ever"".",MATCH (m:Movie) WHERE m.tagline CONTAINS 'Ever' RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32725,neo4jlabs_demo_db_movies
What is the name of the movie with the shortest runtime?,"MATCH (m:Movie) RETURN m.title, min(m.runtime) AS runtime ORDER BY runtime ASC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_34270,neo4jlabs_demo_db_eoflix
Identify the top 5 countries where the originator banks of the filings are based.,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country) RETURN c.name AS Country, count(f) AS NumberOfFilings ORDER BY NumberOfFilings DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_26786,neo4jlabs_demo_db_fincen
What is the average number of followers for streams created in 2018?,MATCH (s:Stream) WHERE s.createdAt >= datetime('2018-01-01T00:00:00Z') AND s.createdAt < datetime('2019-01-01T00:00:00Z') WITH avg(s.followers) AS averageFollowers RETURN averageFollowers,neo4jLabs_synthetic_gemini,instance_id_32609,neo4jlabs_demo_db_twitch
Which actors were born before 1960?,MATCH (p:Person) WHERE p.born < 1960 MATCH (p)-[:ACTED_IN]->(m:Movie) RETURN DISTINCT p.name,neo4jLabs_synthetic_gemini,instance_id_32748,neo4jlabs_demo_db_movies
"List the names of the games played by streams that have a total view count less than 1,000,000.",MATCH (s:Stream)-[:PLAYS]->(g:Game) WHERE s.total_view_count < 1000000 RETURN DISTINCT g.name,neo4jLabs_synthetic_gemini,instance_id_34048,neo4jlabs_demo_db_twitch
What is the average number of Switches per Rack?,"MATCH (r:Rack)-[:HOLDS]->(s:Switch) WITH r, count(s) AS numSwitches WITH avg(numSwitches) AS averageSwitchesPerRack RETURN averageSwitchesPerRack",neo4jLabs_synthetic_gemini,instance_id_32450,neo4jlabs_demo_db_network
Name 3 persons who acted in the most movies with a tagline containing 'journey'.,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.tagline CONTAINS 'journey' WITH p, count(m) AS movies_count ORDER BY movies_count DESC LIMIT 3 RETURN p.name AS person_name, movies_count",neo4jLabs_synthetic_gpt4turbo,instance_id_24011,neo4jlabs_demo_db_movies
Which applications are instances of service named 'java'?,MATCH (s:Service {name: 'java'})-[:INSTANCE]->(a:Application) RETURN a.name AS ApplicationName,neo4jLabs_synthetic_gpt4turbo,instance_id_20214,neo4jlabs_demo_db_network
List the first 3 users who rated a movie on its release day.,MATCH (u:User)-[r:RATED]->(m:Movie) WHERE m.released IS NOT NULL AND r.timestamp = date(m.released).epochSeconds RETURN u LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_25007,neo4jlabs_demo_db_recommendations
Which movie has the most sequels?,"MATCH (m1:Movie) WHERE EXISTS((m1)-[:IN_GENRE]->(:Genre)) WITH m1 MATCH (m2:Movie) WHERE m1.title = m2.title AND m1.movieId <> m2.movieId WITH m1, count(DISTINCT m2) AS sequelCount ORDER BY sequelCount DESC RETURN m1.title AS movieTitle, sequelCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29776,neo4jlabs_demo_db_recommendations
Which supplier has the highest average product unit price?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WITH s, avg(p.unitPrice) AS avg_price ORDER BY avg_price DESC RETURN s.companyName, avg_price LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_30773,neo4jlabs_demo_db_northwind
What are the first 3 adult videos with exactly one keyword?,"MATCH (a:Adult)-[:HAS_KEYWORD]->(k:Keyword) WITH a, COUNT(k) AS keywordCount WHERE keywordCount = 1 RETURN a.title AS AdultVideoTitle, a.id AS AdultVideoID ORDER BY a.title LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_39680,neo4jlabs_demo_db_eoflix
List the top 3 actors who have acted in both comedy and drama genres.,"MATCH (a:Actor)-[:ACTED_IN]->(m1:Movie)-[:IN_GENRE]->(g1:Genre {name: ""Comedy""}),       (a)-[:ACTED_IN]->(m2:Movie)-[:IN_GENRE]->(g2:Genre {name: ""Drama""}) WITH a, COUNT(DISTINCT m1) + COUNT(DISTINCT m2) AS movieCount ORDER BY movieCount DESC LIMIT 3 RETURN a.name AS actorName, movieCount",neo4jLabs_synthetic_gpt4o,instance_id_42425,neo4jlabs_demo_db_recommendations
List the top 5 adult films with a tagline containing 'murder'.,"MATCH (a:Adult) WHERE a.tagline CONTAINS 'murder' RETURN a.title, a.tagline, a.imdb_id ORDER BY a.popularity DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23514,neo4jlabs_demo_db_eoflix
Which 3 orders have the highest number of units ordered per product?,"MATCH (o:Order)-[r:ORDERS]->(p:Product) RETURN o.orderID AS orderID, p.productName AS productName, r.quantity AS quantity ORDER BY r.quantity DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45251,neo4jlabs_demo_db_northwind
What is the source ID for the relationship connecting an Other node to an Entity with the same name?,MATCH (o:Other)-[r:same_name_as]->(e:Entity) RETURN r.sourceID,neo4jLabs_synthetic_gemini,instance_id_31369,neo4jlabs_demo_db_offshoreleaks
Show all orders from customers in 'Portland'.,MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE c.city = 'Portland' RETURN o,neo4jLabs_synthetic_gpt4o,instance_id_45328,neo4jlabs_demo_db_northwind
Which actors have directed a movie they acted in? Limit to 5 actors.,MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(a) RETURN a.name AS actorName LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_42021,neo4jlabs_demo_db_recommendations
"How many users are VIPs in streams that have the language ""en""?","MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE l.name = ""en"" MATCH (s)-[:VIP]->(user:User) RETURN count(DISTINCT user)",neo4jLabs_synthetic_gemini,instance_id_33891,neo4jlabs_demo_db_twitch
What are the names of the products that have been ordered more than 50 times?,MATCH (:Order)-[o:ORDERS]->(p:Product) WHERE o.quantity > 50 RETURN DISTINCT p.productName AS productName,neo4jLabs_synthetic_gpt4o,instance_id_45166,neo4jlabs_demo_db_northwind
Find the filings where the originator bank is 'CIMB Bank Berhad' and the amount is greater than 1 million.,MATCH (f:Filing) WHERE f.originator_bank = 'CIMB Bank Berhad' AND f.amount > 1000000 RETURN f,neo4jLabs_synthetic_gemini,instance_id_29031,neo4jlabs_demo_db_fincen
List the first 3 products that have been ordered with a discount of more than 5%.,"MATCH (o:Order)-[ord:ORDERS]->(p:Product) WHERE toFloat(ord.discount) > 0.05 RETURN p.productName AS ProductName, ord.discount AS Discount ORDER BY ord.discount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_45204,neo4jlabs_demo_db_northwind
What is the average freight of orders made by the customer with customerID equal to 'ERNSH'?,MATCH (c:Customer {customerID: 'ERNSH'})-[:PURCHASED]->(o:Order) WITH avg(toFloat(o.freight)) AS averageFreight RETURN averageFreight,neo4jLabs_synthetic_gemini,instance_id_32549,neo4jlabs_demo_db_northwind
What are the names of the first 3 products that have a unit price less than 5 and are discontinued?,MATCH (p:Product) WHERE p.unitPrice < 5 AND p.discontinued = true RETURN p.productName ORDER BY p.productName LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_45089,neo4jlabs_demo_db_northwind
"What is the average amount filed by the entity with name ""The Bank of New York Mellon Corp.""?","MATCH (e:Entity {name: ""The Bank of New York Mellon Corp.""})-[:FILED]->(f:Filing) WITH avg(f.amount) AS averageAmount RETURN averageAmount",neo4jLabs_synthetic_gemini,instance_id_29002,neo4jlabs_demo_db_fincen
"What is the average rating of movies with a title that contains the word ""Matrix""?",MATCH (m:Movie) WHERE m.title CONTAINS 'Matrix' WITH avg(m.votes) AS average_rating RETURN average_rating,neo4jLabs_synthetic_gemini,instance_id_33071,neo4jlabs_demo_db_movies
List the first 3 country codes associated with Intermediaries.,MATCH (i:Intermediary) RETURN i.country_codes LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_30660,neo4jlabs_demo_db_offshoreleaks
Which entities have a closed date of '28-NOV-2012' and what are their names?,MATCH (e:Entity) WHERE e.closed_date = '28-NOV-2012' RETURN e.name AS entity_name,neo4jLabs_synthetic_gpt4o,instance_id_44921,neo4jlabs_demo_db_offshoreleaks
"What is the average rating given by users to movies in the ""Comedy"" genre?",MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Comedy'}) WITH m MATCH (u:User)-[r:RATED]->(m) RETURN avg(r.rating) AS average_rating,neo4jLabs_synthetic_gemini,instance_id_29429,neo4jlabs_demo_db_recommendations
List all movies with a vote count between 100 and 500.,MATCH (m:Movie) WHERE m.votes >= 100 AND m.votes <= 500 RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_24045,neo4jlabs_demo_db_movies
"""which acters played more than 10 times in a movie""","MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WITH a, COUNT(m) AS movies_count WHERE movies_count > 10 RETURN a.name, movies_count",neo4j_crowdsourced,instance_id_27864,neo4jlabs_demo_db_recommendations
Find the movies directed by people born before 1950.,MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE p.born < 1950 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32901,neo4jlabs_demo_db_movies
"""How many users chat in both tfue and shroud channels?""","MATCH (u:User)-[:CHATTER]->(s1:Stream {name: ""tfue""}), (u)-[:CHATTER]->(s2:Stream {name: ""shroud""}) RETURN COUNT(DISTINCT u) AS userCount",neo4j_crowdsourced,instance_id_27343,neo4jlabs_demo_db_twitch
List entities that have filed more than 20 filings.,"MATCH (e:Entity)-[:FILED]->(f:Filing) WITH e, COUNT(f) AS num_filings WHERE num_filings > 20 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_41314,neo4jlabs_demo_db_fincen
Which 3 suppliers have the most diverse range of product categories supplied?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product)-[:PART_OF]->(c:Category) WITH s, collect(DISTINCT c.categoryID) AS categories RETURN s.companyName, size(categories) AS categoryCount ORDER BY categoryCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44529,neo4jlabs_demo_db_northwind
Which 5 countries have the highest number of filings involving transactions below $1 million?,"MATCH (f:Filing)-[:BENEFITS|:CONCERNS|:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE f.amount < 1000000 WITH c.name AS country, COUNT(f) AS filings_count RETURN country, filings_count ORDER BY filings_count DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41116,neo4jlabs_demo_db_fincen
