question,cypher,data_source,instance_id,database_reference_alias
List the names of the teams that have streams moderated by users with a total view count greater than 5 million.,MATCH (s:Stream) WHERE s.total_view_count > 5000000 MATCH (s)-[:MODERATOR]->(u:User) MATCH (s)-[:HAS_TEAM]->(t:Team) RETURN DISTINCT t.name,neo4jLabs_synthetic_gemini,instance_id_34122,neo4jlabs_demo_db_twitch
List all officers named 'KIM SOO IN'.,MATCH (o:Officer) WHERE o.name = 'KIM SOO IN' RETURN o,neo4jLabs_synthetic_gpt4o,instance_id_42534,neo4jlabs_demo_db_offshoreleaks
Which users followed by 'Neo4j' have posted tweets mentioning 'Neo4j'? Show the top 5.,"MATCH (me:Me {screen_name: 'neo4j'})-[:FOLLOWS]->(user:User)-[:POSTS]->(tweet:Tweet)-[:MENTIONS]->(me) RETURN user.screen_name, tweet.text ORDER BY tweet.created_at DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43117,neo4jlabs_demo_db_twitter
"Find all streams that have a VIP who also chats in a stream with the word ""Creative"" in its description.",MATCH (s1:Stream)-[:VIP]->(vip) MATCH (s2:Stream) WHERE s2.description CONTAINS 'Creative' MATCH (vip)-[:CHATTER]->(s2) RETURN DISTINCT s1.name,neo4jLabs_synthetic_gemini,instance_id_33906,neo4jlabs_demo_db_twitch
What is the jurisdiction of the entity with the most officers?,"MATCH (e:Entity)<-[r:officer_of]-(o:Officer) WITH e, count(o) AS officerCount ORDER BY officerCount DESC RETURN e.jurisdiction, officerCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_30919,neo4jlabs_demo_db_offshoreleaks
What is the maximum total view count among all the streams?,MATCH (s:Stream) RETURN max(s.total_view_count) AS max_total_view_count,neo4jLabs_synthetic_gemini,instance_id_33685,neo4jlabs_demo_db_twitch
List the first 3 tweets where 'neo4j' is mentioned and the tweet has been favorited more than 50 times.,MATCH (t:Tweet)-[:MENTIONS]->(u:User {screen_name: 'neo4j'}) WHERE t.favorites > 50 RETURN t LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24234,neo4jlabs_demo_db_twitter
Find all movies that have been directed by a person who has also directed a stage play. (first 3),MATCH (m:Movie) RETURN m LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_32026,neo4jlabs_demo_db_eoflix
"How many Entities have a registered address with the country_codes ""WSM""?","MATCH (e:Entity)-[:registered_address]->(a:Address) WHERE a.country_codes = ""WSM"" RETURN count(DISTINCT e) AS entityCount",neo4jLabs_synthetic_gemini,instance_id_30736,neo4jlabs_demo_db_offshoreleaks
List the top 3 users who follow 'Me' and also have a following count over 10000.,MATCH (u:User)-[:FOLLOWS]->(me:Me) WHERE u.following > 10000 RETURN u ORDER BY u.following DESC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24147,neo4jlabs_demo_db_twitter
What is the average number of Ports per Process?,"MATCH (p:Process)-[:LISTENS]->(port:Port) WITH p, count(port) AS num_ports WITH avg(num_ports) AS average_ports RETURN average_ports",neo4jLabs_synthetic_gemini,instance_id_32441,neo4jlabs_demo_db_network
Find the actors who have played the same role in different movies.,"MATCH (a:Actor)-[ai:ACTED_IN]->(m:Movie) WITH a, ai.role AS role, count(DISTINCT m) AS movieCount WHERE movieCount > 1 RETURN a.name AS actorName, role",neo4jLabs_synthetic_gemini,instance_id_29790,neo4jlabs_demo_db_recommendations
List the `name`s of the entities that are connected to filings with an `amount` greater than 1000000 through the `BENEFITS` relationship?,MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WHERE f.amount > 1000000 RETURN e.name,neo4jLabs_synthetic_gemini,instance_id_28115,neo4jlabs_demo_db_fincen
List the customers who have placed orders that include products with a discount greater than 0.,MATCH (o:Order)-[orders:ORDERS]->(p:Product) WHERE toFloat(orders.discount) > 0 WITH o MATCH (c:Customer)-[:PURCHASED]->(o) RETURN DISTINCT c.companyName,neo4jLabs_synthetic_gemini,instance_id_30791,neo4jlabs_demo_db_northwind
What is the icij_id of the Officer with node ID 12174285?,MATCH (o:Officer {node_id: 12174285}) RETURN o.icij_id,neo4jLabs_synthetic_gemini,instance_id_30672,neo4jlabs_demo_db_offshoreleaks
"Find all Intermediaries with a status of ""SUSPENDED"" that are linked to Entities that share the same ""registered_address"" as an Entity with a status of ""Defaulted"".",MATCH (defaulted:Entity {status: 'Defaulted'})-[:registered_address]->(sharedAddress:Address)<-[:registered_address]-(entity:Entity)<-[:intermediary_of]-(intermediary:Intermediary {status: 'SUSPENDED'}) RETURN DISTINCT intermediary.name,neo4jLabs_synthetic_gemini,instance_id_31411,neo4jlabs_demo_db_offshoreleaks
Identify the services running with a start time greater than 1607000000000.,MATCH (s:Service) WHERE s.startTime > 1607000000000 RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_20323,neo4jlabs_demo_db_network
Name the first 3 adult films that were produced in the country 'Italy'.,MATCH (a:Adult)-[:PRODUCED_IN_COUNTRY]->(c:Country {name: 'Italy'}) RETURN a.title ORDER BY a.release_date LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_44188,neo4jlabs_demo_db_eoflix
Which entities share the same company as 'Top Games Holdings Inc.'?,MATCH (e:Entity {name: 'Top Games Holdings Inc.'})-[:same_company_as]->(sameCompany:Entity) RETURN sameCompany,neo4jLabs_synthetic_gpt4turbo,instance_id_21357,neo4jlabs_demo_db_offshoreleaks
Find all movies that have a revenue greater than the combined revenue of the bottom 10 movies.,"MATCH (m:Movie) WITH m ORDER BY m.revenue ASC WITH m.revenue AS tenth_lowest_revenue SKIP 9 LIMIT 1  MATCH (m:Movie) WHERE m.revenue <= tenth_lowest_revenue WITH sum(m.revenue) AS combined_revenue MATCH (m:Movie)  WHERE m.revenue > combined_revenue RETURN m.title, m.revenue",neo4jLabs_synthetic_gemini,instance_id_31827,neo4jlabs_demo_db_eoflix
Which 3 videos have the longest runtime and are in the 'Released' status?,"MATCH (v:Video) WHERE v.status = 'Released' RETURN v.title, v.runtime ORDER BY v.runtime DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21051,neo4jlabs_demo_db_eoflix
"What is the CPU count of the type of machine that has the name ""xl-16/256/625""?","MATCH (t:Type {name: ""xl-16/256/625""}) RETURN t.cpu",neo4jLabs_synthetic_gemini,instance_id_31749,neo4jlabs_demo_db_network
Find the streams that are moderated by users who have a total view count greater than the average total view count of all streams playing the same game.,"MATCH (s:Stream)-[:PLAYS]->(g:Game) WITH g, avg(s.total_view_count) AS avg_view_count MATCH (u:User)-[:MODERATOR]->(other:Stream)-[:PLAYS]->(g) WHERE u.total_view_count > avg_view_count RETURN DISTINCT other.name",neo4jLabs_synthetic_gemini,instance_id_34107,neo4jlabs_demo_db_twitch
List the first 3 movies where someone named 'Carrie-Anne Moss' acted.,MATCH (p:Person {name: 'Carrie-Anne Moss'})-[:ACTED_IN]->(m:Movie) RETURN m.title LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23658,neo4jlabs_demo_db_movies
"Find all movies that have a tagline containing the word ""thriller"".",MATCH (m:Movie) WHERE toLower(m.tagline) CONTAINS 'thriller' RETURN m,neo4jLabs_synthetic_gemini,instance_id_31823,neo4jlabs_demo_db_eoflix
"""영화 cafe noir에 대해 설명해줘""","MATCH (m:Movie {title: ""cafe noir""}) RETURN m.overview",neo4j_crowdsourced,instance_id_27729,neo4jlabs_demo_db_eoflix
What is the last edit timestamp of the Address with node ID 14048584?,MATCH (a:Address {node_id: 14048584}) RETURN a.lastEditTimestamp,neo4jLabs_synthetic_gemini,instance_id_30665,neo4jlabs_demo_db_offshoreleaks
List all actors who have never acted in an 'Action' genre movie.,MATCH (a:Actor) WHERE NOT EXISTS {     MATCH (a)-[:ACTED_IN]->(m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Action'}) } RETURN a,neo4jLabs_synthetic_gpt4turbo,instance_id_25348,neo4jlabs_demo_db_recommendations
List the first 3 streams that have a description mentioning 'game'.,MATCH (s:Stream) WHERE s.description CONTAINS 'game' RETURN s LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24447,neo4jlabs_demo_db_twitch
List the sources used in tweets that mention users followed by Neo4j.,MATCH (me:Me)-[:FOLLOWS]->(user:User)<-[:MENTIONS]-(tweet:Tweet)-[:USING]->(source:Source) RETURN DISTINCT source.name,neo4jLabs_synthetic_gemini,instance_id_34522,neo4jlabs_demo_db_twitter
What are the names of the top 5 entities that have benefited from filings originated by banks in 'Singapore'?,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WHERE f.originator_bank_country = 'Singapore' RETURN e.name AS entity_name, COUNT(f) AS filings_count ORDER BY filings_count DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41105,neo4jlabs_demo_db_fincen
Identify the streams that have the most moderators.,"MATCH (s:Stream)-[:MODERATOR]->(u:User) WITH s, COUNT(u) AS moderator_count ORDER BY moderator_count DESC LIMIT 1 RETURN s.name AS stream_name, moderator_count",neo4jLabs_synthetic_gpt4o,instance_id_43637,neo4jlabs_demo_db_twitch
Which actor has the highest average gross revenue per movie?,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WITH a, sum(m.revenue) AS totalRevenue, count(m) AS numberOfMovies WITH a, totalRevenue, numberOfMovies, (totalRevenue / numberOfMovies) AS averageRevenue ORDER BY averageRevenue DESC RETURN a.name, averageRevenue LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29846,neo4jlabs_demo_db_recommendations
List the `sar_id`s of filings where the `originator_bank` is located in a country with a `name` that contains more than two words.,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE size(split(c.name, ' ')) > 2 RETURN f.sar_id",neo4jLabs_synthetic_gemini,instance_id_28329,neo4jlabs_demo_db_fincen
List the first 3 genres where the most movies have been produced.,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WITH g, count(m) AS movie_count ORDER BY movie_count DESC LIMIT 3 RETURN g.name AS genre, movie_count",neo4jLabs_synthetic_gpt4o,instance_id_39741,neo4jlabs_demo_db_eoflix
"Which Entities have a ""same_name_as"" relationship with another Entity and are both linked to an Address located in the same ""countries"" as their ""jurisdiction_description""?","MATCH (e1:Entity)-[:same_name_as]-(e2:Entity) WHERE EXISTS((e1)-[:registered_address]->(:Address {countries: e1.jurisdiction_description}))   AND EXISTS((e2)-[:registered_address]->(:Address {countries: e2.jurisdiction_description})) RETURN e1.name, e2.name",neo4jLabs_synthetic_gemini,instance_id_31403,neo4jlabs_demo_db_offshoreleaks
"What is the name of the movie with the lowest IMDb rating that has the genre ""Comedy""?","MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Comedy'}) RETURN m.title, m.imdbRating ORDER BY m.imdbRating ASC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29665,neo4jlabs_demo_db_recommendations
Find all adult movies that have been released.,MATCH (a:Adult {status: 'Released'}) RETURN a,neo4jLabs_synthetic_gpt4turbo,instance_id_23578,neo4jlabs_demo_db_eoflix
Show the top 3 actors who have acted in movies that generated over 500 million in revenue.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.revenue > 500000000 RETURN a.name, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42749,neo4jlabs_demo_db_recommendations
List the taglines of movies released between 1995 and 2005 with a rating higher than 85.,MATCH (m:Movie)<-[r:REVIEWED]-() WHERE r.rating > 85 AND m.released >= 1995 AND m.released <= 2005 RETURN m.tagline,neo4jLabs_synthetic_gemini,instance_id_33030,neo4jlabs_demo_db_movies
"""영화 'Matrix'에 출연한 배우는 누구야?""",MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.title = 'Matrix' RETURN p.name,neo4j_crowdsourced,instance_id_27595,neo4jlabs_demo_db_movies
"Find the streams that have a description that contains the word ""gameplay"".",MATCH (s:Stream) WHERE s.description CONTAINS 'gameplay' RETURN s,neo4jLabs_synthetic_gemini,instance_id_34179,neo4jlabs_demo_db_twitch
What are the names of the top 5 entities that originated the most filings?,"MATCH (e:Entity)-[:ORIGINATOR]->(f:Filing) WITH e, count(f) AS filingsCount ORDER BY filingsCount DESC LIMIT 5 RETURN e.name AS EntityName, filingsCount",neo4jLabs_synthetic_gpt4turbo,instance_id_21537,neo4jlabs_demo_db_fincen
Identify all applications running on machines that are of type 'xl'.,"MATCH (m:Machine)-[:TYPE]->(t:Type {type: 'xl'}) MATCH (m)-[:RUNS]->(a:Application) RETURN m.name AS MachineName, a.name AS ApplicationName",neo4jLabs_synthetic_gpt4turbo,instance_id_20540,neo4jlabs_demo_db_network
What is the total number of filings for each distinct year present in the data?,"MATCH (f:Filing) WITH date(f.begin).year AS year, count(f) AS filingCount RETURN year, filingCount ORDER BY year",neo4jLabs_synthetic_gemini,instance_id_29126,neo4jlabs_demo_db_fincen
What are the names of the first 3 Types with a RAM size less than 64?,MATCH (t:Type) WHERE t.ram < 64 RETURN t.name ORDER BY t.ram ASC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20114,neo4jlabs_demo_db_network
List all switches in rack 1.,MATCH (r:Rack {name: 'DC1-RCK-1-1'})-[:HOLDS]->(s:Switch) RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_20936,neo4jlabs_demo_db_network
Identify the top 5 countries by the number of filings where the beneficiary bank is located.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country) RETURN c.name AS Country, count(f) AS NumberOfFilings ORDER BY NumberOfFilings DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_26777,neo4jlabs_demo_db_fincen
Identify movies released in 'December' that have a genre of 'Horror'.,MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Horror'}) WHERE m.released STARTS WITH 'December' RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_25269,neo4jlabs_demo_db_recommendations
List the movies released in the 1990s with an IMDB rating above 8.0.,MATCH (m:Movie) WHERE m.year >= 1990 AND m.year <= 1999 AND m.imdbRating > 8.0 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_29863,neo4jlabs_demo_db_recommendations
Show the top 5 genres of movies that have a runtime of exactly 90 minutes.,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WHERE m.runtime = 90 RETURN g.name AS genre, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_42506,neo4jlabs_demo_db_recommendations
List the most recent 3 applications started in DataCenter 'DC1'.,"MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(:Rack)-[:HOLDS]->(:Machine)-[:RUNS]->(app:Application) RETURN app.name, app.startTime ORDER BY app.startTime DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43749,neo4jlabs_demo_db_network
List the top 5 orders with the highest freight cost.,"MATCH (o:Order) RETURN o.orderID, o.freight ORDER BY toFloat(o.freight) DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44565,neo4jlabs_demo_db_northwind
Which streams have more than two team associations?,"MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WITH s, COUNT(t) AS teamCount WHERE teamCount > 2 RETURN s.name AS streamName, teamCount",neo4jLabs_synthetic_gpt4o,instance_id_43420,neo4jlabs_demo_db_twitch
Name 3 movies that have been keyword-tagged with 'based on novel'.,MATCH (k:Keyword {name: 'based on novel'})<-[:HAS_KEYWORD]-(m:Movie) RETURN m.title LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_44257,neo4jlabs_demo_db_eoflix
List all genres associated with movies that have a runtime less than 80 minutes.,MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WHERE m.runtime < 80 RETURN DISTINCT g.name AS genre,neo4jLabs_synthetic_gpt4o,instance_id_42006,neo4jlabs_demo_db_recommendations
List the first 3 tweets by 'Me' that contain a link.,MATCH (me:Me)-[:POSTS]->(tweet:Tweet)-[:CONTAINS]->(link:Link) RETURN tweet ORDER BY tweet.created_at ASC LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_42887,neo4jlabs_demo_db_twitter
What is the name of the Service that has the most incoming connections from other Services?,"MATCH (service:Service)-[:INSTANCE]->(:Service)<-[:INSTANCE]-(incoming:Service) WITH service, count(DISTINCT incoming) AS incoming_count ORDER BY incoming_count DESC RETURN service.name AS service_name, incoming_count LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32470,neo4jlabs_demo_db_network
List the first 3 games played by streams with the most moderators.,"MATCH (s:Stream)-[:MODERATOR]->(u:User) WITH s, COUNT(u) AS moderatorCount ORDER BY moderatorCount DESC LIMIT 3 MATCH (s)-[:PLAYS]->(g:Game) RETURN g.name AS gameName LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43435,neo4jlabs_demo_db_twitch
List the top 3 videos that have the most votes.,"MATCH (v:Video) RETURN v.title, v.vote_count ORDER BY v.vote_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21063,neo4jlabs_demo_db_eoflix
List the first 3 directors who have also acted in movies.,"MATCH (d:Director)-[:ACTED_IN]->(m:Movie) RETURN d.name, collect(m.title) AS movies LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25014,neo4jlabs_demo_db_recommendations
Which 3 movies have been rated highest by users?,"MATCH (u:User)-[r:RATED]->(m:Movie) RETURN m.title, avg(r.rating) AS average_rating ORDER BY average_rating DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21099,neo4jlabs_demo_db_eoflix
Which users have mentioned 'Neo4j' in their tweets and have a following of more than 20000? Show the top 5.,"MATCH (u:User)-[:POSTS]->(t:Tweet)-[:MENTIONS]->(m:Me {screen_name: 'neo4j'}) WHERE u.following > 20000 RETURN u.screen_name, u.following ORDER BY u.following DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43097,neo4jlabs_demo_db_twitter
What is the total revenue of all movies in the database?,MATCH (m:Movie) WITH sum(m.revenue) AS totalRevenue RETURN totalRevenue,neo4jLabs_synthetic_gemini,instance_id_29825,neo4jlabs_demo_db_recommendations
List the first 3 movies where the budget was over 50 million USD.,MATCH (m:Movie) WHERE m.budget > 50000000 RETURN m ORDER BY m.id LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21106,neo4jlabs_demo_db_eoflix
What is the total number of interfaces that are being routed by the zone with IP '10.1'?,MATCH (z:Zone { ip: '10.1' })-[:ROUTES]->(i:Interface) RETURN count(i) AS totalInterfaces,neo4jLabs_synthetic_gemini,instance_id_32379,neo4jlabs_demo_db_network
Which 5 countries have the most filings involving transactions above $10 million?,"MATCH (f:Filing)-[:BENEFITS|:CONCERNS|:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE f.amount > 10000000 RETURN c.name AS country, COUNT(f) AS filings_count ORDER BY filings_count DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41399,neo4jlabs_demo_db_fincen
List all movies directed by someone who was born after 1970.,"MATCH (d:Director)-[:DIRECTED]->(m:Movie) WHERE d.born > date('1970-01-01') RETURN m.title AS MovieTitle, d.name AS DirectorName",neo4jLabs_synthetic_gpt4o,instance_id_42627,neo4jlabs_demo_db_recommendations
Find the movie with the highest number of actors who have also written a movie.,"MATCH (m:Movie)<-[:ACTED_IN]-(a:Person)-[:WROTE]->(:Movie) WITH m, count(DISTINCT a) AS writer_actor_count RETURN m.title, writer_actor_count ORDER BY writer_actor_count DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32813,neo4jlabs_demo_db_movies
What is the total 'quantity' of each product ordered?,"MATCH (o:Order)-[r:ORDERS]->(p:Product) WITH p.productID AS productID, sum(toInteger(r.quantity)) AS totalQuantity RETURN productID, totalQuantity",neo4jLabs_synthetic_gemini,instance_id_32320,neo4jlabs_demo_db_northwind
List the top 5 products with a unit price between $10 and $50.,"MATCH (p:Product) WHERE p.unitPrice >= 10 AND p.unitPrice <= 50 RETURN p.productName, p.unitPrice ORDER BY p.unitPrice DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21721,neo4jlabs_demo_db_northwind
What is the valid_until date for the relationship connecting two Officers with the same ID?,MATCH (:Officer)-[r:same_id_as]->(:Officer) RETURN r.valid_until,neo4jLabs_synthetic_gemini,instance_id_31361,neo4jlabs_demo_db_offshoreleaks
List the actors who have acted in more than 5 movies.,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WITH p, count(m) AS movieCount WHERE movieCount > 5 RETURN p.name",neo4jLabs_synthetic_gemini,instance_id_32871,neo4jlabs_demo_db_movies
What is the total 'amount' of filings originated by entities located in countries with 'tld' equal to 'US'?,MATCH (c:Country {tld: 'US'}) WITH c MATCH (c)<-[:COUNTRY]-(e:Entity) WITH e MATCH (e)-[:ORIGINATOR]->(f:Filing) WITH sum(f.amount) AS total_amount RETURN total_amount,neo4jLabs_synthetic_gemini,instance_id_29117,neo4jlabs_demo_db_fincen
List the first 3 links contained in tweets posted by 'Neo4j'.,MATCH (u:User {name: 'Neo4j'})-[:POSTS]->(t:Tweet)-[:CONTAINS]->(l:Link) RETURN l.url LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24358,neo4jlabs_demo_db_twitter
What are the names of the movies that have a runtime greater than 200 minutes?,MATCH (m:Movie) WHERE m.runtime > 200 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_29645,neo4jlabs_demo_db_recommendations
List all entities that have a jurisdiction of Samoa.,"MATCH (e:Entity) WHERE e.jurisdiction = 'SAM' RETURN e.name AS entity_name, e.jurisdiction_description AS jurisdiction_description",neo4jLabs_synthetic_gpt4o,instance_id_44882,neo4jlabs_demo_db_offshoreleaks
List the top 3 movies with the highest vote count that belong to the 'Comedy' genre.,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Comedy'}) WITH m ORDER BY m.vote_count DESC RETURN m.title, m.vote_count LIMIT 3",neo4jLabs_synthetic_gemini,instance_id_31861,neo4jlabs_demo_db_eoflix
Which 3 adult videos have the longest runtime?,"MATCH (a:Adult) RETURN a.title, a.runtime ORDER BY a.runtime DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23190,neo4jlabs_demo_db_eoflix
What are the top 3 largest types by disk size available in the system?,"MATCH (t:Type) RETURN t.name, t.disk ORDER BY t.disk DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20521,neo4jlabs_demo_db_network
Find all products that are part of more than one order.,"MATCH (p:Product)-[r:ORDERS]->(o:Order) WITH p, count(o) AS ordersCount WHERE ordersCount > 1 RETURN p",neo4jLabs_synthetic_gpt4turbo,instance_id_21753,neo4jlabs_demo_db_northwind
What is the average number of roles played by actors in movies released before 1990?,"MATCH (m:Movie)<-[ai:ACTED_IN]-(p:Person) WHERE m.released < 1990 WITH p, size(ai.roles) AS roles_count RETURN avg(roles_count) AS average_roles",neo4jLabs_synthetic_gemini,instance_id_32975,neo4jlabs_demo_db_movies
List all Switches in racks with zone 3.,MATCH (r:Rack {zone: 3})-[:HOLDS]->(s:Switch) RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_20892,neo4jlabs_demo_db_network
What is the average `reorderLevel` for products in the 'Confections' category?,MATCH (c:Category {categoryName: 'Confections'})-[:PART_OF]->(p:Product) RETURN avg(p.reorderLevel) AS averageReorderLevel,neo4jLabs_synthetic_gemini,instance_id_32206,neo4jlabs_demo_db_northwind
What are the names of the top 3 products with the highest units on order?,"MATCH (p:Product) WHERE p.unitsOnOrder IS NOT NULL RETURN p.productName AS ProductName, p.unitsOnOrder AS UnitsOnOrder ORDER BY p.unitsOnOrder DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20443,neo4jlabs_demo_db_northwind
How many entities have a valid_until date that includes the phrase 'Panama Papers'?,MATCH (e:Entity) WHERE e.valid_until CONTAINS 'Panama Papers' RETURN count(e),neo4jLabs_synthetic_gemini,instance_id_30588,neo4jlabs_demo_db_offshoreleaks
Identify the top 5 users who have a following between 5000 and 15000 and follow 'Neo4j'.,MATCH (u:User)-[:FOLLOWS]->(n:User {name: 'Neo4j'}) WHERE u.following >= 5000 AND u.following <= 15000 RETURN u ORDER BY u.following DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24819,neo4jlabs_demo_db_twitter
"Find all Addresses that are linked to both an Entity and an Intermediary that have different ""lastEditTimestamp"" values.",MATCH (e:Entity)-[r1:registered_address]->(a:Address) MATCH (i:Intermediary)-[r2:registered_address]->(a:Address) WHERE e.lastEditTimestamp <> i.lastEditTimestamp RETURN DISTINCT a,neo4jLabs_synthetic_gemini,instance_id_31351,neo4jlabs_demo_db_offshoreleaks
List the top 3 streams with the lowest followers to total view count ratio.,"MATCH (s:Stream) WITH s, (toFloat(s.followers) / s.total_view_count) AS ratio ORDER BY ratio ASC LIMIT 3 RETURN s.name, ratio",neo4jLabs_synthetic_gemini,instance_id_33994,neo4jlabs_demo_db_twitch
"What are the dependencies of the application ""logstash""?",MATCH (app:Application {name: 'logstash'})-[:DEPENDS_ON]->(dependency) RETURN dependency.name AS dependency_name,neo4jLabs_synthetic_gemini,instance_id_31610,neo4jlabs_demo_db_network
Which entities are registered at addresses in 'Samoa'?,"MATCH (e:Entity)-[:registered_address]->(a:Address) WHERE a.countries = 'Samoa' RETURN e.name AS entity_name, a.address AS registered_address",neo4jLabs_synthetic_gpt4o,instance_id_44924,neo4jlabs_demo_db_offshoreleaks
What is the average popularity score of movies in the database?,MATCH (m:Movie) WITH avg(m.popularity) AS average_popularity RETURN average_popularity,neo4jLabs_synthetic_gemini,instance_id_34404,neo4jlabs_demo_db_eoflix
List the names of the users who are both moderators and VIPs of the same stream.,MATCH (u:User)-[:MODERATOR]->(s:Stream)<-[:VIP]-(u) WITH DISTINCT u RETURN u.name,neo4jLabs_synthetic_gemini,instance_id_33949,neo4jlabs_demo_db_twitch
List the names of the top 5 tweets that reply to another tweet and have more than 50 favorites.,MATCH (t:Tweet)-[:REPLY_TO]->(:Tweet) WHERE t.favorites > 50 RETURN t.text AS TweetName ORDER BY t.favorites DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24193,neo4jlabs_demo_db_twitter
"What is the most common language spoken in the movies directed by ""Tom Hanks""?","MATCH (p:Person {name: ""Tom Hanks""})-[:CREW_FOR {job: ""Director""}]->(m:Movie) WITH m, collect(m) AS movies UNWIND movies AS movie MATCH (movie)-[:SPOKEN_IN_LANGUAGE]->(l:Language) WITH l, count(DISTINCT movie) AS movieCount ORDER BY movieCount DESC RETURN l.name AS language, movieCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_31913,neo4jlabs_demo_db_eoflix
What are the names of the top 5 oldest teams in the graph?,MATCH (t:Team) RETURN t.name ORDER BY t.createdAt ASC LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_42946,neo4jlabs_demo_db_twitch
Which movies have been filmed in more than 5 countries?,MATCH (m:Movie) WHERE size(m.countries) > 5 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_29675,neo4jlabs_demo_db_recommendations
Which Routers are connected to Interfaces in zone 4?,"MATCH (r:Router)-[:ROUTES]->(i:Interface) WHERE r.zone = 4 RETURN r.name, i.ip",neo4jLabs_synthetic_gpt4turbo,instance_id_20120,neo4jlabs_demo_db_network
List the first 3 country codes associated with Addresses.,MATCH (a:Address) WITH DISTINCT a.country_codes AS country_code RETURN country_code LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_30667,neo4jlabs_demo_db_offshoreleaks
Which ports are listened by all instances of the application 'webserver'?,MATCH (app:Application {name: 'webserver'})-[:INSTANCE]->(service:Service)-[:LISTENS]->(port:Port) RETURN DISTINCT port.port,neo4jLabs_synthetic_gpt4turbo,instance_id_20136,neo4jlabs_demo_db_network
List the first 3 tweets that include a link to 'https://twitter.com' and were favorited more than 100 times.,MATCH (t:Tweet)-[:CONTAINS]->(l:Link) WHERE l.url STARTS WITH 'https://twitter.com' AND t.favorites > 100 RETURN t ORDER BY t.created_at LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43113,neo4jlabs_demo_db_twitter
Which users follow 'Neo4j' and have tweeted more than 500 times? Show the first 3.,"MATCH (u:User)-[:FOLLOWS]->(m:Me {screen_name: 'neo4j'}) WHERE u.statuses > 500 RETURN u.name, u.screen_name, u.statuses LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43120,neo4jlabs_demo_db_twitter
"""Which entities have the most intermediary connections, and what are the common countries of origin for these intermediaries?""","MATCH (i:Intermediary)-[:intermediary_of]->(e:Entity) WITH e, COUNT(i) AS num_intermediaries, COLLECT(i.countries) AS countries ORDER BY num_intermediaries DESC RETURN e.name, num_intermediaries, countries LIMIT 1",neo4j_crowdsourced,instance_id_27368,neo4jlabs_demo_db_offshoreleaks
List the first 3 movies with the most different directors involved.,"MATCH (d:Director)-[:DIRECTED]->(m:Movie) WITH m, count(DISTINCT d) AS numDirectors ORDER BY numDirectors DESC RETURN m.title, numDirectors LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_25249,neo4jlabs_demo_db_recommendations
Display products with 'unitPrice' higher than the average unit price of their category.,"MATCH (p:Product)-[:PART_OF]->(c:Category) WITH c, AVG(p.unitPrice) AS avgPrice MATCH (p2:Product)-[:PART_OF]->(c) WHERE p2.unitPrice > avgPrice RETURN p2.productName, p2.unitPrice, c.categoryName, avgPrice",neo4jLabs_synthetic_gpt4turbo,instance_id_21774,neo4jlabs_demo_db_northwind
Which director has the highest number of movies with a cult following?,"MATCH (m:Movie)<-[:DIRECTED]-(d:Director) WHERE m.imdbVotes > 100000 WITH d, count(m) AS movieCount ORDER BY movieCount DESC RETURN d.name AS director, movieCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29504,neo4jlabs_demo_db_recommendations
What is the description of the stream that has the most moderators?,"MATCH (s:Stream)-[:MODERATOR]->(m) WITH s, count(m) AS moderatorCount ORDER BY moderatorCount DESC LIMIT 1 RETURN s.description",neo4jLabs_synthetic_gemini,instance_id_33890,neo4jlabs_demo_db_twitch
List the top 3 Versions used by the Software 'RHEL'.,"MATCH (s:Software {name: 'RHEL'})-[:VERSION]->(v:Version) RETURN v.name AS version, COUNT(*) AS usage_count ORDER BY usage_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44088,neo4jlabs_demo_db_network
Identify the first 3 users who are VIPs in streams with a name containing 'big'.,MATCH (s:Stream)-[:VIP]->(u:User) WHERE s.name CONTAINS 'big' RETURN u.name LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_42922,neo4jlabs_demo_db_twitch
Identify all applications that listen on port 80.,MATCH (app:Application)-[:LISTENS]->(port:Port {port: 80}) RETURN app.name,neo4jLabs_synthetic_gpt4o,instance_id_43908,neo4jlabs_demo_db_network
List the names of teams that have been involved with streams that play 'Just Chatting' and have total views over 1 million.,MATCH (s:Stream)-[:PLAYS]->(g:Game {name: 'Just Chatting'}) WHERE s.total_view_count > 1000000 MATCH (s)-[:HAS_TEAM]->(t:Team) RETURN DISTINCT t.name,neo4jLabs_synthetic_gpt4turbo,instance_id_25524,neo4jlabs_demo_db_twitch
List the first 3 videos with no budget reported.,MATCH (v:Video) WHERE v.budget IS NULL RETURN v LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21013,neo4jlabs_demo_db_eoflix
Which officers are connected to entities incorporated before 2000?,"MATCH (o:Officer)-[:connected_to]->(e:Entity) WHERE e.incorporation_date < ""01-JAN-2000"" RETURN o.name AS officer_name, e.name AS entity_name, e.incorporation_date AS incorporation_date",neo4jLabs_synthetic_gpt4o,instance_id_44870,neo4jlabs_demo_db_offshoreleaks
"""MATCH (p:Person)-[r:ACTED_IN]-(m:Movie)     WHERE m.released > 2010     RETURN p,r,m""","MATCH (p:Person)-[r:ACTED_IN]->(m:Movie) WHERE m.released > 2010 RETURN p, r, m",neo4j_crowdsourced,instance_id_27750,neo4jlabs_demo_db_movies
Show officers who have a country code of KOR.,MATCH (o:Officer {country_codes: 'KOR'}) RETURN o,neo4jLabs_synthetic_gpt4turbo,instance_id_21181,neo4jlabs_demo_db_offshoreleaks
Name the first 5 people who acted in a movie with a tagline mentioning 'Real World'.,MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.tagline CONTAINS 'Real World' RETURN p.name LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23749,neo4jlabs_demo_db_movies
Find all applications that have a dependency on a process that listens on port 80.,MATCH (app:Application)-[:DEPENDS_ON]->(process:Process)-[:LISTENS]->(port:Port {port: 80}) RETURN app.name AS application_name,neo4jLabs_synthetic_gemini,instance_id_31716,neo4jlabs_demo_db_network
