question,cypher,data_source,instance_id,database_reference_alias
"List the intermediary names that have the same address as 'MICHAEL PAPAGEORGE, MR.'","MATCH (i1:Intermediary {name: 'MICHAEL PAPAGEORGE, MR.'})-[:registered_address]->(a:Address) MATCH (i2:Intermediary)-[:registered_address]->(a) RETURN DISTINCT i2.name AS IntermediaryName",neo4jLabs_synthetic_gpt4turbo,instance_id_21952,neo4jlabs_demo_db_offshoreleaks
List the top 3 most controversial adult films based on their overview.,"MATCH (a:Adult) WHERE a.overview IS NOT NULL RETURN a.title, a.overview ORDER BY a.vote_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23457,neo4jlabs_demo_db_eoflix
"List the usernames of users who are moderators of streams with over 1,000,000 followers.",MATCH (u:User)-[:MODERATOR]->(s:Stream) WHERE s.followers > 1000000 RETURN DISTINCT u.name,neo4jLabs_synthetic_gemini,instance_id_33955,neo4jlabs_demo_db_twitch
"""Which actor pairs were the most popular with directors?""","MATCH (p1:Person)-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(d:Person), (p2:Person)-[:ACTED_IN]->(m) WHERE p1 <> p2 RETURN p1.name, p2.name, count(DISTINCT d) AS directorCount ORDER BY directorCount DESC",neo4j_crowdsourced,instance_id_27499,neo4jlabs_demo_db_movies
List the first 3 users who follow 'neo4j' and have been mentioned in tweets by 'neo4j'.,MATCH (neo4j:User {screen_name: 'neo4j'})-[:FOLLOWS]->(follower:User) WHERE exists {     MATCH (neo4j)-[:POSTS]->(:Tweet)-[:MENTIONS]->(follower) } RETURN follower LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24207,neo4jlabs_demo_db_twitter
Which 3 products have the lowest unit price in the category 'Beverages'?,"MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Beverages'}) RETURN p.productName, p.unitPrice ORDER BY p.unitPrice ASC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21857,neo4jlabs_demo_db_northwind
Show the first 3 orders for the product 'Chai'.,MATCH (p:Product {productName: 'Chai'})-[:ORDERS]->(o:Order) RETURN o ORDER BY o.orderDate LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_21889,neo4jlabs_demo_db_northwind
"Find the streams that have a moderator who also moderates a stream with the language ""ru"" and has more than 5,000 followers and have the language ""en"".","MATCH (stream1:Stream)-[:HAS_LANGUAGE]->(language1:Language {name: ""en""}) MATCH (stream1)<-[:MODERATOR]-(moderator:User) MATCH (moderator)-[:MODERATOR]->(stream2:Stream)-[:HAS_LANGUAGE]->(language2:Language {name: ""ru""}) WHERE moderator.followers > 5000 RETURN DISTINCT stream1",neo4jLabs_synthetic_gemini,instance_id_33751,neo4jlabs_demo_db_twitch
"List the first 3 adult films with a specific tagline, e.g., 'Trust Will Get You Killed'.","MATCH (a:Adult {tagline: 'Trust Will Get You Killed'}) RETURN a.title, a.release_date, a.tagline ORDER BY a.release_date LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_39395,neo4jlabs_demo_db_eoflix
Find the top 5 products that are part of the 'Confections' category.,"MATCH (p:Product)-[:PART_OF]->(c:Category {categoryName: 'Confections'}) RETURN p.productName, p.unitPrice ORDER BY p.unitPrice DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_22042,neo4jlabs_demo_db_northwind
Which production company has the highest average gross profit for its movies?,"MATCH (m:Movie)-[:PRODUCED_BY]->(pc:ProductionCompany) WITH pc, m.revenue - m.budget AS grossProfit WITH pc, avg(grossProfit) AS averageGrossProfit ORDER BY averageGrossProfit DESC RETURN pc.name AS productionCompanyName, averageGrossProfit LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32024,neo4jlabs_demo_db_eoflix
"""What is the average imdb rating of movies published in 2020?""",MATCH (m:Movie) WHERE m.year = 2020 RETURN AVG(m.imdbRating) AS averageRating,neo4j_crowdsourced,instance_id_27934,neo4jlabs_demo_db_recommendations
List the top 3 people with the most crew roles in movies.,"MATCH (p:Person)-[r:CREW_FOR]->(m:Movie) WITH p, count(r) AS crew_roles ORDER BY crew_roles DESC LIMIT 3 RETURN p.name AS person_name, crew_roles",neo4jLabs_synthetic_gpt4o,instance_id_39694,neo4jlabs_demo_db_eoflix
What is the total revenue generated by orders shipped in the month of June 1997?,"MATCH (o:Order)-[rel:ORDERS]->(p:Product) WHERE o.shippedDate STARTS WITH '1997-06' WITH o, toFloat(rel.unitPrice) * rel.quantity AS revenue RETURN sum(revenue) AS totalRevenue",neo4jLabs_synthetic_gemini,instance_id_32172,neo4jlabs_demo_db_northwind
"What is the location of the country with code ""CHN""?","MATCH (c:Country {code: ""CHN""}) RETURN c.location",neo4jLabs_synthetic_gemini,instance_id_28175,neo4jlabs_demo_db_fincen
What are the names of teams associated with streams created before 2018?,MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WHERE s.createdAt < datetime('2018-01-01T00:00:00Z') RETURN DISTINCT t.name,neo4jLabs_synthetic_gpt4turbo,instance_id_24373,neo4jlabs_demo_db_twitch
"""Which actor worked with the same actor who played Ron Burgundy?""","MATCH (actor:Person)-[:ACTED_IN]->(m:Movie)<-[:ACTED_IN]-(ronActor:Person {name: ""Ron Burgundy""}) WITH actor, ronActor MATCH (actor)-[:ACTED_IN]->(:Movie)<-[:ACTED_IN]-(coActor:Person) WHERE coActor = ronActor RETURN DISTINCT actor.name",neo4j_crowdsourced,instance_id_27855,neo4jlabs_demo_db_movies
What are the first 3 filings with the most number of concerns?,"MATCH (f:Filing) WITH f, count{(f)-[:CONCERNS]->(:Entity)} AS concernsCount ORDER BY concernsCount DESC LIMIT 3 RETURN f",neo4jLabs_synthetic_gpt4turbo,instance_id_21619,neo4jlabs_demo_db_fincen
List the first 3 movies that have a poster path ending in '.jpg'.,MATCH (m:Movie) WHERE m.poster_path ENDS WITH '.jpg' RETURN m LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23429,neo4jlabs_demo_db_eoflix
Which products have a reorder level of exactly 10?,"MATCH (p:Product) WHERE p.reorderLevel = 10 RETURN p.productName AS productName, p.reorderLevel AS reorderLevel",neo4jLabs_synthetic_gpt4o,instance_id_45082,neo4jlabs_demo_db_northwind
"List the filings where the originator bank country is 'Singapore' and the end_date is 'Sep 25, 2015'.","MATCH (f:Filing) WHERE f.originator_bank_country = 'Singapore' AND f.end_date = 'Sep 25, 2015' RETURN f",neo4jLabs_synthetic_gpt4turbo,instance_id_22839,neo4jlabs_demo_db_fincen
Find the actors who have starred in movies with a runtime shorter than their age.,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WITH a, m,  m.year - date(a.born).year  AS age, m.runtime AS runtime WHERE runtime < age RETURN DISTINCT a.name",neo4jLabs_synthetic_gemini,instance_id_29778,neo4jlabs_demo_db_recommendations
Which officers have been involved with entities since 1999?,"MATCH (o:Officer)-[r:officer_of]->(e:Entity) WHERE r.start_date >= '1999-01-01' RETURN o.name AS OfficerName, e.name AS EntityName, r.start_date AS StartDate",neo4jLabs_synthetic_gpt4turbo,instance_id_21328,neo4jlabs_demo_db_offshoreleaks
Find streams that have VIP relationships with more than three users.,"MATCH (s:Stream)-[:VIP]->(u:User) WITH s, count(u) AS vipCount WHERE vipCount > 3 RETURN s",neo4jLabs_synthetic_gpt4turbo,instance_id_24462,neo4jlabs_demo_db_twitch
Which movies have a rating higher than 90?,MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE r.rating > 90 RETURN DISTINCT m.title,neo4jLabs_synthetic_gemini,instance_id_32759,neo4jlabs_demo_db_movies
List the first 3 users who interact most frequently with 'Neo4j' based on the INTERACTS_WITH relationship.,"MATCH (me:Me {screen_name: 'neo4j'})-[:INTERACTS_WITH]->(user:User) RETURN user.screen_name, COUNT(*) AS interaction_count ORDER BY interaction_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43209,neo4jlabs_demo_db_twitter
"How many orders have been placed for products with a unit price within a specific range (e.g., between $10 and $20)?",MATCH (p:Product) WHERE p.unitPrice >= 10 AND p.unitPrice <= 20 WITH DISTINCT p MATCH (p)-[:ORDERS]->(order:Order) RETURN count(DISTINCT order) AS orderCount,neo4jLabs_synthetic_gemini,instance_id_30767,neo4jlabs_demo_db_northwind
List the registered addresses for entities that were incorporated in March 2006.,"MATCH (e:Entity)-[:registered_address]->(a:Address) WHERE e.incorporation_date STARTS WITH '23-MAR-2006' RETURN e.name AS entity_name, a.address AS registered_address",neo4jLabs_synthetic_gpt4o,instance_id_44762,neo4jlabs_demo_db_offshoreleaks
Who are the first 5 moderators for the stream with the highest total view count?,"MATCH (s:Stream)-[:MODERATOR]->(u:User) WITH s, u ORDER BY s.total_view_count DESC LIMIT 1 MATCH (s)-[:MODERATOR]->(moderator:User) RETURN moderator.name LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43287,neo4jlabs_demo_db_twitch
List the filings where the amount is greater than 100000 and the originator entity is located in the same country as the beneficiary entity.,MATCH (f:Filing) WHERE f.amount > 100000 MATCH (f)-[:ORIGINATOR]->(o:Entity)-[:COUNTRY]->(c:Country) MATCH (f)-[:BENEFITS]->(b:Entity)-[:COUNTRY]->(c) RETURN f.id,neo4jLabs_synthetic_gemini,instance_id_28092,neo4jlabs_demo_db_fincen
"""What are the ages of the actors in the movie with a title containing the word \""mail\""""","MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.title CONTAINS ""mail"" RETURN p.name AS ActorName, (date().year - p.born) AS ActorAge",neo4j_crowdsourced,instance_id_27634,neo4jlabs_demo_db_movies
"What is the incorporation date of the Entity with internal ID ""1000914""?","MATCH (e:Entity {internal_id: ""1000914""}) RETURN e.incorporation_date",neo4jLabs_synthetic_gemini,instance_id_30681,neo4jlabs_demo_db_offshoreleaks
List the top 5 countries where the most adult films have been produced.,"MATCH (a:Adult)-[:PRODUCED_IN_COUNTRY]->(c:Country) RETURN c.name AS Country, count(a) AS NumberOfAdultFilms ORDER BY NumberOfAdultFilms DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23227,neo4jlabs_demo_db_eoflix
What is the contact name of the supplier with supplierID '1'?,MATCH (s:Supplier { supplierID: '1' }) RETURN s.contactName,neo4jLabs_synthetic_gemini,instance_id_30856,neo4jlabs_demo_db_northwind
What is the total box office revenue of movies starring Leonardo DiCaprio?,"MATCH (p:Person {name: ""Leonardo DiCaprio""})-[:CAST_FOR]->(m:Movie) WITH sum(m.revenue) AS totalRevenue RETURN totalRevenue",neo4jLabs_synthetic_gemini,instance_id_34213,neo4jlabs_demo_db_eoflix
What is the name of the movie with the longest title in the database?,MATCH (m:Movie) RETURN m.title ORDER BY size(m.title) DESC LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_32023,neo4jlabs_demo_db_eoflix
List the first 3 movies that were both written and reviewed by the same person.,"MATCH (p:Person)-[:WROTE]->(m:Movie)<-[:REVIEWED]-(p) RETURN m.title AS MovieTitle, m.released AS ReleaseYear, p.name AS PersonName LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23944,neo4jlabs_demo_db_movies
How many streams have a description containing the word 'strategy'?,MATCH (s:Stream) WHERE s.description CONTAINS 'strategy' RETURN count(s) AS numberOfStreams,neo4jLabs_synthetic_gpt4o,instance_id_43635,neo4jlabs_demo_db_twitch
"List the streams that have VIP users with less than 10,000 followers.",MATCH (s:Stream)-[:VIP]->(u:User) WHERE u.followers < 10000 RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_25635,neo4jlabs_demo_db_twitch
"What is the runtime of the movie ""Boxtrolls, The""?","MATCH (m:Movie {title: 'Boxtrolls, The'}) RETURN m.runtime",neo4jLabs_synthetic_gemini,instance_id_29727,neo4jlabs_demo_db_recommendations
List the 3 suppliers who supply the most products that have been discontinued.,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product) WHERE p.discontinued = true WITH s, COUNT(p) AS discontinuedProducts ORDER BY discontinuedProducts DESC LIMIT 3 RETURN s.companyName AS Supplier, discontinuedProducts",neo4jLabs_synthetic_gpt4o,instance_id_44616,neo4jlabs_demo_db_northwind
Who are the top 3 users that have interacted the most with 'Neo4j'?,"MATCH (me:Me {screen_name: 'neo4j'})-[:INTERACTS_WITH]->(user:User) RETURN user.screen_name, COUNT(*) AS interactions ORDER BY interactions DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43128,neo4jlabs_demo_db_twitter
Name the first 3 people born before 1970 who produced a movie released after 2000.,MATCH (p:Person)-[:PRODUCED]->(m:Movie) WHERE p.born < 1970 AND m.released > 2000 RETURN p.name ORDER BY p.born LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_39914,neo4jlabs_demo_db_movies
List the top 10 beneficiary banks with the highest average amount received from filings.,"MATCH (filing:Filing)-[:BENEFITS]->(beneficiary:Entity) WITH beneficiary.name AS beneficiaryName, avg(filing.amount) AS averageAmount ORDER BY averageAmount DESC LIMIT 10 RETURN beneficiaryName, averageAmount",neo4jLabs_synthetic_gemini,instance_id_29029,neo4jlabs_demo_db_fincen
"List all teams that have at least one stream with more than 50,000 followers and use the Russian language.","MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE s.followers > 50000 AND l.name = ""ru"" WITH DISTINCT s MATCH (s)-[:HAS_TEAM]->(t:Team) RETURN t.name",neo4jLabs_synthetic_gemini,instance_id_33905,neo4jlabs_demo_db_twitch
How many streams are both moderated by and have VIPs who are the same user?,"MATCH (s:Stream)-[:MODERATOR]->(u:User), (s)-[:VIP]->(u) RETURN count(DISTINCT s)",neo4jLabs_synthetic_gemini,instance_id_33713,neo4jlabs_demo_db_twitch
"What is the most common source used by users who have interacted with ""Neo4j""?","MATCH (neo4j:User {screen_name: ""neo4j""})-[:INTERACTS_WITH]->(user:User) MATCH (user)-[:POSTS]->(tweet:Tweet)-[:USING]->(source:Source) WITH source.name AS source_name, count(*) AS source_count ORDER BY source_count DESC RETURN source_name, source_count LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_34697,neo4jlabs_demo_db_twitter
Which categories have products with a unitPrice greater than 50?,MATCH (p:Product)-[:PART_OF]->(c:Category) WHERE p.unitPrice > 50 RETURN DISTINCT c.categoryName,neo4jLabs_synthetic_gpt4o,instance_id_45359,neo4jlabs_demo_db_northwind
What are the names of the top 3 originator banks that have initiated the most filings with a beneficiary in 'USA'?,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity),       (f)-[:BENEFITS]->(b:Entity)-[:COUNTRY]->(c:Country {code: 'USA'}) RETURN e.name AS originator_bank, COUNT(f) AS filings_count ORDER BY filings_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41787,neo4jlabs_demo_db_fincen
What are the names and IPs of all switches in zone 4?,"MATCH (s:Switch)-[:ROUTES]->(i:Interface) MATCH (r:Rack)-[:HOLDS]->(s) WHERE r.zone = 4 RETURN s.name AS switchName, i.ip AS switchIP",neo4jLabs_synthetic_gpt4o,instance_id_43924,neo4jlabs_demo_db_network
Identify the first 5 machines that run the OS 'RHEL' and have a type with RAM greater than 256.,"MATCH (m:Machine)-[:RUNS]->(os:OS {name: 'RHEL'}),       (m)-[:TYPE]->(t:Type) WHERE t.ram > 256 RETURN m LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_20227,neo4jlabs_demo_db_network
Which movies have been directed by a person born in 1970 and what are their titles?,MATCH (p:Person {born: 1970})-[:DIRECTED]->(m:Movie) RETURN m.title AS MovieTitle,neo4jLabs_synthetic_gpt4turbo,instance_id_24101,neo4jlabs_demo_db_movies
Which person has the most relationships of any type in the database?,"MATCH (p:Person) RETURN p, count{(p)--()} AS totalRelationships ORDER BY totalRelationships DESC LIMIT 1",neo4jLabs_synthetic_gpt4turbo,instance_id_24143,neo4jlabs_demo_db_movies
List all products that have been ordered by 'Vins et alcools Chevalier'.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) WHERE c.companyName = 'Vins et alcools Chevalier' RETURN p.productName AS ProductName, p.productID AS ProductID",neo4jLabs_synthetic_gpt4o,instance_id_44567,neo4jlabs_demo_db_northwind
What is the average rating of movies released in the year 2002?,MATCH (m:Movie {released: 2002})<-[r:REVIEWED]-() RETURN avg(r.rating),neo4jLabs_synthetic_gemini,instance_id_34329,neo4jlabs_demo_db_movies
What is the total revenue of movies released by Universal Pictures?,"MATCH (m:Movie) WHERE ""USA"" IN m.countries RETURN sum(m.revenue) AS totalRevenue",neo4jLabs_synthetic_gemini,instance_id_29589,neo4jlabs_demo_db_recommendations
"What is the average total view count for streams that have the language ""ru""?",MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language {name: 'ru'}) WITH avg(s.total_view_count) AS averageViewCount RETURN averageViewCount,neo4jLabs_synthetic_gemini,instance_id_33705,neo4jlabs_demo_db_twitch
Find the names of all directors who were born in France.,"MATCH (d:Director) WHERE d.bornIn = ""France"" RETURN d.name",neo4jLabs_synthetic_gpt4o,instance_id_42442,neo4jlabs_demo_db_recommendations
Identify the top 3 filings with the latest end dates.,MATCH (f:Filing) WITH f ORDER BY f.end DESC LIMIT 3 RETURN f,neo4jLabs_synthetic_gpt4o,instance_id_41300,neo4jlabs_demo_db_fincen
Which countries have entities that are both originators and beneficiaries in filings?,MATCH (originator:Entity)-[:ORIGINATOR]->(f:Filing)-[:BENEFITS]->(beneficiary:Entity) WHERE originator.id = beneficiary.id WITH DISTINCT originator MATCH (originator)-[:COUNTRY]->(c:Country) RETURN c.name AS CountryName,neo4jLabs_synthetic_gpt4turbo,instance_id_22831,neo4jlabs_demo_db_fincen
What is the description of the stream with the most recent creation date?,MATCH (s:Stream) RETURN s.description ORDER BY s.createdAt DESC LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_33700,neo4jlabs_demo_db_twitch
How many streams have a name that is a substring of the stream's description?,MATCH (s:Stream) WHERE s.description CONTAINS s.name RETURN count(*),neo4jLabs_synthetic_gemini,instance_id_34163,neo4jlabs_demo_db_twitch
"What is the average vote for the movie ""Toy Story""?",MATCH (m:Movie {title: 'Toy Story'}) RETURN m.average_vote,neo4jLabs_synthetic_gemini,instance_id_34648,neo4jlabs_demo_db_eoflix
Which 3 countries have the highest average amounts in filings where they are listed as originator?,"MATCH (c:Country)<-[:COUNTRY]-(e:Entity)-[:ORIGINATOR]->(f:Filing) WITH c.name AS country, AVG(f.amount) AS avg_amount RETURN country, avg_amount ORDER BY avg_amount DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21451,neo4jlabs_demo_db_fincen
What is the name of the application that the process with pid 8966 is an instance of?,MATCH (p:Process {pid: 8966})-[:INSTANCE]->(a:Application) RETURN a.name,neo4jLabs_synthetic_gemini,instance_id_31796,neo4jlabs_demo_db_network
What are the titles of the top 5 highest-grossing movies?,MATCH (m:Movie) WITH m ORDER BY m.revenue DESC LIMIT 5 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_29679,neo4jlabs_demo_db_recommendations
List the top 5 streams that have been added to the most teams.,"MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WITH s, count(t) AS teamsCount ORDER BY teamsCount DESC LIMIT 5 RETURN s.id AS StreamID, s.name AS StreamName, teamsCount",neo4jLabs_synthetic_gpt4turbo,instance_id_24546,neo4jlabs_demo_db_twitch
Identify the first 3 Ports exposed by Interface with IP '10.1.1.1'.,MATCH (i:Interface {ip: '10.1.1.1'})-[:EXPOSES]->(p:Port) RETURN p.port LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43803,neo4jlabs_demo_db_network
"How many 'Process' nodes are running on the same 'Machine' as the 'Process' with 'name' ""7.1""?",MATCH (p:Process {name: '7.1'})-[:RUNS]->(m:Machine) WITH m MATCH (m)-[:RUNS]->(allP:Process) RETURN count(allP),neo4jLabs_synthetic_gemini,instance_id_31751,neo4jlabs_demo_db_network
Which applications have dependencies on the service 'java'?,MATCH (app:Application)-[:DEPENDS_ON]->(serv:Service {name: 'java'}) RETURN app.name AS ApplicationName,neo4jLabs_synthetic_gpt4turbo,instance_id_20287,neo4jlabs_demo_db_network
Which language has the most movies associated with it?,"MATCH (movie:Movie)-[:ORIGINAL_LANGUAGE]->(language:Language) WITH language, count(movie) AS movieCount ORDER BY movieCount DESC RETURN language.name, movieCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_31863,neo4jlabs_demo_db_eoflix
Show the 3 streams with the least followers.,"MATCH (s:Stream) RETURN s.name, s.followers ORDER BY s.followers ASC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43625,neo4jlabs_demo_db_twitch
What is the name of the movie with the largest budget that Tom Hanks acted in?,MATCH (p:Person {name: 'Tom Hanks'})-[:CAST_FOR]->(m:Movie) WITH m ORDER BY m.budget DESC RETURN m.title LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_34604,neo4jlabs_demo_db_eoflix
What is the average start time of all services running on machines that also run the application 'webserver'?,MATCH (app:Application {name: 'webserver'})-[:RUNS]->(machine:Machine) WITH machine MATCH (machine)-[:RUNS]->(service:Service) RETURN avg(service.startTime) AS averageStartTime,neo4jLabs_synthetic_gemini,instance_id_31727,neo4jlabs_demo_db_network
Which 3 countries have the most originator banks associated with filings?,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country) RETURN c.name, count(e) AS num_originator_banks ORDER BY num_originator_banks DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21302,neo4jlabs_demo_db_fincen
"List the countries associated with the entity 'HOTFOCUS CO., LTD.'.","MATCH (e:Entity {name: ""HOTFOCUS CO., LTD.""}) RETURN e.countries AS Countries",neo4jLabs_synthetic_gpt4turbo,instance_id_21345,neo4jlabs_demo_db_offshoreleaks
"""Which person follows the most number of other people?""","MATCH (:Person)-[f:FOLLOWS]->(:Person) RETURN f, COUNT(*) AS num ORDER BY num DESC LIMIT 1",neo4j_crowdsourced,instance_id_27684,neo4jlabs_demo_db_movies
Which actor has acted in the most movies with a budget lower than 10 million dollars?,"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) WHERE m.budget < 10000000 WITH a, count(m) AS movieCount RETURN a.name, movieCount ORDER BY movieCount DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29759,neo4jlabs_demo_db_recommendations
"What is the average number of followers for users mentioned in tweets that also mention the user with screen name ""neo4j""?",MATCH (neo:User {screen_name: 'neo4j'}) MATCH (neo)<-[:MENTIONS]-(t:Tweet)<-[:MENTIONS]-(mentioned:User) WHERE neo <> mentioned WITH avg(mentioned.followers) AS average_followers RETURN average_followers,neo4jLabs_synthetic_gemini,instance_id_34706,neo4jlabs_demo_db_twitter
"How many Entities have a struck_off_date before ""01-JAN-2010""?","MATCH (e:Entity) WHERE e.struck_off_date < ""01-JAN-2010"" RETURN count(e)",neo4jLabs_synthetic_gemini,instance_id_30722,neo4jlabs_demo_db_offshoreleaks
Find all people who have directed movies with Keanu Reeves.,"MATCH (kr:Person {name: ""Keanu Reeves""})-[:ACTED_IN]->(movie:Movie)<-[:DIRECTED]-(director:Person) RETURN DISTINCT director.name",neo4jLabs_synthetic_gemini,instance_id_34372,neo4jlabs_demo_db_movies
List the top 5 movies with the lowest imdbVotes.,MATCH (m:Movie) WHERE m.imdbVotes IS NOT NULL RETURN m ORDER BY m.imdbVotes ASC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_25019,neo4jlabs_demo_db_recommendations
What is the average number of years between the release of any two movies directed by the same person?,"MATCH (p:Person)-[:DIRECTED]->(m1:Movie) WITH p, m1 MATCH (p)-[:DIRECTED]->(m2:Movie) WHERE m1 <> m2 WITH p, abs(m1.released - m2.released) AS yearDifference RETURN p.name AS director, avg(yearDifference) AS averageYearsBetweenReleases",neo4jLabs_synthetic_gemini,instance_id_32863,neo4jlabs_demo_db_movies
"How many entities have the status ""Defaulted""?","MATCH (e:Entity) WHERE e.status = ""Defaulted"" RETURN count(e) AS count",neo4jLabs_synthetic_gemini,instance_id_30586,neo4jlabs_demo_db_offshoreleaks
Identify the 5 most common ship cities for orders.,"MATCH (o:Order) WITH o.shipCity AS city, COUNT(o) AS orderCount RETURN city ORDER BY orderCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_44538,neo4jlabs_demo_db_northwind
Which entities filed filings as originators where the amount is greater than 1000000 and the beneficiary entity is located in 'GBR'?,MATCH (f:Filing)-[:ORIGINATOR]->(originator:Entity) WHERE f.amount > 1000000 MATCH (f)-[:BENEFITS]->(beneficiary:Entity) WHERE beneficiary.country = 'GBR' RETURN DISTINCT originator.name,neo4jLabs_synthetic_gemini,instance_id_28098,neo4jlabs_demo_db_fincen
"""What are the latest news about the company where Emil Eifrem is the CEO?""","MATCH (p:Person {name: ""Emil Eifrem""})-[:CEO_OF]->(c:Company) MATCH (c)-[:PUBLISHES]->(n:News) RETURN n.title, n.date ORDER BY n.date DESC",neo4j_crowdsourced,instance_id_27883,neo4jlabs_demo_db_movies
What is the IP address of the interface that connects to the switch with IP address 10.4.8?,MATCH (switch:Switch { ip: '10.4.8' })-[:ROUTES]->(connectedInterface:Interface) RETURN connectedInterface.ip,neo4jLabs_synthetic_gemini,instance_id_31581,neo4jlabs_demo_db_network
List streams that have a total view count greater than 500 million.,MATCH (s:Stream) WHERE s.total_view_count > 500000000 RETURN s,neo4jLabs_synthetic_gpt4turbo,instance_id_25789,neo4jlabs_demo_db_twitch
Which suppliers have a contactTitle of 'Purchasing Manager'?,MATCH (s:Supplier) WHERE s.contactTitle = 'Purchasing Manager' RETURN s.companyName AS supplierName,neo4jLabs_synthetic_gpt4o,instance_id_45393,neo4jlabs_demo_db_northwind
What is the name of the movie with the highest average vote?,MATCH (m:Movie) WITH max(m.average_vote) AS max_average_vote MATCH (m:Movie) WHERE m.average_vote = max_average_vote RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_34279,neo4jlabs_demo_db_eoflix
"Which movies have a review summary containing both ""football"" and ""coolest""?",MATCH (m:Movie)<-[r:REVIEWED]-(p:Person) WHERE r.summary CONTAINS 'football' AND r.summary CONTAINS 'coolest' RETURN DISTINCT m.title,neo4jLabs_synthetic_gemini,instance_id_33057,neo4jlabs_demo_db_movies
"Which movie, released before 2000, has the highest revenue?",MATCH (m:Movie) WHERE m.release_date < date('2000-01-01') RETURN m ORDER BY m.revenue DESC LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_34618,neo4jlabs_demo_db_eoflix
Show the top 5 entities by last edit timestamp.,MATCH (e:Entity) RETURN e ORDER BY e.lastEditTimestamp DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21144,neo4jlabs_demo_db_offshoreleaks
Show the first 5 movies that have a character named 'Charlie Wilson' in their cast.,MATCH (p:Person)-[r:CAST_FOR]->(m:Movie) WHERE r.character = 'Charlie Wilson' RETURN m LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23250,neo4jlabs_demo_db_eoflix
"""in how many movies director acted""","MATCH (p:Person)-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(p) RETURN p.name AS Director, COUNT(m) AS MoviesActedIn",neo4j_crowdsourced,instance_id_27463,neo4jlabs_demo_db_movies
"What is the total amount of filings filed between 2012-01-01 and 2012-12-31 where the beneficiary bank is located in the country with code ""GBR""?","MATCH (f:Filing)-[r:BENEFITS]->(b:Entity) WHERE f.begin_date_format >= ""2012-01-01"" AND f.begin_date_format <= ""2012-12-31"" AND b.country = ""GBR"" WITH sum(f.amount) AS total RETURN total",neo4jLabs_synthetic_gemini,instance_id_28204,neo4jlabs_demo_db_fincen
List the first 3 videos that have a specific keyword 'action' and are in the 'Released' status.,MATCH (v:Video)-[:HAS_KEYWORD]->(k:Keyword {name: 'action'}) WHERE v.status = 'Released' RETURN v LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20685,neo4jlabs_demo_db_eoflix
List the movies with a runtime greater than 150 minutes.,MATCH (m:Movie) WHERE m.runtime > 150 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_34251,neo4jlabs_demo_db_eoflix
What is the maximum number of filings associated with a single entity through the `FILED` relationship?,"MATCH (e:Entity)-[:FILED]->(f:Filing) WITH e, size(collect(f)) AS filingCount RETURN max(filingCount)",neo4jLabs_synthetic_gemini,instance_id_28290,neo4jlabs_demo_db_fincen
List the first 3 tweets that link to 'https://twitter.com'.,MATCH (t:Tweet)-[:CONTAINS]->(l:Link) WHERE l.url STARTS WITH 'https://twitter.com' RETURN t ORDER BY t.created_at LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43045,neo4jlabs_demo_db_twitter
List all suppliers who supply products to customers in all regions of 'USA'.,MATCH (c:Customer)-[:PURCHASED]->(:Order)-[:ORDERS]->(p:Product)<-[:SUPPLIES]->(s:Supplier) WHERE c.country = 'USA' RETURN DISTINCT s.companyName,neo4jLabs_synthetic_gemini,instance_id_32210,neo4jlabs_demo_db_northwind
Which movies have a tagline containing the word 'real' and were released in the 2000s?,"MATCH (m:Movie) WHERE m.tagline CONTAINS 'real' AND m.released >= 2000 AND m.released < 2010 RETURN m.title, m.released, m.tagline",neo4jLabs_synthetic_gpt4turbo,instance_id_23713,neo4jlabs_demo_db_movies
List the top 5 youngest people who have written a movie.,"MATCH (p:Person)-[:WROTE]->(m:Movie) RETURN p.name, p.born ORDER BY p.born DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_40029,neo4jlabs_demo_db_movies
List all movies reviewed with a summary containing 'journey'.,"MATCH (m:Movie)<-[:REVIEWED {summary: 'An amazing journey'}]-(p:Person) RETURN m.title AS MovieTitle, p.name AS ReviewerName",neo4jLabs_synthetic_gpt4turbo,instance_id_23956,neo4jlabs_demo_db_movies
"What is the name of the entity that is most frequently the `CONCERNS` in filings where the `originator_bank` is ""Deutsche Bank AG""?","MATCH (f:Filing {originator_bank: ""Deutsche Bank AG""}) MATCH (f)-[:CONCERNS]->(e:Entity) WITH e, count(f) AS concern_count ORDER BY concern_count DESC RETURN e.name LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_28318,neo4jlabs_demo_db_fincen
Which 3 filings have the smallest amounts where the beneficiary bank's country is 'Japan'?,MATCH (f:Filing) WHERE f.beneficiary_bank_country = 'Japan' RETURN f ORDER BY f.amount ASC LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_41173,neo4jlabs_demo_db_fincen
List the `customerID` and total number of orders for customers who have placed more than 5 orders.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WITH c, count(o) AS totalOrders WHERE totalOrders > 5 RETURN c.customerID, totalOrders",neo4jLabs_synthetic_gemini,instance_id_32207,neo4jlabs_demo_db_northwind
Which country has produced the most movies with a budget lower than 10 million dollars?,"MATCH (m:Movie) WHERE m.budget < 10000000 WITH m.countries AS country, count(m) AS movieCount RETURN country, movieCount ORDER BY movieCount DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29768,neo4jlabs_demo_db_recommendations
Who are the customers with orders that have a shipVia of '3'?,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE o.shipVia = '3' RETURN c.companyName AS customerName, c.contactName AS contactName, c.contactTitle AS contactTitle, c.phone AS phone, c.address AS address, c.city AS city, c.postalCode AS postalCode, c.country AS country",neo4jLabs_synthetic_gpt4o,instance_id_44647,neo4jlabs_demo_db_northwind
What is the type of the machine that runs the most applications in DataCenter 'DC1'?,"MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(:Rack)-[:HOLDS]->(m:Machine)-[:RUNS]->(a:Application) WITH m, count(a) as appCount ORDER BY appCount DESC LIMIT 1 MATCH (m)-[:TYPE]->(t:Type) RETURN t.type AS machineType",neo4jLabs_synthetic_gpt4o,instance_id_44038,neo4jlabs_demo_db_network
Find the filings where the beneficiary bank is located in a country with a 'code' of 'GBR' and the amount is less than 100000.,"MATCH (f:Filing)-[:BENEFITS]->(b:Entity)-[:COUNTRY]->(c:Country) WHERE c.code = 'GBR' AND f.amount < 100000 RETURN f.sar_id, f.amount",neo4jLabs_synthetic_gemini,instance_id_29017,neo4jlabs_demo_db_fincen
"List the `inactivation_date` of entities that share an officer with the entity named ""NINGBO SUNRISE ENTERPRISES UNITED CO., LTD."".","MATCH (e:Entity { name: ""NINGBO SUNRISE ENTERPRISES UNITED CO., LTD."" }) MATCH (e)-[:officer_of]-(o:Officer) MATCH (o)-[:officer_of]-(other:Entity) RETURN DISTINCT other.inactivation_date",neo4jLabs_synthetic_gemini,instance_id_30494,neo4jlabs_demo_db_offshoreleaks
