question,cypher,data_source,instance_id,database_reference_alias
"List the names of the games played by streams that have a total view count greater than 50,000,000.",MATCH (s:Stream)-[:PLAYS]->(g:Game) WHERE s.total_view_count > 50000000 RETURN DISTINCT g.name,neo4jLabs_synthetic_gemini,instance_id_34035,neo4jlabs_demo_db_twitch
Which movie has the highest budget?,MATCH (m:Movie) RETURN m ORDER BY m.budget DESC LIMIT 1,neo4jLabs_synthetic_gemini,instance_id_29305,neo4jlabs_demo_db_recommendations
List the top 5 actors with the most roles in movies released before 1980.,"MATCH (a:Actor)-[r:ACTED_IN]->(m:Movie) WHERE m.year < 1980 RETURN a.name, count(r) AS roles ORDER BY roles DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_24783,neo4jlabs_demo_db_recommendations
Which applications are dependent on the service with name 'java'?,MATCH (s:Service {name: 'java'})<-[:DEPENDS_ON]-(a:Application) RETURN a.name AS application_name,neo4jLabs_synthetic_gemini,instance_id_31672,neo4jlabs_demo_db_network
List the top 3 most followed users who mention 'neo4j' in their tweets.,"MATCH (u:User)-[:POSTS]->(t:Tweet)-[:MENTIONS]->(m:Me {screen_name: 'neo4j'}) RETURN u.name, u.followers ORDER BY u.followers DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43196,neo4jlabs_demo_db_twitter
Identify all tweets by 'Neo4j' that mention a user with at least 5000 followers.,MATCH (u:User {name: 'Neo4j'})-[:POSTS]->(t:Tweet)-[:MENTIONS]->(m:User) WHERE m.followers >= 5000 RETURN t,neo4jLabs_synthetic_gpt4turbo,instance_id_24217,neo4jlabs_demo_db_twitter
How many 'Machine' nodes are there in 'Rack' with 'zone' 2?,MATCH (r:Rack {zone: 2})-[:HOLDS]->(m:Machine) RETURN count(m),neo4jLabs_synthetic_gemini,instance_id_31774,neo4jlabs_demo_db_network
Provide the names of 3 actors who have also directed movies.,MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(a) RETURN a.name LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_42725,neo4jlabs_demo_db_recommendations
Find the top 5 orders with the most different products included.,"MATCH (o:Order)-[r:ORDERS]->(p:Product) WITH o, count(DISTINCT p) AS numProducts ORDER BY numProducts DESC LIMIT 5 RETURN o.orderID, numProducts",neo4jLabs_synthetic_gpt4turbo,instance_id_21710,neo4jlabs_demo_db_northwind
What is the name of the movie with the highest IMDb rating that is shorter than 90 minutes?,MATCH (m:Movie) WHERE m.runtime < 90 WITH m ORDER BY m.imdbRating DESC LIMIT 1 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_29668,neo4jlabs_demo_db_recommendations
List the intermediaries that have an active status.,"MATCH (i:Intermediary) WHERE i.status = 'ACTIVE' RETURN i.name AS intermediary_name, i.countries AS countries, i.address AS address",neo4jLabs_synthetic_gpt4o,instance_id_44740,neo4jlabs_demo_db_offshoreleaks
Which production companies have produced both movies and TV shows?,MATCH (pc:ProductionCompany)<-[:PRODUCED_BY]-(m:Movie) MATCH (pc)<-[:PRODUCED_BY]-(v:Video) RETURN DISTINCT pc.name,neo4jLabs_synthetic_gemini,instance_id_34219,neo4jlabs_demo_db_eoflix
Identify officers connected to entities with a jurisdiction description of 'Samoa'.,MATCH (o:Officer)-[:officer_of]->(e:Entity) WHERE e.jurisdiction_description = 'Samoa' RETURN o,neo4jLabs_synthetic_gpt4turbo,instance_id_21140,neo4jlabs_demo_db_offshoreleaks
List all customers who have placed orders with a required date in 1998.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order) WHERE o.requiredDate STARTS WITH '1998' RETURN c.companyName AS customerName, c.contactName AS contactName, c.customerID AS customerID",neo4jLabs_synthetic_gpt4o,instance_id_44600,neo4jlabs_demo_db_northwind
List the first 3 video titles that have been produced by 'Pixar Animation Studios'.,MATCH (v:Video)-[:PRODUCED_BY]->(pc:ProductionCompany {name: 'Pixar Animation Studios'}) RETURN v.title LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20797,neo4jlabs_demo_db_eoflix
List the `name`s of the entities that are connected to filings with a `number` greater than 10 through the `BENEFITS` relationship.,MATCH (f:Filing) WHERE f.number > 10 MATCH (f)-[:BENEFITS]->(e:Entity) RETURN DISTINCT e.name,neo4jLabs_synthetic_gemini,instance_id_28321,neo4jlabs_demo_db_fincen
List the first 3 packages that provide the longest duration of access to movies.,"MATCH (p:Package)-[:PROVIDES_ACCESS_TO]->(:Genre)<-[:IN_GENRE]-(m:Movie) RETURN p.name, p.duration ORDER BY p.duration DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20673,neo4jlabs_demo_db_eoflix
Show the first 5 filings with the most entities involved as concerns from different sectors.,"MATCH (f:Filing)-[:CONCERNS]->(e:Entity) WITH f, COUNT(DISTINCT e) AS entityCount ORDER BY entityCount DESC LIMIT 5 MATCH (f)-[:CONCERNS]->(e:Entity) RETURN f.sar_id AS FilingID, f.begin AS BeginDate, f.end AS EndDate, f.amount AS Amount, COLLECT(e.name) AS ConcernedEntities",neo4jLabs_synthetic_gpt4o,instance_id_41115,neo4jlabs_demo_db_fincen
"""How long is the longest thread of replies?""",MATCH p=(t:Tweet)-[:REPLY_TO*]->(:Tweet) RETURN length(p) AS longestThread ORDER BY longestThread DESC LIMIT 1,neo4j_crowdsourced,instance_id_27556,neo4jlabs_demo_db_twitter
List streams that have a total view count greater than 500 million.,"MATCH (s:Stream) WHERE s.total_view_count > 500000000 RETURN s.name, s.url, s.total_view_count",neo4jLabs_synthetic_gpt4o,instance_id_43259,neo4jlabs_demo_db_twitch
"What is the total revenue generated by movies in the ""Adventure"" genre?",MATCH (m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Adventure'}) RETURN sum(m.revenue) AS totalRevenue,neo4jLabs_synthetic_gemini,instance_id_29284,neo4jlabs_demo_db_recommendations
What is the tagline of the movie released in 1999?,MATCH (m:Movie) WHERE m.released = 1999 RETURN m.tagline,neo4jLabs_synthetic_gemini,instance_id_32933,neo4jlabs_demo_db_movies
Find the movies that were released in the month of December.,MATCH (m:Movie) WHERE date(m.release_date).month = 12 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32047,neo4jlabs_demo_db_eoflix
List the top 5 orders with the highest freight cost.,MATCH (o:Order) RETURN o ORDER BY o.freight DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21999,neo4jlabs_demo_db_northwind
What are the top 5 products by quantity ordered in the 'Condiments' category?,"MATCH (c:Category {categoryName: 'Condiments'})<-[:PART_OF]-(p:Product)<-[:ORDERS]-(o:Order) RETURN p.productName, SUM(o.quantity) AS totalQuantity ORDER BY totalQuantity DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_45235,neo4jlabs_demo_db_northwind
Name the languages spoken in streams with a total view count exceeding 10 million.,MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE s.total_view_count > 10000000 RETURN DISTINCT l.name,neo4jLabs_synthetic_gpt4turbo,instance_id_24367,neo4jlabs_demo_db_twitch
List the names of the actors born in France.,"MATCH (a:Actor {bornIn: ""France""}) RETURN a.name",neo4jLabs_synthetic_gemini,instance_id_29651,neo4jlabs_demo_db_recommendations
Which officers have a 'icij_id' property that starts with 'CFE' and are 'officer_of' entities with a 'jurisdiction' of 'NIUE'?,MATCH (o:Officer)-[r:officer_of]->(e:Entity) WHERE o.icij_id STARTS WITH 'CFE' AND e.jurisdiction = 'NIUE' RETURN o.name,neo4jLabs_synthetic_gemini,instance_id_30709,neo4jlabs_demo_db_offshoreleaks
"Which people have reviewed a movie with the words ""solid romp"" in the summary?",MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE r.summary CONTAINS 'A solid romp' RETURN p.name,neo4jLabs_synthetic_gemini,instance_id_33086,neo4jlabs_demo_db_movies
List the top 5 videos with the least revenue.,"MATCH (v:Video) WHERE v.revenue IS NOT NULL RETURN v.title, v.revenue ORDER BY v.revenue ASC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_39699,neo4jlabs_demo_db_eoflix
Which directors have the most number of movies with a rating greater than 8.0?,"MATCH (p:Person {gender: 2})-[:CREW_FOR {job: 'Director'}]-(m:Movie) WHERE m.average_vote > 8.0 WITH p, count(m) AS movieCount ORDER BY movieCount DESC RETURN p.name, movieCount LIMIT 10",neo4jLabs_synthetic_gemini,instance_id_31839,neo4jlabs_demo_db_eoflix
What is the runtime of the movie with the highest average vote?,"MATCH (m:Movie) RETURN m.runtime, m.average_vote ORDER BY m.average_vote DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_34334,neo4jlabs_demo_db_eoflix
List the top 5 streams with the most chatters who are users.,"MATCH (s:Stream)-[:CHATTER]->(u:User) WITH s, count(u) AS userChatters ORDER BY userChatters DESC LIMIT 5 RETURN s.id AS StreamID, s.name AS StreamName, userChatters",neo4jLabs_synthetic_gpt4turbo,instance_id_24567,neo4jlabs_demo_db_twitch
Find all movies released between 1990 and 2000 with an average vote greater than 7.,MATCH (m:Movie) WHERE m.release_date >= date('1990-01-01') AND m.release_date <= date('2000-12-31') AND m.average_vote > 7 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32005,neo4jlabs_demo_db_eoflix
"What is the average runtime of movies in the ""Drama"" genre?",MATCH (g:Genre {name: 'Drama'})<-[:IN_GENRE]-(m:Movie) WITH avg(m.runtime) AS average_runtime RETURN average_runtime,neo4jLabs_synthetic_gemini,instance_id_29842,neo4jlabs_demo_db_recommendations
List the first 3 orders shipped to France.,"MATCH (o:Order)-[:ORDERS]->(p:Product) WHERE o.shipCountry = 'France' RETURN o.orderID, o.shipName, o.shipCity, o.shipPostalCode, o.shipAddress, o.shipCountry, o.shippedDate ORDER BY o.shippedDate LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44673,neo4jlabs_demo_db_northwind
List the first 3 movies that have been directed by actors.,MATCH (a:Actor)-[:DIRECTED]->(m:Movie) RETURN m LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_25380,neo4jlabs_demo_db_recommendations
Find the product that has the lowest ratio of units on order to reorder level.,"MATCH (p:Product) WHERE p.reorderLevel <> 0 WITH p, (toFloat(p.unitsOnOrder) / toFloat(p.reorderLevel)) AS ratio ORDER BY ratio ASC LIMIT 1 RETURN p, ratio",neo4jLabs_synthetic_gemini,instance_id_32344,neo4jlabs_demo_db_northwind
Which customers (show `customerID` and `companyName`) have placed orders that include the product with the lowest `reorderLevel`?,"MATCH (p:Product) WITH p, min(p.reorderLevel) AS lowestReorderLevel WHERE p.reorderLevel = lowestReorderLevel MATCH (p)<-[:ORDERS]-(o:Order)<-[:PURCHASED]-(c:Customer) RETURN DISTINCT c.customerID, c.companyName",neo4jLabs_synthetic_gemini,instance_id_30844,neo4jlabs_demo_db_northwind
List the start times of all processes running on machines in zone 2.,MATCH (z:Zone {zone: 2})-[:ROUTES]->(:Interface)<-[:ROUTES]-(:Switch)<-[:HOLDS]-(r:Rack {zone: 2})-[:HOLDS]->(m:Machine)-[:RUNS]->(p:Process) RETURN p.startTime,neo4jLabs_synthetic_gpt4o,instance_id_43765,neo4jlabs_demo_db_network
"List the first 3 languages used by streams that have more than 10,000 followers.",MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE s.followers > 10000 RETURN DISTINCT l.name ORDER BY l.name LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43569,neo4jlabs_demo_db_twitch
Name 3 movies directed by Pixar Animation Studios.,"MATCH (m:Movie)-[:PRODUCED_BY]->(pc:ProductionCompany {name: ""Pixar Animation Studios""}) RETURN m.title AS MovieTitle LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23446,neo4jlabs_demo_db_eoflix
Find the movies that have an overview.,"MATCH (m:Movie) WHERE m.overview <> """" RETURN m",neo4jLabs_synthetic_gemini,instance_id_32011,neo4jlabs_demo_db_eoflix
Identify the first 3 applications with a PID less than 2000.,MATCH (a:Application) WHERE a.pid < 2000 RETURN a ORDER BY a.pid LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20272,neo4jlabs_demo_db_network
"What is the average number of followers for users who have posted tweets that mention the user with screen name ""neo4j""?",MATCH (targetUser:User {screen_name: 'neo4j'}) <-[:MENTIONS]-(tweet:Tweet) <-[:POSTS]-(user:User) WITH avg(user.followers) AS averageFollowers RETURN averageFollowers,neo4jLabs_synthetic_gemini,instance_id_34713,neo4jlabs_demo_db_twitter
Which suppliers supply products to more than one category?,"MATCH (s:Supplier)-[:SUPPLIES]->(p:Product)-[:PART_OF]->(c:Category) WITH s, collect(DISTINCT c.categoryID) AS categories WHERE size(categories) > 1 RETURN s.companyName AS Supplier, size(categories) AS NumberOfCategories",neo4jLabs_synthetic_gpt4o,instance_id_44683,neo4jlabs_demo_db_northwind
List all services listening on port 80.,MATCH (s:Service)-[:LISTENS]->(p:Port {port: 80}) RETURN s.name,neo4jLabs_synthetic_gpt4o,instance_id_44065,neo4jlabs_demo_db_network
Identify all movies that were produced in a country other than the United States.,"MATCH (m:Movie)-[:PRODUCED_IN_COUNTRY]->(c:Country) WHERE c.name <> ""United States of America"" RETURN m",neo4jLabs_synthetic_gpt4turbo,instance_id_23609,neo4jlabs_demo_db_eoflix
"""who is the youngest director to direct a movie""","MATCH (p:Person)-[:DIRECTED]->(m:Movie) RETURN p.name AS Director, p.born AS YearBorn ORDER BY p.born DESC LIMIT 1",neo4j_crowdsourced,instance_id_27340,neo4jlabs_demo_db_movies
What are the first 3 types of machines located in DataCenter 'DC1'?,MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(r:Rack)-[:HOLDS]->(m:Machine)-[:TYPE]->(t:Type) RETURN t.type LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20257,neo4jlabs_demo_db_network
List the original addresses associated with the sourceID 'Panama Papers'.,MATCH (a:Address) WHERE a.sourceID = 'Panama Papers' AND a.original_address IS NOT NULL RETURN a.original_address,neo4jLabs_synthetic_gpt4turbo,instance_id_21961,neo4jlabs_demo_db_offshoreleaks
Identify the top 5 products with the lowest reorder level.,"MATCH (p:Product) RETURN p.productName, p.reorderLevel ORDER BY p.reorderLevel ASC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_20466,neo4jlabs_demo_db_northwind
Which products have been ordered by customers from Berlin?,"MATCH (c:Customer {city: ""Berlin""})-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) RETURN DISTINCT p.productName AS ProductOrdered",neo4jLabs_synthetic_gpt4turbo,instance_id_21633,neo4jlabs_demo_db_northwind
List all movies that were both acted in and directed by the same person.,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(p) RETURN m.title AS MovieTitle, p.name AS PersonName",neo4jLabs_synthetic_gpt4turbo,instance_id_23833,neo4jlabs_demo_db_movies
What are the top 5 filings concerning entities that are located at a latitude higher than 40 degrees?,MATCH (f:Filing)-[:CONCERNS]->(e:Entity)-[:COUNTRY]->(c:Country) WHERE c.location.latitude > 40 RETURN f ORDER BY f.amount DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_22761,neo4jlabs_demo_db_fincen
Which actors have acted in movies directed by the person who directed 'Speed Racer'?,MATCH (d:Person)-[:DIRECTED]->(m:Movie {title: 'Speed Racer'}) WITH d MATCH (d)-[:DIRECTED]->(movie:Movie)<-[:ACTED_IN]-(actor:Person) RETURN DISTINCT actor.name,neo4jLabs_synthetic_gemini,instance_id_32931,neo4jlabs_demo_db_movies
"Which versions of the software ""RHEL"" are there?",MATCH (software:Software {name: 'RHEL'})-[:VERSION]->(version:Version) RETURN version.name,neo4jLabs_synthetic_gemini,instance_id_32365,neo4jlabs_demo_db_network
List the entities that have undergone liquidation as per their notes.,MATCH (e:Entity) WHERE e.note = 'Closed date stands for Liquidation date.' RETURN e,neo4jLabs_synthetic_gpt4turbo,instance_id_21238,neo4jlabs_demo_db_offshoreleaks
List the first 3 keywords associated with the movie 'Toy Story'.,MATCH (m:Movie {title: 'Toy Story'})-[:HAS_KEYWORD]->(k:Keyword) RETURN k.name ORDER BY k.id LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_34294,neo4jlabs_demo_db_eoflix
"Which streams have a total view count greater than 10,000,000 and are played in English?","MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE s.total_view_count > 10000000 AND l.name = ""en"" RETURN s.name",neo4jLabs_synthetic_gemini,instance_id_34106,neo4jlabs_demo_db_twitch
What is the name of the movie with the highest average vote and released after 2010?,"MATCH (m:Movie) WHERE m.release_date > date('2010-01-01') RETURN m.title AS movie_title, m.average_vote AS average_vote ORDER BY average_vote DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32036,neo4jlabs_demo_db_eoflix
Find officers linked to entities that were incorporated in 2007 and are still active.,"MATCH (e:Entity)-[:officer_of]-(o:Officer) WHERE e.incorporation_date CONTAINS '2007' AND e.status = 'Active' RETURN o.name AS officer_name, e.name AS entity_name",neo4jLabs_synthetic_gpt4o,instance_id_44880,neo4jlabs_demo_db_offshoreleaks
List the top 5 entities with the highest number of filings where they are the beneficiary.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WITH e, count(f) AS filingCount ORDER BY filingCount DESC LIMIT 5 RETURN e.name AS entityName, filingCount",neo4jLabs_synthetic_gemini,instance_id_28332,neo4jlabs_demo_db_fincen
List the top 5 beneficiary banks by the total amount received from filings.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity) WITH e.name AS beneficiary_bank, SUM(f.amount) AS total_amount RETURN beneficiary_bank, total_amount ORDER BY total_amount DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_41055,neo4jlabs_demo_db_fincen
"Which Entities have a ""registered_address"" relationship with an Address in ""Samoa""?","MATCH (a:Address {countries: ""Samoa""})<-[:registered_address]-(e:Entity) RETURN e.name",neo4jLabs_synthetic_gemini,instance_id_31367,neo4jlabs_demo_db_offshoreleaks
List all movies that are part of any collection and have a revenue less than 1 million USD.,"MATCH (m:Movie)-[:IN_COLLECTION]->(c:Collection) WHERE m.revenue < 1000000 RETURN m.title AS MovieTitle, c.name AS CollectionName, m.revenue AS Revenue",neo4jLabs_synthetic_gpt4o,instance_id_44453,neo4jlabs_demo_db_eoflix
Find the descriptions of streams that have chatted with the user '9linda'.,MATCH (u:User {name: '9linda'})-[:CHATTER]->(s:Stream) RETURN s.description AS StreamDescription,neo4jLabs_synthetic_gpt4turbo,instance_id_25455,neo4jlabs_demo_db_twitch
What is the average IMDb rating of movies with a budget greater than $100 million?,MATCH (m:Movie) WHERE m.budget > 100000000 WITH avg(m.imdbRating) AS averageRating RETURN averageRating,neo4jLabs_synthetic_gemini,instance_id_29772,neo4jlabs_demo_db_recommendations
What is the valid_until date of the officer with node_id 12174285?,MATCH (o:Officer {node_id: 12174285}) RETURN o.valid_until,neo4jLabs_synthetic_gemini,instance_id_31001,neo4jlabs_demo_db_offshoreleaks
Find all people who have followed and been followed by the same person.,"MATCH (p1:Person)-[:FOLLOWS]->(p2:Person)<-[:FOLLOWS]-(p1) RETURN p1, p2",neo4jLabs_synthetic_gpt4turbo,instance_id_23642,neo4jlabs_demo_db_movies
Who are the top 3 users that have interacted with 'Neo4j' the most?,"MATCH (me:Me {screen_name: 'neo4j'})-[:INTERACTS_WITH]->(user:User) RETURN user.name AS userName, COUNT(*) AS interactionCount ORDER BY interactionCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42818,neo4jlabs_demo_db_twitter
"List the first 3 games that have been featured in streams with a team having over 1,000 followers.",MATCH (s:Stream)-[:PLAYS]->(g:Game) MATCH (s)-[:HAS_TEAM]->(t:Team) WHERE s.followers > 1000 RETURN DISTINCT g.name LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_43235,neo4jlabs_demo_db_twitch
List the top 5 streams that have the most number of languages associated.,"MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WITH s, count(l) AS num_languages ORDER BY num_languages DESC LIMIT 5 RETURN s.id AS StreamID, s.name AS StreamName, num_languages",neo4jLabs_synthetic_gpt4turbo,instance_id_24508,neo4jlabs_demo_db_twitch
Identify the top 5 users who have a profile image URL ending with 'normal.jpg' and follow 'Neo4j'.,MATCH (u:User)-[:FOLLOWS]->(m:Me {name: 'Neo4j'}) WHERE u.profile_image_url ENDS WITH 'normal.jpg' RETURN u ORDER BY u.followers DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24971,neo4jlabs_demo_db_twitter
What is the total quantity of products ordered by the customer with customerID 'VINET'?,MATCH (c:Customer {customerID: 'VINET'})-[:PURCHASED]->(:Order)-[o:ORDERS]->(p:Product) RETURN sum(o.quantity) AS totalQuantity,neo4jLabs_synthetic_gemini,instance_id_30869,neo4jlabs_demo_db_northwind
List the top 5 highest rated movies by users.,"MATCH (u:User)-[r:RATED]->(m:Movie) RETURN m.title, AVG(r.rating) AS average_rating ORDER BY average_rating DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_20809,neo4jlabs_demo_db_eoflix
What is the name of the movie with the highest IMDb rating that is in black and white?,"MATCH (m:Movie) RETURN m.title, m.imdbRating ORDER BY m.imdbRating DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29717,neo4jlabs_demo_db_recommendations
What are the names of the top 3 Entities by the total amount of Filings they have benefited from?,"MATCH (e:Entity)<-[:BENEFITS]-(f:Filing) WITH e, SUM(f.amount) AS totalAmount ORDER BY totalAmount DESC LIMIT 3 RETURN e.name AS entityName, totalAmount",neo4jLabs_synthetic_gpt4o,instance_id_41223,neo4jlabs_demo_db_fincen
Find the movies that have a poster path.,MATCH (m:Movie) WHERE m.poster_path IS NOT NULL RETURN m,neo4jLabs_synthetic_gemini,instance_id_32053,neo4jlabs_demo_db_eoflix
What is the longest movie tagline in the dataset?,MATCH (m:Movie) WITH max(size(m.tagline)) AS max_length MATCH (m:Movie) WHERE size(m.tagline) = max_length RETURN m.tagline,neo4jLabs_synthetic_gemini,instance_id_32767,neo4jlabs_demo_db_movies
"Which movie has the most crew members with a job of ""Writer""?","MATCH (m:Movie)<-[cf:CREW_FOR]-(p:Person) WHERE cf.job = ""Writer"" WITH m, count(DISTINCT p) AS writer_count ORDER BY writer_count DESC RETURN m.title AS movie_title, writer_count LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_31952,neo4jlabs_demo_db_eoflix
List the production companies that have produced movies with an original language of Spanish.,MATCH (m:Movie)-[:PRODUCED_BY]->(pc:ProductionCompany) WHERE exists {   (m)-[:ORIGINAL_LANGUAGE]->(:Language {name: 'Spanish'}) } RETURN DISTINCT pc.name,neo4jLabs_synthetic_gpt4turbo,instance_id_20745,neo4jlabs_demo_db_eoflix
"What is the `icij_id` of the officer associated with the entity named ""NINGBO SUNRISE ENTERPRISES UNITED CO., LTD.""?","MATCH (e:Entity {name: ""NINGBO SUNRISE ENTERPRISES UNITED CO., LTD.""})<-[:officer_of]-(o:Officer) RETURN o.icij_id",neo4jLabs_synthetic_gemini,instance_id_30596,neo4jlabs_demo_db_offshoreleaks
List the top 5 routers in DataCenter 'DC1' by zone number.,"MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(r:Router) RETURN r.name, r.zone ORDER BY r.zone DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_20252,neo4jlabs_demo_db_network
List the first 5 movies released in the year 1995.,MATCH (m:Movie) WHERE date(m.release_date).year = 1995 WITH m  ORDER BY m.release_date ASC LIMIT 5 RETURN m,neo4jLabs_synthetic_gemini,instance_id_34594,neo4jlabs_demo_db_eoflix
Which movies did Nancy Meyers write?,"MATCH (p:Person {name: ""Nancy Meyers""})-[:WROTE]->(m:Movie) RETURN m.title",neo4jLabs_synthetic_gemini,instance_id_33665,neo4jlabs_demo_db_movies
Find the top 5 movies by revenue that have a runtime less than 100 minutes.,MATCH (m:Movie) WHERE m.runtime < 100 AND m.revenue IS NOT NULL RETURN m ORDER BY m.revenue DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_25074,neo4jlabs_demo_db_recommendations
What is the average number of followers for streams that have at least 2 moderators?,"MATCH (s:Stream)-[:MODERATOR]->(m) WITH s, count(DISTINCT m) AS moderatorCount WHERE moderatorCount >= 2 RETURN avg(s.followers) AS averageFollowers",neo4jLabs_synthetic_gemini,instance_id_33911,neo4jlabs_demo_db_twitch
"Which Entities have the same ""original_name"" but are incorporated in different jurisdictions?","MATCH (e1:Entity), (e2:Entity) WHERE e1.original_name = e2.original_name AND e1.jurisdiction <> e2.jurisdiction RETURN DISTINCT e1.original_name, e1.jurisdiction, e2.jurisdiction",neo4jLabs_synthetic_gemini,instance_id_31353,neo4jlabs_demo_db_offshoreleaks
Which 5 users have rated movies primarily in the 'Drama' genre?,"MATCH (u:User)-[r:RATED]->(m:Movie)-[:IN_GENRE]->(g:Genre {name: 'Drama'}) WITH u, COUNT(r) AS dramaRatings ORDER BY dramaRatings DESC LIMIT 5 RETURN u.name AS userName, dramaRatings",neo4jLabs_synthetic_gpt4o,instance_id_42752,neo4jlabs_demo_db_recommendations
List the first 5 entities that have been struck off as of 2013.,MATCH (e:Entity) WHERE e.struck_off_date STARTS WITH '2013' RETURN e LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21256,neo4jlabs_demo_db_offshoreleaks
Who are the people born before 1950 who have directed a movie?,MATCH (p:Person) WHERE p.born < 1950 MATCH (p)-[:DIRECTED]->(m:Movie) RETURN DISTINCT p.name,neo4jLabs_synthetic_gemini,instance_id_32686,neo4jlabs_demo_db_movies
"Show the top 5 Filings where the amount is between $500,000 and $1,000,000.",MATCH (f:Filing) WHERE f.amount >= 500000 AND f.amount <= 1000000 RETURN f ORDER BY f.amount DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_21472,neo4jlabs_demo_db_fincen
"What is the URL of the stream that is moderated by the user with the least amount of followers and has the language ""ru""?","MATCH (u:User)-[:MODERATOR]->(s:Stream) WITH u, min(s.followers) AS min_followers MATCH (u)-[:MODERATOR]->(s:Stream {followers: min_followers}) MATCH (s)-[:HAS_LANGUAGE]->(l:Language {name: 'ru'}) RETURN DISTINCT s.url",neo4jLabs_synthetic_gemini,instance_id_33874,neo4jlabs_demo_db_twitch
Which 3 products are most frequently ordered together?,"MATCH (p1:Product)-[:ORDERS]-(o:Order)-[:ORDERS]-(p2:Product) WHERE p1.productID < p2.productID WITH p1, p2, count(o) AS times_ordered_together ORDER BY times_ordered_together DESC RETURN p1.productName, p2.productName, times_ordered_together LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20432,neo4jlabs_demo_db_northwind
Identify the streams that have the most moderators.,"MATCH (s:Stream) WITH s, count{(s)-[:MODERATOR]->()} AS moderatorCount RETURN s, moderatorCount ORDER BY moderatorCount DESC LIMIT 1",neo4jLabs_synthetic_gpt4turbo,instance_id_24459,neo4jlabs_demo_db_twitch
"""Which entities have the highest transaction volume?""","MATCH (:Entity)-[r:FILED]->(f:Filing) RETURN r.name AS EntityName, SUM(f.amount) AS TotalTransactionVolume ORDER BY TotalTransactionVolume DESC",neo4j_crowdsourced,instance_id_27916,neo4jlabs_demo_db_fincen
"List the top 3 users with the highest number of streams they are moderators of that have the language ""en"" and have at least one VIP and have at least one chatter.","MATCH (u:User)-[:MODERATOR]->(s:Stream) WHERE (s)-[:HAS_LANGUAGE]->(:Language {name: 'en'}) AND EXISTS { (s)-[:VIP]->(:User) } AND EXISTS { (s)-[:CHATTER]->(:User) } WITH u, count(s) AS moderatedStreamCount ORDER BY moderatedStreamCount DESC LIMIT 3 RETURN u.name AS userName, moderatedStreamCount",neo4jLabs_synthetic_gemini,instance_id_33733,neo4jlabs_demo_db_twitch
List the top 5 customers based on the number of unique products ordered.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[:ORDERS]->(p:Product) WITH c, COUNT(DISTINCT p.productID) AS uniqueProductsOrdered ORDER BY uniqueProductsOrdered DESC LIMIT 5 RETURN c.companyName AS customerName, uniqueProductsOrdered",neo4jLabs_synthetic_gpt4o,instance_id_44988,neo4jlabs_demo_db_northwind
List the top 5 streams by follower count.,"MATCH (s:Stream) RETURN s.name, s.followers ORDER BY s.followers DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43439,neo4jlabs_demo_db_twitch
List the top 5 highest-grossing movies of 2006.,"MATCH (m:Movie) WHERE m.year = 2006 RETURN m.title, m.revenue ORDER BY m.revenue DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_26140,neo4jlabs_demo_db_recommendations
Find the customers who have purchased products from suppliers located in the same country as the customer.,MATCH (c:Customer)-->(o:Order)-->(p:Product)<--(s:Supplier) WHERE c.country = s.country RETURN DISTINCT c.companyName,neo4jLabs_synthetic_gemini,instance_id_30973,neo4jlabs_demo_db_northwind
"How many filings are there where the `originator_bank_country` is ""Germany"" and the `beneficiary_bank_country` is ""Afghanistan""?","MATCH (f:Filing) WHERE f.originator_bank_country = ""Germany"" AND f.beneficiary_bank_country = ""Afghanistan"" RETURN count(f)",neo4jLabs_synthetic_gemini,instance_id_28117,neo4jlabs_demo_db_fincen
What are the first 3 genres associated with the most popular movies?,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WHERE m.popularity IS NOT NULL RETURN g.name, m.popularity ORDER BY m.popularity DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23477,neo4jlabs_demo_db_eoflix
Which users have the highest 'betweenness' centrality?,"MATCH (u:User) RETURN u.screen_name, u.betweenness ORDER BY u.betweenness DESC LIMIT 10",neo4jLabs_synthetic_gemini,instance_id_34539,neo4jlabs_demo_db_twitter
What is the average total view count for all users in the database?,MATCH (s:Stream) WITH avg(s.total_view_count) AS average_view_count RETURN average_view_count,neo4jLabs_synthetic_gemini,instance_id_34019,neo4jlabs_demo_db_twitch
List all movies with a tagline that starts with a verb.,MATCH (m:Movie) WHERE m.tagline STARTS WITH 'Welcome' OR m.tagline STARTS WITH 'Enter' OR m.tagline STARTS WITH 'Escape' RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32639,neo4jlabs_demo_db_movies
Which entities are associated with originator bank 'CIMB Bank Berhad'?,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WHERE f.originator_bank = 'CIMB Bank Berhad' RETURN e,neo4jLabs_synthetic_gpt4turbo,instance_id_21428,neo4jlabs_demo_db_fincen
List the first 5 actors who have acted in movies directed by a director born in Nebraska.,"MATCH (d:Director {bornIn: ""Nebraska""})-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(a:Actor) RETURN DISTINCT a.name LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_25938,neo4jlabs_demo_db_recommendations
Which Applications listen on Port 8080?,MATCH (p:Port {port: 8080})<-[:LISTENS]-(a:Application) RETURN a.name,neo4jLabs_synthetic_gpt4o,instance_id_43811,neo4jlabs_demo_db_network
List the top 5 actors who have worked with the director of 'Toy Story'.,"MATCH (toyStory:Movie {title: 'Toy Story'}) MATCH (toyStory)<-[:CREW_FOR {job: 'Director'}]-(director:Person) MATCH (director)-[:CREW_FOR {job: 'Director'}]->(directedMovie:Movie) MATCH (actor:Person)-[:CAST_FOR]->(directedMovie) WITH actor, count(DISTINCT directedMovie) AS movieCount ORDER BY movieCount DESC RETURN actor.name, movieCount LIMIT 5",neo4jLabs_synthetic_gemini,instance_id_34426,neo4jlabs_demo_db_eoflix
What is the average length of movie summaries?,MATCH (:Person)-[review:REVIEWED]->(:Movie) WITH size(review.summary) AS summary_length RETURN avg(summary_length) AS average_summary_length,neo4jLabs_synthetic_gemini,instance_id_32859,neo4jlabs_demo_db_movies
List the names of 3 people who were born after 1970.,MATCH (p:Person) WHERE p.born > 1970 RETURN p.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_23755,neo4jlabs_demo_db_movies
Which 3 users have the most followers among those who have interacted with Neo4j?,"MATCH (me:Me {screen_name: 'neo4j'})-[:INTERACTS_WITH]->(user:User) RETURN user.name, user.followers ORDER BY user.followers DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43088,neo4jlabs_demo_db_twitter
Which ports are exposed by the interface with IP '10.0.0.254'?,MATCH (i:Interface {ip: '10.0.0.254'})-[:EXPOSES]->(p:Port) RETURN p.port,neo4jLabs_synthetic_gpt4turbo,instance_id_20514,neo4jlabs_demo_db_network
"What is the average revenue of the movies directed by the director of ""Toy Story""?",MATCH (m:Movie {title: 'Toy Story'})<-[:CAST_FOR]-(d:Person)-[:CREW_FOR {job: 'Director'}]->(m) WITH d MATCH (d)-[:CREW_FOR {job: 'Director'}]->(otherMovies:Movie) RETURN avg(otherMovies.revenue),neo4jLabs_synthetic_gemini,instance_id_34655,neo4jlabs_demo_db_eoflix
What are the IMDb ratings of movies directed by François Lallement?,"MATCH (d:Director {name: ""François Lallement""})-[:DIRECTED]->(m:Movie) RETURN m.title AS MovieTitle, m.imdbRating AS IMDbRating",neo4jLabs_synthetic_gpt4turbo,instance_id_24680,neo4jlabs_demo_db_recommendations
