question,cypher,data_source,instance_id,database_reference_alias
"Which movie has the most crew members with a department of ""Production""?","MATCH (m:Movie)<-[cr:CREW_FOR]-(p:Person) WHERE cr.department = 'Production' WITH m, count(p) AS crew_count ORDER BY crew_count DESC RETURN m.title AS movie_title, crew_count LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_31955,neo4jlabs_demo_db_eoflix
Find the top 3 actors by number of movies acted in from 1990 to 2000.,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.released >= 1990 AND m.released <= 2000 RETURN p.name, count(m) AS movies_count ORDER BY movies_count DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_23929,neo4jlabs_demo_db_movies
List the first 3 directors who died after 2000.,"MATCH (d:Director) WHERE d.died > date(""2000-01-01"") RETURN d.name, d.died ORDER BY d.died LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42029,neo4jlabs_demo_db_recommendations
Which movie genre has the highest average IMDb rating?,"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) WITH g, avg(m.imdbRating) AS averageRating ORDER BY averageRating DESC LIMIT 1 RETURN g.name AS genre, averageRating",neo4jLabs_synthetic_gemini,instance_id_29780,neo4jlabs_demo_db_recommendations
Name the top 5 movies where the main language spoken is not the original language.,"MATCH (m:Movie)-[:SPOKEN_IN_LANGUAGE]->(l:Language),       (m)-[:ORIGINAL_LANGUAGE]->(ol:Language) WHERE l.id <> ol.id RETURN m.title AS MovieTitle, l.name AS SpokenLanguage, ol.name AS OriginalLanguage ORDER BY m.popularity DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23560,neo4jlabs_demo_db_eoflix
"What is the lastEditTimestamp of the entity named 'NINGBO SUNRISE ENTERPRISES UNITED CO., LTD.'?","MATCH (e:Entity {name: 'NINGBO SUNRISE ENTERPRISES UNITED CO., LTD.'}) RETURN e.lastEditTimestamp",neo4jLabs_synthetic_gemini,instance_id_31017,neo4jlabs_demo_db_offshoreleaks
List the titles of the movies with a runtime between 90 and 120 minutes.,MATCH (m:Movie) WHERE m.runtime >= 90 AND m.runtime <= 120 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_29833,neo4jlabs_demo_db_recommendations
What are the names of all routers routing through interface with IP '10.1.0.254'?,MATCH (r:Router)-[:ROUTES]->(i:Interface {ip: '10.1.0.254'}) RETURN r.name,neo4jLabs_synthetic_gpt4o,instance_id_43943,neo4jlabs_demo_db_network
List all persons who have directed a movie with a released year divisible by 20.,MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE m.released % 20 = 0 RETURN p.name,neo4jLabs_synthetic_gpt4o,instance_id_39526,neo4jlabs_demo_db_movies
Which 3 customers have a 'fax' number listed?,MATCH (c:Customer) WHERE c.fax IS NOT NULL RETURN c LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_22034,neo4jlabs_demo_db_northwind
List the suppliers who have a 'homePage' value that contains the string 'http'.,MATCH (s:Supplier) WHERE s.homePage CONTAINS 'http' RETURN s.companyName,neo4jLabs_synthetic_gemini,instance_id_32243,neo4jlabs_demo_db_northwind
List the Filings where the beneficiary bank and originator bank are from the same country.,MATCH (f:Filing) WHERE f.originator_bank_country = f.beneficiary_bank_country AND f.originator_bank_country IS NOT NULL RETURN f,neo4jLabs_synthetic_gpt4turbo,instance_id_21467,neo4jlabs_demo_db_fincen
Which 3 countries have entities that have filed the most concerning filings?,"MATCH (e:Entity)-[:FILED]->(f:Filing)-[:CONCERNS]->(:Entity) MATCH (e)-[:COUNTRY]->(c:Country) WITH c.name AS country, COUNT(f) AS filing_count ORDER BY filing_count DESC LIMIT 3 RETURN country, filing_count",neo4jLabs_synthetic_gpt4o,instance_id_41296,neo4jlabs_demo_db_fincen
List the first 3 actors born in France.,"MATCH (a:Actor) WHERE a.bornIn = ""France"" RETURN a.name ORDER BY a.born LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_42019,neo4jlabs_demo_db_recommendations
What is the maximum 'pid' value among all 'Application' nodes?,MATCH (app:Application) RETURN max(app.pid),neo4jLabs_synthetic_gemini,instance_id_31615,neo4jlabs_demo_db_network
What is the average rating of movies with a release year after 2010?,MATCH (m:Movie)<-[r:REVIEWED]-() WHERE m.released > 2010 RETURN avg(r.rating) AS average_rating,neo4jLabs_synthetic_gemini,instance_id_32659,neo4jlabs_demo_db_movies
What is the most common language among movies with a runtime longer than 3 hours?,"MATCH (m:Movie) WHERE m.runtime > 180 UNWIND m.languages AS language WITH language, count(*) AS count ORDER BY count DESC RETURN language LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29764,neo4jlabs_demo_db_recommendations
"Find the movies that have been directed by directors born in the same country as ""Steven Spielberg"".","MATCH (p:Person {name: ""Steven Spielberg""})-[r:DIRECTED]->(m:Movie) WITH p.bornIn AS birthPlace MATCH (d:Director {bornIn: birthPlace})-[r:DIRECTED]->(movie:Movie) RETURN DISTINCT movie.title",neo4jLabs_synthetic_gemini,instance_id_29538,neo4jlabs_demo_db_recommendations
"List the first 5 hashtags used in tweets posted by users followed by ""Neo4j"".",MATCH (neo4j:User {screen_name: 'neo4j'})-[:FOLLOWS]->(followedUser:User) MATCH (followedUser)-[:POSTS]->(tweet:Tweet) MATCH (tweet)-[:TAGS]->(hashtag:Hashtag) RETURN hashtag.name LIMIT 5,neo4jLabs_synthetic_gemini,instance_id_34564,neo4jlabs_demo_db_twitter
List the top 5 languages based on the number of movies originally in that language.,"MATCH (m:Movie)-[:ORIGINAL_LANGUAGE]->(l:Language) RETURN l.id AS LanguageID, l.name AS LanguageName, count(m) AS MovieCount ORDER BY MovieCount DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_23143,neo4jlabs_demo_db_eoflix
What are the names of the top 3 hashtags used in tweets?,"MATCH (:Tweet)-[:TAGS]->(h:Hashtag) RETURN h.name AS Hashtag, count(*) AS UsageCount ORDER BY UsageCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24224,neo4jlabs_demo_db_twitter
List the three entities with the most filings where the originator bank's ISO code is 'SGP'.,"MATCH (e:Entity)-[:FILED]->(f:Filing) WHERE f.originator_iso = 'SGP' WITH e, COUNT(f) AS num_filings ORDER BY num_filings DESC LIMIT 3 RETURN e.name AS entity_name, num_filings",neo4jLabs_synthetic_gpt4o,instance_id_41452,neo4jlabs_demo_db_fincen
List the top 3 filings with the most entities involved as beneficiaries from the same country.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country) WITH f, c, COUNT(DISTINCT e) AS beneficiary_count ORDER BY beneficiary_count DESC LIMIT 3 RETURN f.sar_id AS filing_id, beneficiary_count, COLLECT(c.name) AS countries",neo4jLabs_synthetic_gpt4o,instance_id_41468,neo4jlabs_demo_db_fincen
List the first 5 movies that have a language listed as 'French'.,"MATCH (m:Movie) WHERE 'French' IN m.languages RETURN m.title AS MovieTitle, m.languages AS Languages LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_42514,neo4jlabs_demo_db_recommendations
What are the first 3 filings with a beneficiary bank located in 'Angola' that involves the smallest amounts?,MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country {name: 'Angola'}) WITH f ORDER BY f.amount ASC RETURN f LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_26845,neo4jlabs_demo_db_fincen
Find the streams that are created before 2019 and are chatted in by users who are also VIPs of other streams.,MATCH (s:Stream)<-[:CHATTER]-(u:User)-[:VIP]->(:Stream) WHERE s.createdAt < datetime('2019-01-01T00:00:00.000000000Z') RETURN DISTINCT s,neo4jLabs_synthetic_gemini,instance_id_33938,neo4jlabs_demo_db_twitch
"""How many movies have Brad Pitt acted in from 1980 to 2000? ""","MATCH (p:Person {name: ""Brad Pitt""})-[:ACTED_IN]->(m:Movie) WHERE m.released >= 1980 AND m.released <= 2000 RETURN COUNT(m) AS movies_count",neo4j_crowdsourced,instance_id_27402,neo4jlabs_demo_db_movies
What is the name of the team with the most streams?,"MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WITH t.name AS teamName, count(s) AS streamCount ORDER BY streamCount DESC LIMIT 1 RETURN teamName",neo4jLabs_synthetic_gemini,instance_id_33730,neo4jlabs_demo_db_twitch
"List the movies with the review summary containing ""amazing"" and have a rating above 90.",MATCH (m:Movie)<-[r:REVIEWED]-() WHERE r.summary CONTAINS 'amazing' AND r.rating > 90 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_32653,neo4jlabs_demo_db_movies
List the first 3 streams that have chatters who are also streams.,MATCH (s:Stream)-[:CHATTER]->(c:Stream) RETURN s LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24564,neo4jlabs_demo_db_twitch
Which users have retweeted 'Neo4j' and have a profile image URL? List the first 3.,MATCH (u:User)-[:POSTS]->(t:Tweet)-[:RETWEETS]->(:Tweet)-[:MENTIONS]->(m:User {name: 'Neo4j'}) WHERE u.profile_image_url IS NOT NULL RETURN u LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24820,neo4jlabs_demo_db_twitter
Which country has produced the most movies with an IMDB rating above 8.5?,"MATCH (m:Movie) WHERE m.imdbRating > 8.5 UNWIND m.countries AS country WITH country, count(DISTINCT m) AS movieCount ORDER BY movieCount DESC RETURN country, movieCount LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29878,neo4jlabs_demo_db_recommendations
List the top 5 movies by revenue.,MATCH (m:Movie) WHERE m.revenue IS NOT NULL RETURN m ORDER BY m.revenue DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_23400,neo4jlabs_demo_db_eoflix
What are the names of the top 5 users with the highest betweenness?,MATCH (u:User) RETURN u.name ORDER BY u.betweenness DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24882,neo4jlabs_demo_db_twitter
List the productName of the top 3 least expensive products.,MATCH (p:Product) RETURN p.productName ORDER BY p.unitPrice ASC LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_32491,neo4jlabs_demo_db_northwind
List the users that Neo4j follows and their follower count in descending order of follower count.,"MATCH (u:User {screen_name: ""neo4j""})-[:FOLLOWS]->(followed) RETURN followed.screen_name, followed.followers ORDER BY followed.followers DESC",neo4jLabs_synthetic_gemini,instance_id_34477,neo4jlabs_demo_db_twitter
List the 5 most recently released movies with a plot description available.,MATCH (m:Movie) WHERE m.plot IS NOT NULL RETURN m ORDER BY m.released DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_26129,neo4jlabs_demo_db_recommendations
List the first 5 countries by the number of filings where they are the beneficiary.,"MATCH (f:Filing)-[:BENEFITS]->(e:Entity)-[:COUNTRY]->(c:Country) WITH c, count(f) AS filingsCount ORDER BY filingsCount DESC RETURN c.name AS CountryName, filingsCount LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21427,neo4jlabs_demo_db_fincen
Name the top 5 highest-grossing movies.,"MATCH (m:Movie) WHERE m.revenue IS NOT NULL RETURN m.title, m.revenue ORDER BY m.revenue DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_25420,neo4jlabs_demo_db_recommendations
What is the total number of ratings in the database?,MATCH ()-[:RATED]->() RETURN count(*) AS totalRatings,neo4jLabs_synthetic_gemini,instance_id_29316,neo4jlabs_demo_db_recommendations
Which genre has the most movies with a strong female lead?,"MATCH (g:Genre)<-[:IN_GENRE]-(m:Movie) WITH g, count(m) AS movieCount RETURN g.name AS genre, movieCount ORDER BY movieCount DESC",neo4jLabs_synthetic_gemini,instance_id_29406,neo4jlabs_demo_db_recommendations
"List the `country_codes` of entities with `jurisdiction_description` ""Samoa"".",MATCH (e:Entity {jurisdiction_description: 'Samoa'}) RETURN e.country_codes,neo4jLabs_synthetic_gemini,instance_id_30558,neo4jlabs_demo_db_offshoreleaks
What is the name of the Software that has the least versions?,"MATCH (s:Software) WITH s, size(s.versions) AS versionCount ORDER BY versionCount ASC LIMIT 1 RETURN s.name",neo4jLabs_synthetic_gemini,instance_id_32460,neo4jlabs_demo_db_network
Which 3 products have the highest units on order and are not discontinued?,"MATCH (p:Product) WHERE p.discontinued = false AND p.unitsOnOrder IS NOT NULL RETURN p.productName, p.unitsOnOrder ORDER BY p.unitsOnOrder DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_20371,neo4jlabs_demo_db_northwind
Name 3 persons who have directed a movie with a tagline containing 'limits'.,MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE m.tagline CONTAINS 'limits' RETURN p.name LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24014,neo4jlabs_demo_db_movies
"List the movies with a review summary containing the word ""compelling"".",MATCH (m:Movie)<-[r:REVIEWED]-(p:Person) WHERE r.summary CONTAINS 'compelling' RETURN DISTINCT m.title,neo4jLabs_synthetic_gemini,instance_id_33038,neo4jlabs_demo_db_movies
List the movies released between 1990 and 2000 with a rating lower than 60.,"MATCH (m:Movie) WHERE m.released >= 1990 AND m.released <= 2000 WITH m  MATCH (p:Person)-[r:REVIEWED]->(m) WHERE r.rating < 60  RETURN m.title, r.rating",neo4jLabs_synthetic_gemini,instance_id_32879,neo4jlabs_demo_db_movies
Find the tweets posted by 'Neo4j' that have been replied to by at least 3 different users.,"MATCH (neo4j:User {name: 'Neo4j'})-[:POSTS]->(tweet:Tweet)<-[:REPLY_TO]-(:Tweet)<-[:POSTS]-(u:User) WITH tweet, count(DISTINCT u) AS reply_count WHERE reply_count >= 3 RETURN tweet.id, tweet.text",neo4jLabs_synthetic_gemini,instance_id_34590,neo4jlabs_demo_db_twitter
List the top 5 filings where the beneficiary bank's country and originator bank's country are different and the amount is above 1 million.,MATCH (f:Filing) WHERE f.amount > 1000000 AND f.originator_bank_country <> f.beneficiary_bank_country RETURN f ORDER BY f.amount DESC LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_41175,neo4jlabs_demo_db_fincen
What is the name of the Egress that has the most Interfaces connected to it?,"MATCH (e:Egress)-[:ROUTES]->(i:Interface) WITH e, count(i) AS interfaceCount RETURN e.name AS egressName, interfaceCount ORDER BY interfaceCount DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32473,neo4jlabs_demo_db_network
"Which person has acted in, directed, and produced the same movie?","MATCH (p:Person)-[:ACTED_IN]->(m:Movie) MATCH (p)-[:DIRECTED]->(m) MATCH (p)-[:PRODUCED]->(m) RETURN p.name, m.title",neo4jLabs_synthetic_gpt4turbo,instance_id_23682,neo4jlabs_demo_db_movies
What are the first 3 streams that have a follower count between 20000 and 50000?,MATCH (s:Stream) WHERE s.followers >= 20000 AND s.followers <= 50000 RETURN s ORDER BY s.createdAt ASC LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24385,neo4jlabs_demo_db_twitch
What are the names of the first 5 streams created before 2010?,MATCH (s:Stream) WHERE s.createdAt < datetime('2010-01-01T00:00:00Z') RETURN s.name ORDER BY s.createdAt ASC LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_43662,neo4jlabs_demo_db_twitch
What is the name of the Data Center that contains the Router with the highest zone number?,MATCH (r:Router) WITH max(r.zone) AS max_zone MATCH (r:Router {zone: max_zone})-[:CONTAINS]-(dc:DataCenter) RETURN dc.name,neo4jLabs_synthetic_gemini,instance_id_32426,neo4jlabs_demo_db_network
"""what are the primary languages in the films starred by actors in [Jumanji]""","MATCH (m:Movie {title: ""Jumanji""})<-[:CAST_FOR]-(p:Person)-[:CAST_FOR]->(movies:Movie)-[:ORIGINAL_LANGUAGE]->(lang:Language) RETURN DISTINCT lang.name",neo4j_crowdsourced,instance_id_27647,neo4jlabs_demo_db_eoflix
Find the first three movies reviewed with a rating above 90.,"MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE r.rating > 90 RETURN m.title, r.rating ORDER BY r.rating DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_40112,neo4jlabs_demo_db_movies
List the top 5 tweets which mention the user with the highest followers.,MATCH (u:User) WITH u ORDER BY u.followers DESC LIMIT 1 MATCH (t:Tweet)-[:MENTIONS]->(u) RETURN t ORDER BY t.favorites DESC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24976,neo4jlabs_demo_db_twitter
What is the highest budget recorded for a movie?,MATCH (m:Movie) RETURN max(m.budget) AS max_budget,neo4jLabs_synthetic_gemini,instance_id_34266,neo4jlabs_demo_db_eoflix
What is the total revenue of movies released by Warner Bros. Pictures?,MATCH (m:Movie) WHERE 'USA' IN m.countries WITH sum(m.revenue) AS totalRevenue RETURN totalRevenue,neo4jLabs_synthetic_gemini,instance_id_29600,neo4jlabs_demo_db_recommendations
List the 3 movies with the lowest average ratings in the REVIEWED relationship.,"MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WITH m, AVG(r.rating) AS avgRating ORDER BY avgRating ASC LIMIT 3 RETURN m.title, avgRating",neo4jLabs_synthetic_gpt4turbo,instance_id_24010,neo4jlabs_demo_db_movies
What is the average number of followers for streams that have both VIP and chatter users?,MATCH (s:Stream) WHERE EXISTS { (s)-[:VIP]->(:User) }   AND EXISTS { (s)-[:CHATTER]->(:User) } WITH avg(s.followers) AS average_followers RETURN average_followers,neo4jLabs_synthetic_gemini,instance_id_34065,neo4jlabs_demo_db_twitch
Who follows 'neo4j' and has a higher follower count than 'neo4j'?,"MATCH (me:Me {screen_name: 'neo4j'})-[:FOLLOWS]->(user:User) WHERE user.followers > me.followers RETURN user.screen_name AS follower_screen_name, user.followers AS follower_count",neo4jLabs_synthetic_gpt4o,instance_id_43157,neo4jlabs_demo_db_twitter
Who are the actors that have acted in both 'The Matrix' and 'Speed Racer'?,"MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE m.title IN ['The Matrix', 'Speed Racer'] WITH p, count(m) AS movies_count WHERE movies_count = 2 RETURN p.name",neo4jLabs_synthetic_gpt4turbo,instance_id_23515,neo4jlabs_demo_db_movies
Show the streams that have the most teams associated with them.,"MATCH (s:Stream)-[:HAS_TEAM]->(t:Team) WITH s, count(t) AS teamCount ORDER BY teamCount DESC RETURN s, teamCount",neo4jLabs_synthetic_gpt4turbo,instance_id_25439,neo4jlabs_demo_db_twitch
Which categories include products with a reorder level of 25?,MATCH (p:Product)-[:PART_OF]->(c:Category) WHERE p.reorderLevel = 25 RETURN DISTINCT c.categoryName,neo4jLabs_synthetic_gpt4turbo,instance_id_20486,neo4jlabs_demo_db_northwind
What are the first 3 movies with the highest ratings reviewed by people born after 1980?,"MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE p.born > 1980 RETURN m.title, r.rating ORDER BY r.rating DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_24108,neo4jlabs_demo_db_movies
"List the first 3 users who replied to tweets that mention ""Neo4j"".",MATCH (t:Tweet)<-[:POSTS]-(u:User) WHERE t.text CONTAINS 'Neo4j' WITH DISTINCT u RETURN u.screen_name AS user_screen_name LIMIT 3,neo4jLabs_synthetic_gemini,instance_id_34487,neo4jlabs_demo_db_twitter
"What is the average rating of movies with a title that contains the word ""Pulp""?",MATCH (m:Movie) WHERE m.title CONTAINS 'Pulp' WITH avg(m.votes) AS average_rating RETURN average_rating,neo4jLabs_synthetic_gemini,instance_id_33085,neo4jlabs_demo_db_movies
Provide the names of entities that were incorporated on '10-JAN-2006' and have a jurisdiction of 'SAM'.,MATCH (e:Entity) WHERE e.incorporation_date = '10-JAN-2006' AND e.jurisdiction = 'SAM' RETURN e.name,neo4jLabs_synthetic_gpt4o,instance_id_44812,neo4jlabs_demo_db_offshoreleaks
List the summaries of reviews for movies with a rating lower than 60.,MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE r.rating < 60 RETURN r.summary,neo4jLabs_synthetic_gemini,instance_id_33128,neo4jlabs_demo_db_movies
What is the name of the movie with the lowest IMDb rating that was released after 2000?,"MATCH (m:Movie) WHERE m.year > 2000 RETURN m.title, m.imdbRating ORDER BY m.imdbRating ASC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_29539,neo4jlabs_demo_db_recommendations
What is the total number of filings where the 'originator_country' is the same as the 'beneficiary_country'?,MATCH (f:Filing) WHERE f.originator_country = f.beneficiary_country RETURN count(f),neo4jLabs_synthetic_gemini,instance_id_29059,neo4jlabs_demo_db_fincen
What are the top 3 entities by the number of filings they originated in 2007?,"MATCH (e:Entity)-[:FILED]->(f:Filing) WHERE f.begin >= datetime('2007-01-01T00:00:00Z') AND f.end <= datetime('2007-12-31T23:59:59Z') WITH e, count(f) AS filings_count ORDER BY filings_count DESC LIMIT 3 RETURN e.name AS entity_name, filings_count",neo4jLabs_synthetic_gpt4o,instance_id_41094,neo4jlabs_demo_db_fincen
"When does the subscription with id ""e74f7163-eace-4169-8043-41627f1fe236"" expire?","MATCH (s:Subscription {id: ""e74f7163-eace-4169-8043-41627f1fe236""}) RETURN s.expiresAt",neo4jLabs_synthetic_gemini,instance_id_34614,neo4jlabs_demo_db_eoflix
Provide the names of all entities that have a tax status description.,MATCH (e:Entity) WHERE e.tax_stat_description IS NOT NULL RETURN e.name,neo4jLabs_synthetic_gpt4turbo,instance_id_21116,neo4jlabs_demo_db_offshoreleaks
Find all machines running OS named 'RHEL' in the first 5 racks of zone 1.,"MATCH (dc:DataCenter)-[:CONTAINS]->(r:Rack {zone: 1}) WHERE r.rack <= 5 MATCH (r)-[:HOLDS]->(m:Machine)-[:RUNS]->(os:OS {name: 'RHEL'}) RETURN m.name AS MachineName, os.name AS OSName",neo4jLabs_synthetic_gpt4turbo,instance_id_20184,neo4jlabs_demo_db_network
Which 3 entities have been the originator in filings with the highest total amounts transferred?,"MATCH (e:Entity)-[:ORIGINATOR]->(f:Filing) WITH e, sum(f.amount) AS totalAmount ORDER BY totalAmount DESC LIMIT 3 RETURN e.name AS EntityName, totalAmount",neo4jLabs_synthetic_gpt4turbo,instance_id_21387,neo4jlabs_demo_db_fincen
Find the first three movies with a tagline that includes the word 'journey' and were released before the year 2000.,MATCH (m:Movie) WHERE m.tagline CONTAINS 'journey' AND m.released < 2000 RETURN m ORDER BY m.released LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_24078,neo4jlabs_demo_db_movies
What is the IP of the Interface connected to the Egress 'DC1-RE'?,MATCH (e:Egress {name: 'DC1-RE'})-[:ROUTES]->(i:Interface) RETURN i.ip AS InterfaceIP,neo4jLabs_synthetic_gpt4o,instance_id_43800,neo4jlabs_demo_db_network
Which movies have 'Robin Williams' mentioned in the review summary?,MATCH (p:Person)-[r:REVIEWED]->(m:Movie) WHERE r.summary CONTAINS 'Robin Williams' RETURN m.title AS MovieTitle,neo4jLabs_synthetic_gpt4o,instance_id_39409,neo4jlabs_demo_db_movies
List the first 3 applications that depend on the service named 'java'.,MATCH (app:Application)-[:DEPENDS_ON]->(service:Service {name: 'java'}) RETURN app.name LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_44074,neo4jlabs_demo_db_network
List the 3 streams that have been followed by more than 1 million users.,"MATCH (s:Stream) WHERE s.followers > 1000000 RETURN s.name, s.followers ORDER BY s.followers DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_43336,neo4jlabs_demo_db_twitch
Identify the streams with more than 3 VIP users.,"MATCH (s:Stream)-[:VIP]->(u:User) WITH s, COUNT(u) AS vipCount WHERE vipCount > 3 RETURN s.name AS streamName, vipCount",neo4jLabs_synthetic_gpt4o,instance_id_43589,neo4jlabs_demo_db_twitch
Which movie has the highest IMDb rating and was released in the 1990s?,"MATCH (m:Movie) WHERE m.released >= 1990 AND m.released <= 1999 RETURN m.title, m.released ORDER BY m.released DESC LIMIT 1",neo4jLabs_synthetic_gemini,instance_id_32964,neo4jlabs_demo_db_movies
List the top 3 movies with the tagline 'What price would you put on your health?',"MATCH (m:Movie) WHERE m.tagline = 'What price would you put on your health?' RETURN m.title, m.average_vote ORDER BY m.average_vote DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_44378,neo4jlabs_demo_db_eoflix
"""Return all movies""",MATCH (m:Movie) RETURN m,neo4j_crowdsourced,instance_id_27860,neo4jlabs_demo_db_movies
"""Which actor worked with the same actors as Kevin Bacon?""","MATCH (kevin:Person {name: ""Kevin Bacon""})-[:ACTED_IN]->(m:Movie)<-[:ACTED_IN]-(coActor:Person),       (coActor)-[:ACTED_IN]->(m2:Movie)<-[:ACTED_IN]-(otherActor:Person) WHERE NOT otherActor.name = ""Kevin Bacon"" RETURN DISTINCT otherActor.name",neo4j_crowdsourced,instance_id_27853,neo4jlabs_demo_db_movies
List the movies that have been tagged with the keyword 'explosive'.,MATCH (m:Movie)-[:HAS_KEYWORD]->(k:Keyword {name: 'explosive'}) RETURN m,neo4jLabs_synthetic_gpt4turbo,instance_id_20847,neo4jlabs_demo_db_eoflix
Identify the first 3 Applications running on Machine 'DC1-RCK-1-1-M-1'.,MATCH (m:Machine {name: 'DC1-RCK-1-1-M-1'})-[:RUNS]->(app:Application) RETURN app LIMIT 3,neo4jLabs_synthetic_gpt4turbo,instance_id_20875,neo4jlabs_demo_db_network
List entities with their service providers and incorporation dates.,"MATCH (e:Entity) RETURN e.name AS EntityName, e.service_provider AS ServiceProvider, e.incorporation_date AS IncorporationDate",neo4jLabs_synthetic_gpt4turbo,instance_id_21316,neo4jlabs_demo_db_offshoreleaks
List the top 5 customers who have ordered the most units of a single product.,"MATCH (c:Customer)-[:PURCHASED]->(o:Order)-[r:ORDERS]->(p:Product) RETURN c.companyName, SUM(r.quantity) AS totalUnitsOrdered ORDER BY totalUnitsOrdered DESC LIMIT 5",neo4jLabs_synthetic_gpt4turbo,instance_id_21844,neo4jlabs_demo_db_northwind
List the top 3 filings with the highest amount.,"MATCH (f:Filing) RETURN f.sar_id, f.amount ORDER BY f.amount DESC LIMIT 3",neo4jLabs_synthetic_gpt4o,instance_id_41051,neo4jlabs_demo_db_fincen
"List the first 3 videos that share the same genre as the movie ""Toy Story"".","MATCH (m:Movie {title: ""Toy Story""})-[:IN_GENRE]->(g:Genre) WITH g MATCH (g)<-[:IN_GENRE]-(v:Video) WITH v.title AS videoTitle LIMIT 3 RETURN collect(videoTitle) AS videoTitles",neo4jLabs_synthetic_gemini,instance_id_34609,neo4jlabs_demo_db_eoflix
What is the average rating of movies directed by the person born in 1965?,MATCH (p:Person {born: 1965})-[:DIRECTED]->(m:Movie)<-[r:REVIEWED]-() WITH avg(r.rating) AS average_rating RETURN average_rating,neo4jLabs_synthetic_gemini,instance_id_32913,neo4jlabs_demo_db_movies
Retrieve the first 3 filings with a beneficiary bank country of 'United Kingdom' and an amount less than 500000.,MATCH (f:Filing) WHERE f.beneficiary_bank_country = 'United Kingdom' AND f.amount < 500000 RETURN f ORDER BY f.begin LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_41149,neo4jlabs_demo_db_fincen
Which Process instances are linked to Version '7.1'?,"MATCH (v:Version {name: '7.1'})<-[:INSTANCE]-(p:Process) RETURN p.name AS processName, p.startTime AS startTime, p.pid AS pid",neo4jLabs_synthetic_gpt4o,instance_id_44128,neo4jlabs_demo_db_network
Display the country codes for the top 3 countries where the originator entities of filings are located.,"MATCH (e:Entity)-[:ORIGINATOR]->(f:Filing) MATCH (e)-[:COUNTRY]->(c:Country) RETURN c.code AS CountryCode, count(e) AS OriginatorCount ORDER BY OriginatorCount DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21539,neo4jlabs_demo_db_fincen
What are the first 3 filings where the originator bank's country is 'Angola'?,MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity)-[:COUNTRY]->(c:Country {name: 'Angola'}) RETURN f ORDER BY f.begin LIMIT 3,neo4jLabs_synthetic_gpt4o,instance_id_41801,neo4jlabs_demo_db_fincen
List the names of all applications that have a dependency on the process with pid 2586.,MATCH (p:Process {pid: 2586})<-[:DEPENDS_ON]-(a:Application) RETURN a.name,neo4jLabs_synthetic_gemini,instance_id_32387,neo4jlabs_demo_db_network
What are the top 5 filings with the most entities involved as originators?,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WITH f, count(e) AS numEntities ORDER BY numEntities DESC LIMIT 5 RETURN f, numEntities",neo4jLabs_synthetic_gpt4turbo,instance_id_22799,neo4jlabs_demo_db_fincen
"Find all games played by streams that have at least one VIP who is also a chatter in a stream that belongs to a team created before 2018 and has ""Gaming"" in its name.",MATCH (s1:Stream)-[:VIP]->(u1:User)-[:CHATTER]->(s2:Stream) WHERE EXISTS {   MATCH (s2)-[:HAS_TEAM]->(t:Team)   WHERE t.createdAt < datetime('2018-01-01') AND toLower(t.name) CONTAINS 'gaming' } MATCH (s1)-[:PLAYS]->(g:Game) RETURN DISTINCT g.name,neo4jLabs_synthetic_gemini,instance_id_33827,neo4jlabs_demo_db_twitch
Show the top 5 movies with the shortest runtime.,MATCH (m:Movie) WHERE m.runtime IS NOT NULL RETURN m ORDER BY m.runtime ASC LIMIT 5,neo4jLabs_synthetic_gpt4turbo,instance_id_24671,neo4jlabs_demo_db_recommendations
Find the top 5 tweets mentioning 'neo4j' with the most favorites.,"MATCH (t:Tweet)-[:MENTIONS]->(u:User {screen_name: 'neo4j'}) RETURN t.text AS tweet_text, t.favorites AS favorites ORDER BY t.favorites DESC LIMIT 5",neo4jLabs_synthetic_gpt4o,instance_id_43058,neo4jlabs_demo_db_twitter
"Which movies have a review summary containing both ""Jerry"" and ""You had me at""?",MATCH (m:Movie)<-[r:REVIEWED]-() WHERE r.summary CONTAINS 'Jerry' AND r.summary CONTAINS 'You had me at' RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_33008,neo4jlabs_demo_db_movies
What is the average number of filings per country?,"MATCH (f:Filing) WITH f.originator_iso AS countryCode, count(*) AS filingCount WITH avg(filingCount) AS averageFilingsPerCountry RETURN averageFilingsPerCountry",neo4jLabs_synthetic_gemini,instance_id_28246,neo4jlabs_demo_db_fincen
Display streams that have a language set to 'en' and were created before 2012.,MATCH (s:Stream)-[:HAS_LANGUAGE]->(l:Language) WHERE l.name = 'en' AND s.createdAt < datetime('2012-01-01T00:00:00Z') RETURN s,neo4jLabs_synthetic_gpt4o,instance_id_43656,neo4jlabs_demo_db_twitch
What are the names of the intermediaries that have a 'similar' relationship with other intermediaries and have a 'status' of 'ACTIVE'?,MATCH (i:Intermediary)-[:similar]->(i2:Intermediary) WHERE i.status = 'ACTIVE' RETURN DISTINCT i.name,neo4jLabs_synthetic_gemini,instance_id_30529,neo4jlabs_demo_db_offshoreleaks
Which 5 products have the most suppliers?,"MATCH (p:Product)<-[:SUPPLIES]-(s:Supplier) WITH p, count(s) AS supplierCount ORDER BY supplierCount DESC LIMIT 5 RETURN p.productName, supplierCount",neo4jLabs_synthetic_gpt4turbo,instance_id_21914,neo4jlabs_demo_db_northwind
Which users have a betweenness higher than 300000000?,"MATCH (u:User) WHERE u.betweenness > 300000000 RETURN u.screen_name, u.betweenness",neo4jLabs_synthetic_gpt4o,instance_id_43188,neo4jlabs_demo_db_twitter
Which 5 filings have the earliest begin dates?,MATCH (f:Filing) RETURN f ORDER BY f.begin ASC LIMIT 5,neo4jLabs_synthetic_gpt4o,instance_id_41130,neo4jlabs_demo_db_fincen
List the suppliers who are based in non-UK European countries.,"MATCH (s:Supplier) WHERE s.country <> ""UK"" AND s.country IN [""Germany"", ""France"", ""Italy"", ""Spain"", ""Netherlands"", ""Belgium"", ""Sweden"", ""Norway"", ""Denmark"", ""Finland"", ""Poland"", ""Ireland"", ""Czech Republic"", ""Greece"", ""Portugal"", ""Hungary"", ""Austria"", ""Switzerland"", ""Bulgaria"", ""Slovakia"", ""Belarus"", ""Romania"", ""Croatia"", ""Lithuania"", ""Latvia"", ""Estonia"", ""Slovenia"", ""Luxembourg"", ""Malta"", ""Cyprus""] RETURN s",neo4jLabs_synthetic_gpt4turbo,instance_id_22021,neo4jlabs_demo_db_northwind
What are the names of entities that are registered in Samoa and have been struck off after 2010?,MATCH (e:Entity) WHERE e.jurisdiction_description = 'Samoa' AND e.struck_off_date >= '01-JAN-2011' RETURN e.name,neo4jLabs_synthetic_gpt4turbo,instance_id_21281,neo4jlabs_demo_db_offshoreleaks
What are the top 3 originator banks in filings from the United Kingdom?,"MATCH (f:Filing)-[:ORIGINATOR]->(e:Entity) WHERE f.originator_bank_country = ""United Kingdom"" RETURN e.name AS OriginatorBank, count(f) AS NumberOfFilings ORDER BY NumberOfFilings DESC LIMIT 3",neo4jLabs_synthetic_gpt4turbo,instance_id_21503,neo4jlabs_demo_db_fincen
"What is the name of the movie with the highest revenue in the ""Adventure"" genre?",MATCH (g:Genre {name: 'Adventure'})<-[:IN_GENRE]-(m:Movie) WITH m ORDER BY m.revenue DESC LIMIT 1 RETURN m.title,neo4jLabs_synthetic_gemini,instance_id_29834,neo4jlabs_demo_db_recommendations
How many routers are there in DataCenter DC1?,MATCH (dc:DataCenter {name: 'DC1'})-[:CONTAINS]->(r:Router) RETURN count(r) AS numberOfRouters,neo4jLabs_synthetic_gpt4o,instance_id_43718,neo4jlabs_demo_db_network
